// This file is auto-generated. Do not edit it directly.
import { Article } from '@/types/article';

export const articles: Article[] = [
  {
    "id": "girls-secret-context",
    "title": "廣寒宮｜台男看不出女生言行間潛藏的內容",
    "content": "這真的是台男困境",
    "markdown": "前陣子在 thread 上看到一個女生抱怨男生不懂他在說什麼。過程大概是男生問女生還想不想吃，女生說可以吃也可以不吃，男生就不爽了，覺得這樣他不知道該怎麼辦。\n\n這個問題其實很單純，一個人想要知道現在能不能閃人，一個人覺得都可以。但前者沒有問對問題，後者沒有回答清楚，雙方都不知道對方想要問什麼跟在回答什麼。\n\n2024 的「正常人」台男常常會陷入一個沒辦法自己做決定的困境，也就是如果現在說：\n\n1. 那我們走吧：在某些情況常常被念，對方可能會說「你幹嘛那麼急」、「我還想吃甜點」、「等我一下我還要擦口紅幹嘛不等我」之類的\n2. 如果遲遲不走：對方如果又不是會主動說出「我們走吧」的人，就卡在那邊不知道該怎麼辦，場面陷入尷尬，而這通常是男生的責任，因為一個男生被感到無聊、拖延、沒效率，從內從外都對男生更不利\n\n因為男生可能也不知道怎麼樣問出正確的問題，才會導致問出「你吃飽沒」這個問題，在各種情況下每次都得不到明確的答案，自己做決定又會被念被罵，甚至被發上社群媒體公審，自然覺得很厭煩。陷入一個過度貼心也不是、主動選擇又是自私、大男人主義的困境\n\n而就我的觀察，女生常常會覺得自己的回答男生都能懂，所以會「無意中地」省略了許多字\n\n例如「我可以不吃，如果要再吃也可以再吃，或陪你吃」，先不管女生會不會陪男生吃，總歸這句話其實是「我已經吃飽了」的意思，所以男生就可以走人了，嗎？\n\n其實不行，所以如果這個情況真的如我所說是想知道能不能走了，那可能還要再有一些事件觸發，例如男生先去結帳然後女生有機會上個廁所、補妝之類的。\n\n所以更好的解決方式會提出問題是：「你還有想吃什麼嗎？」確認沒有再說：「那我先去結帳，你可以再坐一下。」雖然這裡很有可能出現就是問你還有想吃什麼，對方回說都可以，然後你說要去結帳或走人，結果對方其實心裡還想吃甜點但不敢說，回來跟姐妹罵你不貼心的情況發生\n\n所以最好的辦法就是把甜點之類的問一次，確認對方真的不吃了，過程中只要女生稍有遲疑就點下去。\n\n> 打個預防針，如果想要 AA/AB 這邊可以自行調整問句，不要跟我吵誰應該付錢。\n\n總歸大部分女生的回答通常是藏起來的，大部分的男生會被詬病，通常就是沒耐心玩猜猜樂就是根本不知道原來話中有話。從男生的角度很常覺得為什麼不把話講清楚，但男女本來就是思考邏輯完全不同的生物，早點接受這點然後做出改變可能會比較適應 2024 年以後的感情生活\n\n但誰有義務這樣猜對方在說什麼呢，通常都是那個想要解決問題的人，而被問的人通常是有許多餘裕的人\n\n例如追人的人之於被追的人，例如趕時間的人之於悠閒的人，例如沒有行情的人之於很有行情的人，例如有較少選擇的人之於有更多選擇的人。甚至可能是沒耐心的人之於很 chill 的人\n\n這樣去想就能找到自己在感情中的定位，當然很幸運的可能兩個人差不多，那要不是一起迅速解決不然就是一起拖拖拉拉。不然就是雙方早早認清彼此都是怎樣的人，然後習慣於這樣的生活模式\n\n並不是說玩猜猜樂是錯誤的行為，至少在感情上不是，因為都是自己選擇的。當然在工作上這樣表達會被靠北到飛起來是後話了，總而言之這是談戀愛不是工作。所以要解決問題的話，其中一方一定要改變，不然直到 70 歲這個事情還是會一直發。\n\n這也是為什麼我覺得下面有人留言說如果男生回：「我可以買包包給你，也可以不買給你」是一個錯誤的例子，因為在這個情況下女生是有餘裕以及做選擇的人，所以自然會說那我要買你去付錢。沒有那個猜猜樂跟覺得厭煩的過程。\n\n> 正確的同類案例是：「你可以跟男生出去呀，也可以不要去。」\n\n這時候「在乎男生的女生」就會知道對方其實不太想讓自己去，至於最後怎麼選擇不是今天討論的重點，但這就是大部分女生跟男生思考模式的不同。\n\n當然也會有很多女生覺得這樣說話的人很北爛，會覺得這樣在情緒勒索幹嘛不把話說清楚，所以當然不是每個女生都是這樣。主要可能還是要找到自己適合的人，不然就是練習把話說清楚、問題問清楚。\n\n",
    "date": "2024-07-28",
    "tags": [
      "廣寒宮"
    ],
    "isPinned": false,
    "textCount": 1638
  },
  {
    "id": "how-to-chat",
    "title": "廣寒宮｜心碎小狗醫療包（二）聊天問答",
    "content": "聊天聊得好，嗷嗷沒煩惱（啥是嗷嗷？）",
    "markdown": "### Intro I\n前陣子看到又風靡起來的一個心理學家 36 題可以讓兩個陌生人愛上彼此的文，其實內容跟方向是很不錯的，只是這個實驗有一個前提讓這些問題顯得非常合理以及具有必須回答性，就是已經告訴兩人這是一個實驗，接下來請問彼此這些問題。\n\n但在現實情況裡面其實我們很難真的拿出一個 list 然後彷彿 interview 一樣詢問對方，而且如果問題（話題）之間沒有連貫性，可能會顯得過於冒犯或者突兀，進而產生反效果，所以今天這篇文章就是我發表一下自己的 question lists，非常好用，歡迎大家多多嘗試跟收藏。\n\n### Intro II\n前陣子看到這個影片，很多女生都自以為很懂女生，但其實他們根本不懂。舉例來說最簡單的：你要怎麼跟一個陌生女生起頭？你要怎麼與一個女生朋友開啟話題？如果一個女生他說他不知道要吃什麼、要去哪，你是要問他出一個答案還是自己做決定？\n\n結論是大家腦袋裡一定會有一種怎麼做都錯的感覺對吧，那你來對地方了。\n\n> Online dating for women is like shopping. For men it's like a job interview.\n> \"I had to lead the conversation, and they didn't even make an effort\"\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/DZTIbHIsIYw?si=NsNFnmDhzWQgGcc8\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n\n如果要追女生而你去問女生那基本上是掰掰了，因為女生常常會說出他們認為他們在乎的點，但實際上最後那些點並不重要。給你一些建議，但如果從男生的角度做出來下秒就是掰掰，所以身為一個男生，我還是給各位一些真的有用的建議。\n\n### Requirements \n以下這些 requirements 無論在何時何地：\n\n只要你還沒告白成功請在每次開始聊天之前拿出來複誦三遍。\n\n只要你還沒告白成功請在每次開始聊天之前拿出來複誦三遍。\n\n只要你還沒告白成功請在每次開始聊天之前拿出來複誦三遍。\n\n1. （⤵️）表示可以很好的銜接下一個問題，所以當你看這個符號，在聊完當前話題之後可以銜接著問下一個問題\n1. 不要一直問別人問題，也要「適當」表達自己（當然也不要一直炫耀自己跟自顧自說自己），要讓對方有空問自己問題，跟正確的休息留白。聊天跟認識的過程最怕搞得跟面試一樣或者搞得跟死魚一樣，前者是狂問對方，後者是顯露出不感興趣的樣子，所以時時刻刻記著有來有往，這樣才有互動的效果。\n1. 不要直戳問題，可以從自己最近看到什麼當作旁敲或各種方式，再慢慢帶到主要問題。直接戳主題很像有目的性，尤其是感情或工作的問題，所以如果能從旁帶到是最好，或者是「先說自己絕對怎麼樣，再問對方」。但如果像是你是哪裡人、想去哪裡玩這種粗淺的問題就沒差了，這就是在兩個人見面剛開始起頭用的萬用話題。\n1. 不要過度探聽別人的過去跟隱私\n1. 儘量不要主動提到婚喪喜慶，儘量不要提到悲傷回憶，除非你們已經有基本程度的認識，就可以慢慢往深處走。要讓對方在想起你都是快樂的回憶，如果對方主動提起負面情緒，當然是很好的機會接住對方，至於怎麼安慰跟當個好聆聽者這以前好像有講過，未來也會再提到。\n1. 儘量不要主動聊到工作，畢竟工作對很多人來說是麻煩且不喜歡的事情，所以下班了還要一直聊工作某些人會覺得很煩。不過如果對方聊起來了工作那當然就沒問題了，只是記得不要炫耀自己也不要毫不表態。\n1. 以下這些問題盡量省著點用，不要想著一次就把這些用完，能跟對方自行延伸出更多話題是好事，話題就跟金礦一樣你不會想要一次把老本用完。\n1. 如果要稱讚對方，要說你很與眾不同（特別、有想法），而不是你很漂亮、你很厲害之類的\n\n### Beginning\n1. 你是哪裡人（⤵️）\n1. 現在最想去哪個國家\n1. 你是 I 人還是 E 人（⤵️）\n1. 打電話之前你會先排練一下要說什麼嗎\n1. 你平常下班之後都在做什麼（⤵️）\n1. 那對你來說完美的一天是什麼樣的？\n1. 你的家人平常會問你的工作嗎（間接得知工作情況）（⤵️）\n1. 你和家人關係好嗎（可以先訴說自己的狀態再問：像我小時候爸媽在國外工作，家裡都是放任式教育，感覺就不怎麼親密）\n1. 你現在有想看什麼演唱會嗎（⤵️）\n1. 如果要推薦我一張專輯你會推給我這個人的嗎，還是你有更想推薦哪張（之後可以買給對方當禮物）\n\n### Medium\n1. 最近有遇到什麼困擾的事情嗎（⤵️）\n1. 你最想要什麼超能力\n1. 以後最想定居在哪裡（⤵️）\n1. 你之前大學在哪裡讀（得知學歷情況）→ 這樣是北漂或南漂，有沒有不適應的還是特別適應\n1. 現在最想吃哪間餐廳 / 我朋友下禮拜要來找我玩，你有沒有推薦哪裡（⤵️）\n1. 你有哪些好朋友，都是什麼時候認識的（⤵️）\n1. 從小到大最開心的回憶\n1. 如果能開一間店會想開什麼店\n1. 能接受對象去夜店嗎（⤵️）\n1. 你會希望對象交過幾任再遇到你\n\n### Final\n1. 有兄弟姐妹嗎，你們會吵架嗎（⤵️）\n1. 你有什麼地雷嗎\n1. 你有拜過月老嗎（⤵️）\n1. 擇偶理想型是什麼（⤵️）\n1. 如果現在有伴侶，最想跟對方一起做什麼事情\n1. 如果有機會跟一個人變成好朋友，那你有什麼事情會最想或最需要讓對方知道（⤵️）\n1. 如果有機會跟一個人變成情侶，那你有什麼事情會最想或最需要讓對方知道\n1. 你上次在別人面前哭是什麼時候？自己哭呢？\n1. 你可以接受獨旅嗎\n1. 如果可以跟你身邊一個人交換靈魂，你會選哪個人，身邊的朋友或名人都可以\n    1. 可以認識他\n    1. 可以認識他的朋友\n    1. 夠有趣\n1. 你覺得我們在一起會因為什麼而分開\n\n### Then?\n其實我覺得出去個 5 次左右，搭配日常在手機上的聊天，應該可以在 3 個月到半年將 Final session 結束，而認識 3~6 個月就是最佳的告白時間！！！\n\n相信我，你們這些交不到女朋友的男生一定要相信我，不要相信女生說什麼要認識很久才會決定要不要在一起。雖然這個時間不是一定絕對會成功的意思，但如果超過這個時間通常失敗的機率會直線提升，以及你的付出非常可能會遠遠不如收穫。\n\n超過 6 個月會慢慢的變成朋友，蛙化（不知道的自己 google）的可能性會上升很多，而且如果這段時間都沒有曖昧或者讓你覺得好像可以試試看的情況發生，那基本就是沒意思，不要浪費時間當驢子了。\n\n然後繼續關注「心碎小狗醫療包」系列，我絕對是你最知心的獸醫。",
    "date": "2024-07-23",
    "tags": [
      "廣寒宮",
      "2024 二十大精選文章",
      "心碎小狗醫療包"
    ],
    "isPinned": false,
    "textCount": 2670
  },
  {
    "id": "personality-in-social-media",
    "title": "社會課｜社群媒體的人格定義",
    "content": "大家有想過一個人是怎麼被定義的嗎",
    "markdown": "我記得小時候寫過一篇作文，就是寫認知中的自己是怎麼樣的，然後基本都是一些旁人給我的優點組合而成。那是一個很膚淺卻非常真實的自己，因為小時候還沒有三省吾身的能力。\n\n在社群媒體已經佔我們人生將近半數的現代社會，好像除了學會怎麼在現實世界塑造形象，也需要在網路上塑造形象。觀察大家的自介、分享、發文、留言、追蹤是五個我覺得最好切入的地方，通常這能夠看出一個人：\n\n1. 最引以為傲什麼\n1. 平常關注什麼，對什麼感興趣\n1. 現況與過去等現實資訊\n\n他是一個有錢人、他是一個好看的人、他是一個聰明的人、他是一個努力的人、他是一個厲害的人、他是一個激進的人、他是一個憂鬱的人、他是一個正能量的人、他是一個大忙人、他是一個怪人、他是一個對什麼東西感興趣的人。\n\n絕大部分人肯定會把最亮眼的一面放出來，顧慮別人看到之後會怎麼想，進而成為一個不立體的人。\n\n我們常常用各種 tag 從網路去認識一個人，我覺得這沒有什麼不好，畢竟我們面對面時其實也沒辦法知道對方腦子裡在想什麼，所以什麼謊言之類的東西不是理由。也就是現實的形象和網路的形象都有可能是假的，都需要我們努力的去判斷真偽。\n\n而社群媒體上不立體的形象很容易讓我們沒辦法用宏觀的思維去看一個人，沒辦法從各個角度去觀察這個人的行為跟想法。可能看見一個人在社群媒體的形象，就會覺得：阿他就是富二代啊、他就是機掰人啊、他就是花瓶啊、他就是小草啊、他就是憤青啊等等的。\n\n但反過來說只要他在網路上留下足夠多的足跡，我們甚至能比現實中更了解一個人。\n\n這也是為什麼 threads 是一個很可怕的社群媒體，我們光是去看一個人 repost/reply 什麼，就能很深入的去了解一個人真實的樣子是什麼。至少比平常看限動、貼文深入很多。\n\n這個道理就像是看足夠多我的 Substack、Podcast 就能了解我一樣，只是普通人不會像我一樣不要臉且不畏懼的把大部分真實的自己攤在陽光下。\n\n而面對面其實是一個強迫對方把注意力放在自己身上的行為，強迫對方從所有角度了解自己，包含說出來的話、聞起來的味道、看起來的樣子、氣場，各種物理上、心理上的感受。\n\n每個人可能都有不同的優勢，有的人只要在網路上就能充滿自信，因為結巴、緊張、外表之類的缺點不會被發現，甚至是因為不用為言論負責。\n\n有的人在網路上就沒辦法好好表達，因為不知道對方在螢幕後面的表情是什麼，顧慮對方有沒有好好專心。\n\n所以在社群媒體塑造形象、注重在網路上的足跡是否能被人探聽，就像我們出門前注意自己有沒有香香、頭有沒有油、口袋有沒有翻出來一樣重要。雖然話這樣講但我之前就是一個超級不在乎的人，現在好像也沒有多在乎但就是正在改進中。\n\n（我這幾天每天晚上 2、3 點都會發超長的文，過一陣子就刪掉移到 Substack，這就是我在改進的一個方式⋯）\n\n我對觀察大家十分感興趣，所以常常會把一個我可能都不認識的人研究個透徹，推斷他的一切言行想法，再在未來各種觀察論證跟檢討。\n\n這是網路世界帶給我的新樂趣，畢竟在現實世界裡觀察一個人是更容易的，畢竟大家都不是演員、也不太會說謊，各種微小動作在高敏人眼裡根本都表露無遺。",
    "date": "2024-07-18",
    "tags": [
      "社會課"
    ],
    "isPinned": false,
    "textCount": 1303
  },
  {
    "id": "p2p-thinking",
    "title": "社會課｜From Intern to Junior (II) — P2P Thinking",
    "content": "Product-Oriented & Profit-Oriented",
    "markdown": "\n### Intro\n本文著重在如何當一個 Junior 上，適合已經把前一篇文 [From Intern to Junior (I) — Learning Roadmap](https://medium.com/@ChiHaoLu/from-intern-to-junior-i-learning-roadmap-99f835a27070) 看完並且實踐的人。\n\n這篇文需要打預防針，由於我依然是個 Junior，所以所見所聞跟硬實力肯定跟 Senior 有所差距，但我想內容上應該不會有什麼錯誤，頂多是有缺少。未來如果有更多體悟我再來補充。\n\n在我眼裡 Junior 跟 Intern 從技術上是很難區分的，程式能力、背景知識多寡的界線很模糊，可能要會的東西都差不多，只是深度變更深，注意更多細節，這單純是經驗差距，沒什麼好特別說的。\n\n所以我提出兩點來從「根本上」區別 Junior 和 Intern 的思考 / 行為模式。\n\n一是 Product-Oriented，二是 Profit-Oriented。\n\n前者是做任何事、任何思考，都要從「整個產品」的角度來去發起，而不是眼下這個 program 能不能有效率地跑完而已。該思考的是，如果這樣寫其他同事對接上會不會遇到什麼問題，如果這樣設計用戶會不會哪裡不舒適，如果這樣做成本會不會太高。\n\n後者則是做任何事、任何思考，都要以「獲利」的角度結尾（出發也可以）。我之前的兩位 Mentor 此時此刻依然是我的指導者，並且在相似的 scope 上繼續指導我。但後續我會提到另外兩位我認為的 role model，而他們在第二點中給予我很大的啟發。\n\n### Product-Oriented\nMentor N 和 C 在這個時期給我的指點有所延伸，前者給予我的建議是，寫完調研文件和內部分享時，我應該學習多做以下幾件事情：\n\n一、這個競品與我們現行的產品相比有什麼優缺點\n\n二、公司如果串接這個工具或使用這個方法，會需要做什麼準備、成本是什麼，有什麼相應而生的優缺點和影響\n\n三、從公司或用戶的角度需要注意什麼\n\n四、公司或用戶可能有哪些疑惑，先提出來討論甚至解決\n\n後者則是更廣泛的從整個產品的各個層面切入，包含怎麼切資料層跟介面，或系統設計的相關議題，因為涉及很多專有名詞所以我就不繼續贅述，簡單來說就是不只是聚焦當前工作而已，而是要有更宏觀的系統了解。\n\n大家看完應該能夠了解我在說什麼，簡單來說過往的我就是個單一元件的 executor，我聚焦在可以把一個東西跑起來、串起來、調研清楚、講明白。但身為一個 Junior、身為一個員工，以上都只是基本，更重要的是所以當前這個新玩意怎麼樣對「整個產品」產生影響。\n\n產品代表著公司業務，公司業務意味著賺錢，而這是下一個章節的重點，也是我自認為銜接 Senior 時，除了技術以外的最佳切入點。\n\n### Profit-Oriented\n從我剛進到公司，我就已經發現 CW 老師在給予 review 時，永遠會提到當前討論的事物能夠對公司造成什麼獲利，或提出類似的問題。\n\n這其實是我過往很缺乏的部分，例如我很容易困擾一個技術上很屌但商業模型上很貧乏的產品該怎麼拿到錢。或說我根本就沒意識到一個產品的本質就是要賺錢，程式寫的再好都沒用。\n\n不知道大家這樣看會不會有一種「當然是賺錢最重要啊」的想法，但我們這種行業，經過學生時期各種硬實力的鍛鍊，最缺乏的就是 profit-oriented 的思考。CW 老師的這個行為模式，反倒是一瞬間點醒我原來掌握資源的人在乎什麼。\n\n我在做任何報告、事情時，都是用技術來出發跟結尾，每次的結語都是因為這個技術很安全、哪個特性很出色所以我推薦他。當然這些都很重要，但其實從任何老闆的角度這樣「說故事」的方式都是不夠好的。\n\n即便這個東西沒有直接獲利的功能，我們都應該在最後補一句：因為他的技術怎麼樣，所以可以獲得哪些特性，進而增加很多在乎這個的用戶和獲利。\n\n工作上老闆就是掌握資源的人，老闆想要什麼就是員工做任何事情的核心目標，而這個答案顯而易見就是獲利對吧。\n\n所以面試、報告、實作、討論的時候，我認為 Junior 勢必要盡力完備所有技術性的內容，但無論如何都要有一個以上的篇幅從獲利去切入。\n\n### Improvisation in Brussels\n其實想寫這個文章很久了，但一直沒有一個好的收尾方式來銜接未來，這次去 ETHCC 剛好給我蠻大的收穫，就藉著布魯塞爾到杜拜的七小時來完成這個長文。\n\n從實習到轉正到現在兩年的時間，我已經很久沒有那種突破天花板的感覺，基本上就是跟著過往已知的路徑前進而已。\n\n但這次去布魯塞爾跟著同事 Q 與人 connect 讓自己有很不一樣的視角去看整個業界和產品。我曾經很自豪自己是一個純粹的技術咖，但隨著出社會還有跟各種人相處，慢慢的我發現也許自己很需要這樣的視角去看世界。\n\n例如過往幾年我們都著重在各種技術上，誰的 protocol 最屌、誰的技術最難被超越、誰的安全性最高、誰的監管風險最低、誰的報價最漂亮、誰的 cost 最低、誰的程式最漂亮。\n\n所以我花了很多時間學習 ZK、AA、L2，但我這次來在各種場合與約 10 到 20 人 connect 時，都沒有人在談論這種技術內容（後來 CW 老師才說會討論這些的人是超小眾，我才發現他們都躲在小小會議室裡面算數學）。\n\n只有與 Nethermind 的 founder 促膝長談 20 分鐘讓我感受到如沐春風而已。其他的時間其實我有點 down，可能是我聽不懂、沒辦法切入，可能是他們的主軸跟我過往的認知不同。\n\n例如技術人員著重誰的錢包設計夠模組化、兼容最新升級、安全假設如何、benchmark 如何、有沒有防夾跟最佳報價。而 VC 在乎的是有多少 hotspot 被包進來了，如果串（或被串）這個服務能夠帶來多少用戶量，你的錢包現在有多少用戶、排名第幾，embedded 的 Defi 營收怎麼樣。\n\n該怎麼與這些掌握資源的人溝通是一個很重要的功課，因為從他們的眼裏這個世界和我們這些技術人員是完全不同的。當我們要說服對方串接我們的產品時該怎麼闡述，或者擔任被說服的那方時該怎麼應對。\n\n我能夠從對方躺在椅背上還是身軀靠前判斷現在他是感興趣與否，也能夠從翹腳跟抖腳判斷對方有沒有自信，也能夠在嘖聲跟抿嘴之中找到切入點。這些都是我的優勢，而下一個階段除了技術部分以外，我應該會往這裡學習更多東西。\n\n很多東西都是故事、很多東西都是未爆彈，這些身為技術人員都知道，在我們耳裡聽起來像是畫餅、話術的東西，為什麼他們依然可行和被選擇呢？\n\n當然我不是說 VC 和老闆很膚淺，而是商業和工程這兩個領域其實有一個地方很像，那就是常常要 trade-off。而身為技術人員常常只看見商業面拋棄了什麼，進而覺得對方好像在包裝、畫餅。\n\n不同角色看的東西本質上就不同，如果能夠兩者兼具肯定是有益無害。",
    "date": "2024-07-15",
    "tags": [
      "社會課",
      "2024 二十大精選文章",
      "你的最佳職涯導師"
    ],
    "isPinned": false,
    "textCount": 2873
  },
  {
    "id": "turn-around-ur-life",
    "title": "社會課｜如何扭轉人生低谷",
    "content": "擺脫過去的方法是回到及格線",
    "markdown": "\n有的時候我能感受得出來自己被囚禁在某個時間區段，不是一個 span 而已，而是好幾段。認識一個人足夠久之後，也能看得出來對方困在哪裡。造成的原因有很多種可能，有可能是遺憾、心結、恐懼，更有可能的是幸福的逝去，然後懷念過去進而沒辦法面對未來同樣的情況。\n\n感情、別離、挑戰都有可能是兌現的事件，例如過往總是在哪裡失敗，未來就會很害怕這樣的挑戰；或者是過往在哪裡總是表現得很好，但現在已經不行了，就會在未來很容易會想起那段日子。\n\n### 空缺的遺憾\n感情的例子應該更容易理解，有一些很愛但得不到或已經離去的人，再加上各種負面 buff 就會讓自己深陷在過往的桎梏裡。\n\n深陷在過去或許是人類擁有情感之後最大的弱點之一，只要那個人事物再次向你伸出橄欖枝，沒有太多人能夠冷靜思考。除非是像我這種冷血無情的混蛋，不然尤其是感情特別懾人。\n\n我自己覺得，當深陷在過去的時候，最好的方法就是懷緬過去直到厭煩為止。例如每天強迫自己寫一堆文字但「不要發出來給任何人看」，進而利用「作業感」抵銷那個囹圄。我還有數十種類似的方法，這裡就先不浪費篇幅了。\n\n走出任何過去的傷痛、避免任何陳舊不適合的人事物再次影響自己，都能夠利用這個道理來解決。或許不是萬靈丹但終究是一個療傷的好方法，提供給大家參考。\n\n### 了解對方的過去，可以判斷對方的未來\n對我來說，知道一個人被困在哪裏是一件很重要的事情，主要是我會很擔心觸碰到對方的禁區。另一個部分是所謂心結是影響潛意識思考的主要影響因素，所以只要我知道對方卡在哪裡，為什麼卡在那裡，就能夠摸清對方的思考模式和未來的反應。\n\n舉我自己當例子，我對意外非常恐懼，所以看得出來我被困在哪個時間段，這是若且唯若的關係：我害怕意外和有遺憾的分離，所以被困在那裡；我被困在那裡，所以害怕這些事情。\n\n因此能判斷出我會很保險又安全的做每件事，我會盡力避免留下遺憾，不想讓任何人失望或一直在心裡掛著缺憾。如果確認未來不會有任何的深入關係之後，就先把人隔離在生活圈外。以避免對一些人的遭遇產生共感和婉惜。\n\n雖然本來就是一個偏保守和會留後路的人，可以說如果沒有困在那裡，我不會是現在這個極度風險趨避的個性。\n\n就感情而言是一個更需要了解來龍去脈才能摸清的事，在上大學以前我對感情的態度和想法和上大學以後是完全不同的。主要的差異是純樸學生和小型社會（大學）的差別，以及南北差距，還有對自己和他人的錯誤認知。\n\n那時候的我有很多錯誤的選擇，有比現在更多的缺點（有些還是很致命的），比現在少太多優點還有成就，在不只是感情的地方也都沒有表現的很好。\n\n過程就不詳述了不然就被大家摸透了，總而言之我的適應力讓我在幾次試錯之後就馬上調適成正確的態度和做法。所以我沒有卡在那裡太久的時間，雖然過程會有很多負面的想法，但天時地利人和下就會改善，只要我知道現在我得解決這個問題，而不是無病呻吟。\n\n### 實作\n有時候意識到自己困在過去的哪一刻就已經完成第一步了，第二步是了解自己擁有什麼優勢和劣勢，第三步是從困在過去變成擺脫過去。最後一步才是去完成那些真正想完成的目標，例如開始一段新戀情、找到一個好工作。\n\n第三步的做法應該是我上了大學才改變的。我以前都覺得走出失戀的方法是找一個新對象，但實際上不是，應該要先認清問題在哪並且解決。\n\n也就是說假設現在考試成績是 39 分，目的應該是從死當變成 60 分，而不是眼睛乾巴巴的望著 100 分。\n\n所謂的擺脫過去、解決問題，讓人生重新起飛，是從入不敷出變成收支打平，而不是在繳著循環利息的時候就想著要領百萬年薪。",
    "date": "2024-07-08",
    "tags": [
      "社會課",
      "2024 二十大精選文章"
    ],
    "isPinned": false,
    "textCount": 1477
  },
  {
    "id": "lose-chance-by-avoiding",
    "title": "社會課｜不沾（二）社會性不沾所造成的劣幣驅逐良幣",
    "content": "不沾不代表得體，是拒絕交心",
    "markdown": "\n### 前言\n普通人的不沾與自我審查，會讓自己喪失機會；掌握資源的人不沾與自我審查，會讓其他需要幫助的人喪失機會。\n\n為了不要讓別人覺得受幫助的人有做任何搖尾巴的行為，擁有資源的人常常傾向不主動提供協助，不參與到任何爭議甚至根本沒爭議（純粹幫助）的事件。\n\n但這會塑造一種需要幫助的人以為有資源的人不願意幫助，有資源的人認為需要資源的人不需要幫助的情況，進而使資源流落到那些實際上不需要卻出一張嘴的人手上。\n\n接下來的文章我會好好描述以上這件事。\n\n\n### 抗壓力差\n這個社會彌漫著一種無法被評價的風氣，男生給女生意見就會被說是男性說教，以前我會覺得女生有病，後來發現真的有很多男生會說叫所以覺得男生有病，之後又覺得即便某些意見很有用女性還是無法接受。最後的結論是這跟性別無關，因為男生也會說女生都是咖啡。\n\n結論是：普通人都沒辦法正視建議這件事，尤其越有用的建議越會刺痛人。\n\n我認為個人問題最好的解決問題方法是 1-on-1  覆盤，而這過程不免會被人認為是在說教，也會直指人的痛處，讓人覺得給予建議的一方站在制高點、批評。畢竟哪有解決問題是不痛苦的呢？例如找不到對象之類這種問題，所以有能力的人就不太願意給予諮詢機會了，除非有收錢。\n\n> 畢竟根據過往的經驗只會讓人討厭而已，即便我是對的。\n\n之前我說過：「溝通是要解決問題，而社交是維持關係」。不沾導致我（們）都在社交，不解決問題，進而導致整體素質淪陷。\n\n如果我們這個群體沒有紀律、沒有原則、沒有目標、沒有扛壓，只有虛偽的社交還有無理由地「溫柔接住所有人」，那我們就沒有一起提升的可能，只會一起淪陷。這也是為什麼有能力以及熟稔社會遊戲規則的人只願意傳授給自己的小孩，而對他人不沾。因為你給予他人建議只會被討厭，這些社會規則就是現實，許多人不願意接受事實，你能做的只有對自己的小孩淺移默化。\n\n像我，聽見身邊的人風評不好的時候（發生在前幾個禮拜以及今天），我都會選擇不告訴這些人，因為在我眼裡他們通常是選擇不對，而不是努力不夠。\n\n> 而是參與錯誤的活動，遇到錯誤的夥伴，追隨錯誤的人，選擇錯誤的路\n\n但如果跟他們提起是因為選擇不對，而導致被評價成這個樣子，那好像又變成是我多管閒事、我的不對了。所以最後還是會選擇什麼都不說，這就是不沾成為社會化特徵，所對社會的其中一個負面影響。\n\n追根究底還是人們對於「建議」的承受度過低，即便那些建議根本稱不上是「批評」，但只要是提到你的不是，就一分一秒、一字一句都無法接受。\n\n\n### 我們無法拯救他人\n實際上給予他人建議就是正在把不適合這個區段的人拉上來這個區段，如果他們因為運氣好而踏足上來，而非靠自己的實力累積，那也會摔得很慘。\n\n當有人（或一個團體、組織）問你他有什麼地方需要改進的時候，除非彼此有非常緊密的關係（至親、股東），那不然給予建議一點幫助都沒有，只會讓自己蒙受更多的風險。\n\n例如人資問你公司有沒有哪裡可以改進的，甚至是年末績效問你對主管有沒有什麼建議，你會說嗎？實際上你不該說，因為說了對你「沒有任何」好處，因為你以為你在為公司貢獻、讓公司變更好，但你可以獲得什麼？其實公司也沒有那麼容易倒閉，賺多賺少跟你也根本沒關係，即便你提出的是一個系統性的風險，但別忘了針對公司的制度、主管、甚至老闆或老闆的狗提出建議，你要冒的風險更大。\n\n> 你連對對象、家人、摯友給予真正的建議他們都沒辦法接受了，你怎麼會覺得同事跟老闆會接受你苦口婆心但逆耳的忠言？\n\n例如你的戀愛腦朋友問你他男朋友好像刪聊天記錄怎麼辦也是一個很好的例子，我遇過太多次一直稱讚朋友的男朋友，結果他一直批評男朋友，最後我受不了一起批評叫他們分手比較好，這男生是垃圾。結果過沒幾天他們又復合了，變成最後小丑是我自己。\n\n我們要搞清楚的是對方到底有沒有想要獲得建議，99.9% 的人都不想獲得建議而只是想要被安慰跟發洩情緒，你或許會覺得亡羊補牢，但他們並不這麼想。因為我們沒辦法拯救任何人，會失敗的人、會遇到渣對象的人、會受傷的人永遠都會遇到不幸，而幸運的人永遠都會獲得幸福。\n\n我曾經想了很久，為什麼一個男生成天約砲、去夜店，然後交了女朋友信誓旦旦一定會回歸正途，這種話會有很多女生相信（性別反過來也是）。因為我們都對高水準的人事物有更高的標準，而一開始我們如果給予很低的評價，那只要有一丁點希望就會給予期待跟信任。\n\n就像弱勢會抱怨幫助他們的人手伸得不夠長，遊民會嫌棄便當沒有他愛吃的菜；就像你只要考過第一名，下次如果考第二名會比一開始就考不及格還慘。這世界上所有一直在不幸福的人，都有很合理的因果。\n\n我們本質上就不該對不值得的人、沒有價值的人伸出援手、抱有期待，這個是我們與上流社會的最後一道鴻溝，腐敗的人性是通往幸福路上最大的絆腳石。所以，為什麼有人會喝得爛醉躺在信義區路邊，為什麼有人會終日為愛情所苦，為什麼有的人走得坎坷，在我眼裡都有很明顯的原因存在，但別人的事情與我何干呢？\n\n我們真的可以拯救誰嗎？\n\n### 劣幣驅逐良幣\n那為什麼會有劣幣驅逐良幣呢，因為「聰明人害怕別人覺得他們是白癡，而白癡彷彿害怕別人不知道他們是白癡」。\n\n> 這也是為什麼 Threads 和狄卡會被說很多低能，因為他們的設計就是讓大家看見社交圈以外的人，所以我們會看見很多不認識的人，而這世界 90% 都是白癡，再搭配「白癡彷彿害怕別人不知道他們是白癡」，自然就會覺得這些社群媒體上面都是智障了。\n\n當掌握資源、擁有良知的人都開始社會性不沾，害怕自己正在說教、站在制高點、不懂的同理、批評他人，所以決定不要主動給予幫助。那獲得這些好處的就不會是那些需要幫助的人，需要幫助的人害怕別人說自己爛，所以不願意表達難處跟自己的弱點，就是我「[不沾（一）](https://chihaolu.github.io/publication/article/3d-person)」那集所講的。\n\n該怎麼做才能讓這個社會，或至少自己交友圈的群體能夠「共同提升」呢？\n\n首先，我們需要讓大家知道被救者是知恩圖報的，同時也要讓大家知道行善是不會有任何壞處的，這樣社會才會更好。因為被救者不知恩圖報會讓許多被救者不敢接受幫助，而拯救他人的人如果沒有感受到被救者的善意，只接受到那些說別人正在說教的人的惡意，那他們也不會願意給予幫助了。\n\n最後他們給予幫助的對象，就是那些表面上裝作很善意、沒有真材實料、只會出一張嘴的人。\n\n### 後記（一）：像我\n有時候看到別人針對一些明明就有對錯的事情說什麼「⋯這沒有對錯」，我都不認同，錯就是錯，有什麼好在那邊假中立、假暖心的呢。但我現在一個禮拜大概會說十次「這沒有對錯」、「大家過得開心就好」，有聽 podcast 的或跟我聊天的應該都有感覺到。\n\n雖然因為這樣對外關係和緩非常多，但我心裡認為這是大部分人的損失，因為自此之後他們身邊只剩下會給毒雞湯還有無限溫暖的人，不再有突破維度跟思想桎梏的途徑。不是每個人的夢想都是功成名就，不是每個人都值得達到目標。\n\n### 後記（二）：絕對不要幫助對你沒價值的人\n大家需要認清一件事情，絕對不要對跟你沒關係、沒有價值的人伸出援手。請重複一百次當作你人生的座右銘之一。\n\n那種去面試的時候幫助到公司老闆，結果自己因此飛升的劇情只有中國幹片才會有，現實世界的人只會抱怨你手伸得不夠長而已。你去送便當給路邊的遊民他們還會挑菜，你去救助路邊受傷的老人他們還會反咬是你肇事逃逸，現在這種情況真的太多了，沒必要讓自己深陷風險。\n\n有時候甚至是好朋友、至親，你去告訴他們這是詐騙、這個言行不好，他們還會說你多管閒事、擋人財路、斬人桃花。所以你該做的事情就是能當作沒看到就當作不知道，在他們需要心理慰藉的時候出現，在他們需要提醒的時候無視。因為你的提醒根本沒用，人只會在自己真正受到傷害才會學乖。",
    "date": "2024-06-01",
    "tags": [
      "社會課",
      "2024 二十大精選文章",
      "不沾"
    ],
    "isPinned": false,
    "textCount": 3209
  },
  {
    "id": "how-to-find",
    "title": "廣寒宮｜心碎小狗醫療包（一）找到好對象",
    "content": "心碎小狗如何找到一個適合且不錯的女生在一起",
    "markdown": "\n在開始之前我得說本文屬於強效藥，建議心碎小狗慎閱。因為要解決治病沒有不痛的大家知道吧，要不就是你的病根本微不足道，不然就是要花一堆錢做微創手術，但看來有些病患都不是，所以只能用強效藥了。\n\n### 前言\n有沒有交女朋友對大家來說很重要嗎，雖然我講這種話很像富二代問大家為什麼不買房收租要整天辛苦工作，但我總覺得在一起這種事情寧缺勿濫，對一個二十幾歲的人來說不是很急迫的事情。\n\n說難聽一點只要有錢就會有很廉價的花瓶出現了，但更難聽一點，到時候你也不敢收，因為你完全知道自己不是凱子，也不想當凱子，最他媽怕的就是有人騙自己錢了。\n\n我之前發的那篇「[配不上](https://chihaolu.github.io/publication/article/kol-girl-is-not-for-you)」就是在暗示一些人很多事情沒有想像中美好，說難聽點最差最差的情況很有可能落得「不是不想打炮，只是不想跟你打砲」的下場。但感覺大部分人沒理解我想說什麼，所以還是深陷在那個桎梏裡面。\n\n所以想繼續看下去的人最好還是先去把那篇文看完，不然就像抗生素沒有定時服用一樣，效果打折就算了還會有抗藥性。\n\n### 本系列文主題\n這個系列文我會主要切成四個主題探討，一 part 不一定是一篇文，我會盡量濃縮，但想說的話真的太多了。\n\n> 補充說明：本文主要針對男生追女生，女生追男生可以完全是另外一個系列，但還是可以參考一下，大家自行過濾不適用的資訊。\n\n簡單來說我覺得要找到一個適合且不錯的女生在一起，可以拆分成：\n\n1. 找到：要怎麼找到這種女生\n1. 適合：怎麼樣是適合，屬於主觀\n1. 不錯：怎麼樣是不錯，屬於客觀\n1. 在一起：怎麼能在一起，怎麼在一起久\n\n我覺得第四點是這四個部分裡面最簡單的（最簡單不代表簡單），但大家都以為它是最難的，原因就是大部分人都找一些根本不適合自己的人，或者是根本沒機會的人。也就是第四點做不好就算了，還違背了第一點跟第二點。\n\n### 小前提們：不錯的女生 & 想追朋友\n不錯的女生，或要用「最膚淺」概括地說，漂亮的女生，他們「絕對」知道自己長相的 level 在哪，因為他們的私訊跟愛心數量會告訴他們自己有多少人正在關注、覬覦自己。更不用說那些除了長相之外有其他優點的女生了，怎麼可能不知道自己根本是極品尤物。\n\n所以，先秤秤自己幾兩重，當然我不是說男生一定要比女生優秀什麼的，只是適不適合這件事情通常是一翻兩瞪眼的，那種同時有幾十個男生在追的女生就不要抱有太大的期待，你可以蹲著等，但不要獻殷勤、不要抱怨、不要汲汲營營，可以追但當作買樂透就好\n\n然後，如果女生朋友（或女生好朋友）避開了你，那就代表他發現你的意圖。\n\n（發現意圖這件事我歸類在第四點，這個我可以寫幾萬字剖析，但現在這個遠遠不是重點）\n\n要，你就他媽趕快腦衝不要留下遺憾，給自己一個從頭開始的理由。不要，你就趕快若無其事的轉移目標，無論是去多認識別的女生也好，還是找點興趣、正事去做都好，至少還可以當朋友，日久說不定還有渺茫的機會，只要你若無其事的夠真。\n\n> 為什麼要提到這兩個前提的原因是就像很多女生會不知道什麼叫做不錯的男生一樣，很多男生看到漂亮的女生就覺得是不錯的女生，被當工具人或者傷害之後還要怪人，實際上只是自己在一股腦地舔而已。\n\n### 找到好對象（一）：做好準備\n好，所以第一件事情，不要讓你的社交目的性太強烈，不要別人點開你的追蹤名單全部都是漂亮的花瓶，不要點開你的回覆都是說別人好厲害，不要點開你的限動都是在 social。\n\n不要因為看起來很缺女生而一直在 emo 的樣子，你不可以像隻心碎小狗，沒有任何一個女生會在「在一起之前」想要照顧一隻狗，都是「在一起之後」才會開始母愛爆發，到時你要當渣男沒人攔你。\n\n> 不準沈醉在過去失敗的感情，如果你覺得你很痛苦忘不了，就他媽每天寫三百字對他的思念然後「不要發出來給任何人知道」，就留給自己看，我保證你堅持不了一個禮拜就會覺得想到他很煩了。\n\n所以重點是你的生活要有「正軌」，你看起來要是一個有在努力做自己的事情的人，不一定是衝刺事業或課業，你必須擁有「自己的生活」，而且不是漫無目的、遊手好閒，搭配 emo 貼文的那種生活。如果喜歡攝影、喜歡音樂、喜歡喝酒，都很棒，但要把格調、水準、你的重點「營造」出來。\n\n這樣不僅會成為一個有趣的人，還可以讓人覺得你不會輕易地被感情影響。你的生活重心必須是你自己，是你感興趣、願意花時間、快樂的事情。\n\n如此一來即便真的有情緒因素影響（被拒絕、被冷落），你也可以避免遭受重擊，呈現一種不動如山的姿態。而不是女生沒有回追你、沒有回訊息、沒有接受邀約、不理你，你就要死不活的樣子。\n\n### 找到好對象（二）：正確的管道\n第二件事情，不要搭訕、不要想辦法從網路認識女生，那種成功事蹟只會在音樂祭出現，通常你的個人頁面也沒有有趣（說難聽點就是不夠帥）到女生會被你的表象吸引。所以你要想辦法「面對面」地遇見更多女生，因為當你們有機會用嘴巴對話而不是鍵盤跟照片，你跟高富帥比才有勝算。\n\n> 其實交友軟體就是一個很好的例子（但我沒玩過交友軟體，所以你可以當作我在放屁大談），你如果能夠約出來才有機會，不然用文字真的很難進一步，而且隔著螢幕的都是假的。你如果想要在一起，終究是跟對方面對面的時間才是真諦。\n\n至於怎麼面對面遇見更多女生就有很多方法，不管是參加各種活動、社團、組織、比賽、交友軟體約出來都可以。甚至你去 LinkedIn 找人 coffee chat，然後藉此認識 connection 朋友的朋友也行。\n\n如果你沒有任何方式可以認識，那通常你是一個超無趣的人，這跟你有沒有故事可以說是相輔相成的。如果你有很多興趣，就可以有更多管道，你就有很多故事，反之就沒有。遇見了如果沒有足夠有趣的話可以說，那也是徒勞無功。\n\n或反之，如果你過的繁忙、多采多姿卻始終找不到自己感興趣的人或適合的人，那就得想著改變身處的環境，只是這個不是說做到就能做到，所以如果像我說的在「第一步：做好準備」，那你就不會是心碎小狗、缺愛小狗。\n\n這樣你就會覺得好像沒交也沒差，當然不是叫大家都不要交，這篇文以及大家的目的絕對都是「交到」，但心態上要抱持著「寧缺勿濫」、「不交也沒差」的心態。\n\n### 找到好對象（三）：讓自己變有趣\n第三件事情，讓自己變有趣，或者是別人問你最近在幹嘛，你要有辦法說出一堆有趣的事情，可以無限延伸話題的事情。你要有把握兩個小時內能滔滔不絕有趣的話題，但當然不是要你自顧自地講，是避免冷場的用途而已。\n\n所以讓自己變有趣（找到更多興趣）有很多優點：\n1. 轉移注意力，讓你看起來不那麼缺\n1. 可以有很多話題能說\n1. 可以認識更多人\n\n缺點就是要花錢跟花時間，所以這也是一個很大的問題。一個男人在他最需要努力的年紀，又要同時培養興趣消耗那麼多成本，是一個很疲憊的事情。所以要不就是在這個年紀好好努力（如果家裡沒礦），然後年紀大一點在充實自己的興趣。不然就是辛苦一點，無他。\n\n這也是為什麼我一開始會說要去看「配不上」那篇文，因為裡面就是在說如果真的有機會跟很不錯的女生（或花瓶）進展，那如果沒時間陪他、不能幫他拍美美的照片、想不到不錯的地方去、沒有辦法讓他有面子、沒有錢買禮物給他，沒有提供其他價值又不夠有趣，而且也不是高富帥，那憑什麼跟他在一起？\n\n所以要「找到適合的人」非常重要，同時「了解自身資源、優缺點」也非常重要，因為最差勁的例子：即便你跟一個花瓶（不適合的人）在一起了，你也沒時間（沒資源）陪他，沒辦法給他他想要的（沒資源），而且還會因為他跟其他男生有密切來往而沒安全感（優缺點），進而導致吵架。有人可能會想說那至少有爽到，沒，誰說他會讓你爽的，做夢吧。\n\n我自己覺得交了一個對象之後不適合而被迫分開實際上是比單身難受許多的，尤其是雙方都不願意放手但都知道沒辦法繼續的時候，或者是有一方明顯貌合神離但另外一方不願意接受事實之類的。\n\n實際上很多東西都可以提前預防，可以在在一起前就「明確知道」會有這些問題產生。所以我才會放在第一點講。\n\n> 不過所謂預防也只是理性推斷，沒辦法 100% 解決之後的問題，但如果連理性預防都做不到，那想處理「感性的問題」堪稱天方夜譚了。\n",
    "date": "2024-05-12",
    "tags": [
      "廣寒宮",
      "2024 二十大精選文章",
      "心碎小狗醫療包"
    ],
    "isPinned": false,
    "textCount": 3397
  },
  {
    "id": "3d-person",
    "title": "社會課｜不沾（一）立體的人",
    "content": "不沾不代表得體，是拒絕交心",
    "markdown": "\n這個系列文是我從一個說話直接、很會抱怨、提出問題的人，變成不太表達意見，盡量韜光養晦、大隱隱於市的心路歷程，我覺得大部分人可能看不太懂，但我還是希望把這系列文看完之後，大家能夠有一些收穫。\n\n### 大學同學的不沾\n這個是我在讀台大時候的觀察，蠻多同學是把不沾、不表達這些特點表現得相對好的，也就是基本不會在限動或公開場合抱怨、表達負面情緒、不好的事情，也就只面向大眾呈現光鮮亮麗的一面。\n\n這也是大家看太多社群媒體會導致焦慮、覺得別人好像都很厲害的原因，因為大家都只報喜不報憂，畢竟反過來說一個一直抱怨、很多負能量的人大家也不喜歡看。\n\n但對我來說「不在意他人無謂的眼光」是一個活在現代最重要的事情，當然不是要每個人都直接了當的說別人壞話或表達不滿，或者是把所有隱私的公諸於世。但我想說的是該表達的、該說的就說出來其實是沒關係的，有的人他一輩子都不會再跟你有交集，有的人他的想法根本就不重要。\n\n擁有被討厭、被評論的勇氣，才是過得幸福快樂的關鍵。\n\n### 融入群體\n> 如果別人問不沾的人對人事物的看法，他們通常不會提供任何主觀想法。\n\n在一群厲害而且心態極度開放的群體中，如果始終抱著不能批評別人、不能評價別人的心態在說話跟應對，那就沒辦法進入核心。因為他們都在坦誠相見，而他們身邊最不需要的就是不需要戴著面具的話術大師。\n\n> 這種只會穿西裝唸  PPT 的蒼蠅真的太多了。\n\n所以具備著思辨跟評論的能力很重要，也許不能對每個人或在大部分場合講出來，但面對那些最厲害的人時根本藏不住，同時這也是自己在夜深人靜的時候進步的關鍵，夢想的動力無法當飯吃，競爭才可以。\n\n「完全」不批評、不評論，這種不沾的個性注定一個人沒辦法成為厲害的人。\n\n所以該做的事情是表達但不得罪，就像你必須用秘密跟人交換才有辦法成為好朋友一樣，自己必須累積些無傷大雅的秘密準備與有用之人交換。\n\n### 表裏不一 & 吝於稱讚\n然而以上的不評論和不沾卻容易被引申成「過度謙虛」還有「在背地裡說人壞話」。大家都很會在社群媒體跟表面上說別人很厲害，說自己很爛，然後私底下一直說別人沒料、很爛，這是非常本末倒置的事情。\n\n第一是，給機會的人看到你這麼廉價地稱讚別人，然後說自己爛，就根本不會給你機會。這是一個非常合理的理由，試想自己是那個給予別人機會的人，無論是老闆、主管、感情市場的女生，你會想要拯救一個每天 emo 的心碎小狗，還是一個有自信、有能力，非常具有潛力但還沒有獲得適當機會的人呢？\n\n第二是，私底下說別人爛不是一個好事。因為私底下說的壞話雖然能夠讓人交心，但你得知道目前這個背地裡討論為的是什麼，sometimes 大家都不是為了交心而適當地提供秘密交換或背地評論，而是「真的想說壞話」。\n\n所以要當一個立體的人，應該是要說自己哪裡好，你要讓任何人知道你哪裡棒，而不是一直去稱讚一些根本連你都覺得超爛的人，讓別人覺得你的稱讚很廉價。\n\n那如果你對誰覺得不滿意，你可以不批評他也可以為了利益奉承他，但就要形於色，你要把你的底線跟原則拿出來，成為一個立體但不得罪人的人。\n\n### 裝弱、不說謊、不表態\n> 用很多感情的例子舉例，但只是舉例，因為感情的例子很好懂，不代表我都是用這招。\n\n我這個人是能蹲得很低的，為了一份工作、一個女生、一個機會，真的能趴在地上讓所有人覺得我很無害以及透明，但在最後一刻才跳起來。在工作上也是，從上台北以來我就習得了這個能力，那就是即便別人對你多有戒心，最後都會放下戒心。\n\n最重要的一個基礎其實不是說謊，而是不表態。我認為說謊是一個風險很大的事情，大家都知道一個謊言可能是沒有縫補盡頭的，但不可否認這是極度重要且實用的能力。\n\n不表態會顯得弱勢，會顯得透明，而說謊某種程度上也是站邊的一種，即便你點到頂，依舊會顯示出你當下的狀態是什麼，而不是像量子一樣進入疊加態。例如女生問你有沒有喜歡的人，你不應該說沒有，而是應該說還不確定這是不是喜歡。\n\n這個例子我點出來不知道大家有沒有一種醍醐灌頂的感覺，體悟到不沾與說謊這兩個層次的差異。\n\n裝弱有點像是不沾的簡易版，那就是你不可以讓你的上司或前輩發現你野心勃勃，但又不可以真的捅婁子或讓人覺得你是廢物，這個平衡點是一個門檻，抓準了、過了，那後面就能穩穩的培養這個能力。\n\n裝弱學完之後，我們可以試著展開這個不表態，或說是疊加態的真實意涵是什麼，實際上就是：能不做決定的就不要做決定。\n\n如果你是被問的人、被要求做選擇的人、被要求表態的人，實際上你就是掌握主動權的人，因為你接下來的回答會很大幅度的決定後續走向，無論是決策走向、觀感走向、感情關係走向，還是很基本的話題走向。\n\n我們要儘量把做決定的時間往後拖，甚至拖到對方不得不放棄要求你做決定，無可奈何的在你身上留下永恆的注意力（他下次還是想再問你一次這個問題），同時也是給我們自己留後路。\n\n因為你有時候真的沒有做好準備，對周遭環境跟武器庫有多少子彈真的不清楚，那這時候冒然回答肯定是高機率被殺頭，那不如就以拖待變。\n\n不過這招也沒辦法用很多次，畢竟人的耐心是有限的，你的理由也是有限的，如果永遠都說你還不確定，而沒有在其中拉扯、洩漏一丁點資訊，那肯定是會走向被放棄的結局\n\n所以最好的方法是一邊給予希望，一邊給予資訊，最後在確認萬無一失時，才全盤供出。這邊的萬無一失指的是你有辦法讓下次「以拖待變」的情況準確發生。\n\n例如你這次說「你還不確定有沒有喜歡的女生」，下次以拖待變到情況可以是，你已經有辦法把話題引導到「你還不確定對方喜不喜歡你」。\n\n### 結語\n我上個章節提到的裝弱、不表態與一開始所說的不表態有一點不同，因為一開始說的不表態所呈現的是拒絕交心，而上個章節的不表態則是在危險話題上逃避回答，也可以說是裝傻吧。\n\n該交心的時候就要交心，該裝傻就裝傻，這就是八面玲瓏，目的就是為了趨吉避凶，因為可能有一半的人不在乎你的野心，但有一半的壞人不喜歡你的企圖心。所以為了不要讓主管跟前輩注意到你可能會影響他們的野心，就要隱藏企圖心。\n\n換個角度想，當我們自己看到後輩強勢來襲時，一定也會感到恐懼或有更多負面情緒，這樣去想你就會知道韜光養晦有多重要了。\n\n但如果你的後輩又是一個死不沾鍋，只會一直從你這邊套秘密、八卦，然後什麼價值跟訊息都不願意提供，那你一定也不會把它當作隊友對吧！",
    "date": "2024-05-12",
    "tags": [
      "社會課",
      "2024 二十大精選文章",
      "不沾"
    ],
    "isPinned": false,
    "textCount": 2601
  },
  {
    "id": "anxiety-note",
    "title": "兔子窩｜焦慮隨筆",
    "content": "說說買房焦慮，以及其他可以被解決的焦慮，或說不該是焦慮的焦慮",
    "markdown": "\n### 前言\n從 3 月底開始，我就養成習慣每月發薪水才計算自己的總資產有多少，而不是跟之前一樣每天都打開試算表東加西減。這讓我多了幾天正常睡眠，不然過往真的會把自己搞得很躁 / 亢奮 / 焦慮。\n\n總覺得自己很會花錢，實際上我卻是自己認識的人裡面最不會亂花錢的人，很確認花的大部分錢都花在刀口上或有意義，物慾也非常低。\n\n所以這個感覺是假的，真的事情是我太在乎買房子這件事。每個月的結餘看下來就覺得自己很會花錢，但我並沒有，也很少出去玩，所以真正要說是自己賺不夠多，嗎？\n\n完全不，任誰都不會這樣想。所以目標、收支都沒問題，問題就是出在心態上。\n\n### 誰該開始想買房\n大家可能還是二十幾歲的人或家裡有礦，就不會一出社會就把買房當成目標，大部分人都是三十好幾了，或步入婚姻好一陣子之後，甚至繼承一筆可觀的錢，才開始考慮要買房，進而決定要開始存錢。\n\n更不用說也不一定每個人都要在台北留根，很多人也許一輩子就待在新竹了，或別的縣市，甚至最後養老打算要回家鄉也很有可能。所以等到很確定再考慮買房完全是正確的選擇，沒有目的性地太早買沒什麼意義。\n\n像我就是還沒上大學就決定這輩子要賴在台北不走的人，然而對我這種人來說，一個人的人生不是只有五子登科，或許是很重要的先備知識。\n\n或更精準一點的說，不用那麼著急擔心房價會漲到無遠弗屆的地步。我理解這二十年薪水漲幅遠遠不及房價漲幅，但大部分人真正有辦法買房子無非都是夫妻兩人一起，或靠繼承遺產、投資。\n\n這樣想就沒有太困難，爸媽也有房子、遺產，總有一天那會是自己的。所以理論上現在不需要擔心房子的問題，因為自己永遠都有地方可以住。\n\n所以大家不需要給自己要「一個人」、「年紀輕輕」就買房，這種很大的壓力。\n\n### 情況沒有那麼糟\n當然這兩個 tag 是完美無缺的，只是有時候壓力、薪水會讓自己很不開心，覺得工作就只是為了買那遙不可及的房，還有跟身邊的人比較之後的失望。\n\n不開心的，不是看到富二代同事有家裡每年贈與兩百萬，也不是看到有人用後門亦或者真實力去國外讀書拿到超讚的 offer，當然也不是看到誰出去玩。\n\n不開心的實際上都是自己的目標帶給自己的期望落差，也就間接以為賺不夠、花太多、比不上別人。然而這些都不重要，重要的是沒必要那麼急著達到目標，一切都沒有那麼糟糕。\n\n我們都是幸運的人，沒有學貸、家人不會要孝親費、不用我們貼補家用或緊急支出、爸媽自己有存足夠的養老金、不用擔心下一餐在哪或下個月住哪，光是這些就已經贏過社會上 70% 的人了。\n\n當然我們在台北就會母體差異，覺得每個人不是家裡有礦就是優秀過了頭，放眼回去看大家的「每個」國中小、高中同學，也許大家會理解我在說什麼。\n\n### 知足常樂\n真的很難，但面對社會好像只能這樣。\n\n遇到一個問題時，冷靜的思考短期會不會造成困擾，長期會不會造成風險。\n\n買房子就是一個短期沒困擾、長期沒風險的問題。雖然租房有他的缺點，但相比人生會遇到的其他問題，例如友情、愛情、親情、職涯、生育，住的需求都是一個有明確解決方法的問題，可以說不足為慮。\n\n所以不知道大家有沒有這種焦慮，或許是社群媒體跟新聞，還有一堆快訊息帶來的後遺症，如果大家跟我一樣的話也許能夠放緩焦慮，能儲蓄就存、該出去玩就出去玩。\n\n現在這個年代不是認真工作就能買房的年代，所以比起買房人生有更多問題應該好好被看待，包含我剛剛提到的那些。像我剛出社會到前兩個月就是過度在乎買房，所以總是汲汲營營想要東湊西補，但冷靜下來之後就能夠釐清思緒還有清算我有的一切資本。\n\n不是爸媽跟我戶頭有多少錢，而是像我上文說的那些，實際上我們擁有的非常多，此時此刻買不買房根本不是一個重要的問題，不該被其他同儕和媒體影響。\n\n目前看起來有問題的就只有下班不知道要幹嘛而已，畢竟過往「幾乎所有」時間我都是放在職涯上（各種充實自己），而現在心力跟體力都不容許我這麼做，所以我花了好一段時間才摸索出現在這個稍微舒適且富有目標性的模式。\n\n現在自由運用時間就是好好練琴，只差買台相機跟好好運動而已。\n\n話說，職涯對大家來說或許才是一個值得思考的問題，但那下次再說。\n\n### 其他可以被解決的焦慮，或說不該是焦慮的焦慮\n講了那麼多，其實我要說的不是告訴大家不用著急買房，而是人生有那麼多讓人焦慮的事情，實際上冷靜下來「有步驟地」思考這個焦慮能夠解決「大部分」問題。\n\n例如研究所能不能順利畢業、工作能不能如願找到、能不能再遇到一個跟以前一樣好的對象等等的，就跟食衣住行的生理需求類似。\n\n在把過度長遠的預想拋開，只著重在當下想要什麼，不疾不徐、不比較且不受社群媒體影響地做，以及確保不會造成未來的風險，那就沒什麼大問題，也比較可以放寬心。\n\n只著重在的自己給自己的期許，而不是符合社會期待跟比較的話，就不會那麼容易感到不開心。尤其是大家應該每天稱讚自己十次，就像大家認識最會稱讚自己的我一樣，抱怨別人、稱讚自己，越驕傲、越不要臉的人活得越快樂。\n\n如果熟悉這套流程的話，大部分的焦慮都能在這套規則下化解，尤其是跟世俗相關的。\n\n我也完全了解總有一些焦慮沒辦法如此理性地解決，然而我不是聖人，所以我無 fuck 說。",
    "date": "2024-05-06",
    "tags": [
      "兔子窩"
    ],
    "isPinned": false,
    "textCount": 2127
  },
  {
    "id": "202610-osaka-kyoto-kobe",
    "title": "兔美旅行團｜202310 京阪神",
    "content": "史上最棒的旅行，目前沒有之一",
    "markdown": "\n廢話不多說，自己看[行程](https://docs.google.com/spreadsheets/d/1YFyZzYGC34nA0RiVYIemR0JiJ1H23dHaXIjqKQ3ARUc/edit?usp=sharing)\n\n關於運琴回國、Jam Session Bar 以及樂器行可見[此份清單](https://docs.google.com/spreadsheets/d/1Ioisi7GXBiok8wO4jGBc2NWKBWgTAmHzRJojx7E-u9Q/edit?usp=sharing)。\n",
    "date": "2024-04-20",
    "tags": [
      "兔美旅行團"
    ],
    "isPinned": false,
    "textCount": 258
  },
  {
    "id": "222",
    "title": "兔子窩｜不被業界淘汰的 222 原則",
    "content": "為了不要讓自己變成二貨",
    "markdown": "\n之前曾經有發過一篇文說怎麼安排畢業之後的時程，目前看來除了運動之外都有做到（目前正在思考一個很好的方法運動，這個我們之後再說）。\n\n現在我想要把制式化的時間規劃改變成年度 KPI，以此提升我的時間彈性。現在的規劃是每一年：\n\n- 給予兩場技術演講\n- 發表兩篇技術文章\n- 參與兩場國際 conference\n- 籌辦兩個社群活動\n- 貢獻兩個開源專案\n- 參加兩場 hackathon或具規模的 side project\n- 閲讀兩本軟體工程相關書籍、或學習兩項新技術/新程式語言\n\n這個標準是我給自己不被業界淘汰的年度 KPI，不僅僅是不被淘汰，更可以說是保持在業界高點的一種方式。\n\n「學如逆水行舟，不進則退」，實際上單靠在工作崗位上的學習就能夠有很大幅度的進步，但如果想一直保持在業界高處，那往上爬、提升技術力、擴增影響力，這三個重點就是最佳途徑？\n\n在正職以前我的文章、演講、project 數量是遠高於這個規劃的，但我認為就職以後我們都該學會照顧自己的身心靈，以及學會怎麼好好生活，而不是當一個工作狂。雖然跟其他人相比這個規劃並不是「非常積極」，屬於普通人的水平，但 work-life balance 真的很重要，尤其是身心靈如果受損或 burn out 就很麻煩了。\n\n但我們又不得不站在浪尖，以在這個產品迅速迭代的業界生存，所以才有以上這個貌似最低限度實則上是頗為高壓的基本需求列表。\n\n### 關於 Project\n參與開源專案、做各種形式的 project 是很好理解的，一方面是做出「成果」，一方面是強迫自己接觸與工作無關的其他領域，同時還可以刷刷空投或領獎金，總而言之就是萬無一失的做法。\n\n撰寫文章就很普通，基本上就是有得發表就發，沒有想寫的就算了。\n\n最主要的是給予技術演講還有參與國際 confu，一方面是培養演講能力、英文能力，另一方面是我真的是一個很愛默默努力不愛出去外面顯擺的人（真的啦）。\n\n以變成我很常一個人參加比賽、專案，或者是在家寫了一堆文章發表，但實際上還是沒人認識我是誰、沒見過我，連公司裡面大部分人也對我只聞其名、不見其身。為了讓這個規劃能讓我多去認識很多人，提升更多知名度，還加入了籌辦社群活動這個選項。",
    "date": "2024-04-04",
    "tags": [
      "兔子窩"
    ],
    "isPinned": false,
    "textCount": 930
  },
  {
    "id": "kol-girl-is-not-for-you",
    "title": "廣寒宮｜配不上",
    "content": "這篇寫給想跟超高階精靈的男哥布林看的，女生不要點",
    "markdown": "\n### 前言\n\n前陣子因為滑 threads 所以跨出了同溫層，看到許多男生認為漂亮的女生很難追，或者是抱怨他們都跟富二代、渣男在一起。這邊我還是發一篇文講講這個，貌似顯著但實際上不該如此解讀的事情。\n\n過往我也是從流氓學校，到男校、理工科這樣的路徑長大，所以我十分清楚「普男」對漂亮女生那種又愛又恨的既複雜又單純的情感，我真的完完全全理解。\n\n### 從這裡切入：漂亮女生最喜歡拍照\n\n那第一句，也是唯一一句，你必須要了解的關於漂亮女生的事情就是你得知道：\n\n漂亮的女生絕對知道自己漂亮，沒有一個漂亮的女生會不知道自己漂亮。\n\n所以呢，「大部分」漂亮女生希望自己可以在美美的地方拍照，希望自己的樣子被好好記錄下來，希望可以去有趣、普通人不常去的地方拍照。不光是化完妝、試穿完衣服要狂拍，上完廁所也要拍，反正就是超愛拍。\n\n這時候容我先把漂亮女生分為兩類，一類是大部分時間都在玩的漂亮女生，一部分是大部分時間都在努力的漂亮女生。這個分類我覺得很合理，因為不管你是男女老少，都有一部分人永遠都在玩，而另一部分都在努力。\n\n### 哥布林並不夠格\n如果你要跟基本上過的豐富多姿，且漂亮的女生在一起，而他根本不看重你多上進跟努力，你「通常」得是一個有趣、豐富、願意花大量時間、花大量心力、花大量金錢的人。\n\n> 這邊補充一下，即便你是紈褲子弟或垃圾渣男，只要你被愛上了，對方都會把什麼孝順、上進、有自己想法之類的各種你根本沒有的 buff 加到你身上，這就是戀愛的力量。所以重點根本不是你多好，而是你要被愛上\n\n也就是說我們不能用這類漂亮女生全都怎麼樣怎麼樣，來以偏概全的覺得他們都跟富二代、渣男在一起。而是得反過來從大部分他們的需求來看，你是否滿足他們的潛意識需求？\n\n如果是你，你願意放下 LOL 跟手遊陪他們去美美的地方拍照嗎？你有錢有閒出國度假嗎？你有時間跟心力找好看的咖啡廳、夜景、餐廳、景點嗎？你有什麼美食或甜點 list 嗎？你拍照的技術好嗎？你有車嗎？\n\n實際上你什麼都做不到，因為你連課業跟工作都忙不過來了，打一場 LOL 都是奢求，怎麼有空去那種鬼地方浪費時間，只為了拍幾張照片。\n\n結論是在你有錢有閒有足夠的眼界享受生活之前，你根本配不上這種漂亮又過的精彩的女生。與其抱怨他們都不跟你在一起，倒不如想想為什麼他們要跟你在一起，先不論長相，你沒有空、沒有心、沒有錢、不有趣，基本上你根本不符合人家的需求。\n\n青菜蘿蔔各有所好，我並不會說所有漂亮女生都只追求拍漂亮照片，但沒有一個女生不想這麼做。只要對掌握這點，站在你有所求的人的角度去思考問題，你才有辦法所有你想得到的人事物。\n\n> 延伸閱讀：[社會課 #31｜站在你有所求的人的角度看問題](https://chihaolu.github.io/publication/article/point-of-view)\n\n### 那如果是漂亮又上進（或沒那麼愛拍照）的女生呢\n你以為漂亮的花瓶追不到，那漂亮又上進的女生會看見你的好嗎。\n\n實際上不會，首先你得挖到一個不是那麼那麼在乎要常常去各種有點門檻地方拍美照的漂亮女生，再者是他們通常擁有足夠的實力或經濟能力，你沒有辦法用既有的大男人主義吸引他們。\n\n之後呢，你所說的、所持的都有可能被他們反駁甚至輕視，那除非你有足夠吸引他們的超級優點，不然這種用錢、用長相、用時間也無法打發的女生，才是地獄級的 Boss。\n\n因為你能做到最簡單、毫無門檻的事情就是學會怎麼幫女生、陪女生拍漂亮的照片，而如果連拍照都興致缺缺（或沒那麼積極）的女生，那你這個人的內涵、能力，以及其他各個點是否能吸引他們呢？\n\n### 再次轉換視角：發揮你的優勢\n所以回歸根本，實際上我們不應該拘泥在漂亮女生、優秀女生之類的稍微膚淺的標籤，或說這些你非常弱勢的標籤。\n\n你應該發揮你的優勢（或說你到底是怎麼樣的人？），找一個跟你有一樣興趣和經濟水平的女生，因為有共通話題，有共同的目標，有同樣的頻率，那是橫跨一切不平等鴻溝的唯一途徑。\n\n> 無關金錢、無關長相，看對眼了、聊對頻了，什麼問題都不是問題。\n\n所以你應該充實自己、增廣見聞，多出去認識不同的人、嘗試不同的事物，累積更多能侃侃而來的話題，培養有趣的背景跟人格，才能得到更多的機會",
    "date": "2024-03-31",
    "tags": [
      "廣寒宮"
    ],
    "isPinned": false,
    "textCount": 1760
  },
  {
    "id": "all-in-for-housing",
    "title": "社會課｜要不要 All In 存款買房",
    "content": "三件事：房子不一定是資產，小換大不一定划算，夢想也很重要",
    "markdown": "\n### 背房貸的風險有哪些\n在開始這個主題之前，大家必須知道買了房子、貸了款，不代表你的人生就會一凡風順。所以一個人必須評估將要承擔的風險，還有自己能不能扛過去。以下內容並不是要大家做好 100% 的保證再買房（不然就不用貸款了，直接付現就好），而是要好好想清楚再做決定。\n\n潛在風險：\n\n1. 工作風險，無論是裁員還是公司倒了，甚至跳槽失敗都是可能發生的\n1. 你、你爸媽、你伴侶、你家的貓狗都會生病，不管是大小病都要花錢\n1. 房子如果出問題要修繕、家具壞了就得要換\n1. 結婚、生小孩要花錢\n1. 升息的話每個月可能需要多繳個一兩千甚至五六千\n\n解決方法不是不買房子（某種程度上算是啦），而是「有充足、合理」的準備金。而多少準備金是合理的，對我這種極度風險趨避的人來說，我的計算公式是這樣：\n\n```\nP = (L + X) * 6 + 15\n```\n\n> P 為總準備金，L 為每月貸款，X 為「維持當今生活品質」的每月支出\n\n舉例來說我買了一間 2000 多萬的房子，每個月貸款本息總共 7.5 萬，每月活的舒服的支出是 2.5 萬，那準備金就是 75 萬。\n\n為什麼會抓六個月是我保證我六個月內可以找到工作，如果真的發現大事不妙或者我真的短期之內無法工作，那六個月也可以保證我能用一個合理的價格把房子賣掉。而 15 萬只是一個基本的緩衝需求，就是 15 萬能夠支付一些小而不大、大而不小的花費，不影響我的生活又能盡可能解決問題。例如去進修。\n\n當然每個人對風險的定義不同，這只是我一家之言，大家可以自己設計自己的準備金公式。\n\n### 房子真的是資產嗎？\n不是，如果你是自住，他就不是資產，而是負債。很有可能他更不是一個投資，因為你開了五倍槓桿可能只是為了追上房價，而不是為了賺房價差距。\n\n所謂的資產是可以幫你創造正向現金流的東西，負債就是不斷從你身上拿錢的東西。你買了房子，房子可以租給別人或者會漲沒錯，但你也要租給別人或是把房子賣掉，這些所謂能賺錢的事情，才會真的把錢放進你戶頭裡面。\n\n如果你沒有賣掉房子，你的房子維護需要成本，租給別人也要成本（心理壓力、時間都是成本）。那你就是不斷再給銀行這個房東利息錢，而他就是負債。\n\n那當然反過來說你預期十年後或二十年後他可以漲到一個程度，你能夠用「差價」把「機會成本 + 利息錢 + 修繕成本」都賺回來，那他就是一個很好的投資。但這時候有兩個問題你必須要考慮，而這是普通人絕對不會考慮到的：\n\n1. 你未來賣掉房子之後，要買哪種房子？更大的、學區更好的、更市中心的、更新的房子，你買得起嗎？\n1. 考量到機會成本的話，或許不只是把這筆錢拿去放在股市那麼簡單，你的夢想也是一個機會成本\n\n### 你為什麼要買房子？\n不管你要做什麼決定，你都必須知道你的目的是什麼，而不是單純大家說買房好或爛就跟著做一樣的選擇。\n\n一個人買房子有幾種可能，自住、投資之類的，像是我就是為了想要對家裡敲敲打打、裝潢出我自己的隔音工作室，而這在租屋的環境下很難實現。\n\n不管你的目標是什麼，只要確認了目標，能做哪些選擇就是顯而易見的。但如果你不知道目標是什麼，那就會覺得什麼選擇都不對。\n\n### 夢想也很重要，你必須為自己而活\n出國讀書、開店，這些某種程度上是投資自己的行為，非常重要。因為開始繳房貸之後要存到這筆錢已經不容易了，如果你決定要背三十年，或者是早就打算轉手，背十年就要賣了，你的夢想就會延後到那麼久以後才實現。\n\n像是我想要開酒吧，到底是二十幾歲可以失敗的時候開一間可能可以幫我賺大錢的酒吧比較好，還是等我五十幾歲的時候再開呢？\n\n> 結果小孩準備出國讀書又要拿走幾百萬，我一樣不能開\n\n如果我失敗了這幾百萬放水流，至少我還年輕，還有拼搏的資本，如果成功了，那我離買房又更近一步。撇除家裡有礦的情況，年經就是試錯的最大本錢，當然這句話不代表我可以隨便做選擇，但就是終究要做這個選擇的話，年輕肯定是更適合的。\n\n退一步來說，三十歲才出國留學，是一個好時機嗎？三十歲才開始學琴，是一個好時機嗎？更不用說如果真的邊背房貸邊存到實現夢想的資本了，你敢 All in 存款嗎？\n\n因為這時候你可能已經有家庭要照顧了，也有可能爸媽生病需要你更多精力去關注。在支付高額房貸以及承擔升息風險的情況下，會導致你下一次有機會追逐夢想很有可能就是三十甚至四十年後了。這中間要存到錢並有勇氣投入開啟副業，真的是沒那麼簡單。\n\n不過這道理就跟背著房貸生小孩一樣，沒有不可能但是需要評估各種風險的，最終的結果都是犧牲龐大的生活品質。\n\n### 小換大沒那麼容易：你一輩子可以買幾間房？\n普通房子在漲，大房子也在漲，預售漲更快，小換大我認為不切實際，因為普通人的薪水正常來說不可能跟得上大房子的漲幅，現金流不夠就算了還可能越換越郊區。所以除非你投資有卓越的表現，或者是有繼承到一筆錢，不然基本上很難小換大。\n\n最好的情況還是一次買到中然後換大，或者是先買小，然後等繼承拿到錢再換中甚至大，再不然就是買兩個小。不管怎麼樣都不可能是小換大，因為碰到豪宅線就開始漲不動了，但小房子距離豪宅線實在是太遙遠了，根本原因還是現金流還有每個月的還款能量不足。\n\n所以如果你一輩子可能只能買一間房，或者是只有換一次房（往上換）的機會，那貿然下這次決定不會是一個好選擇。因為就像我說的，你需要能夠用「差價」把「機會成本 + 利息錢 + 修繕成本」都賺回來。\n\n### 台灣已經不存在「爆跌」了再買這種事情\n幾個重點：\n\n1. 已經漲上去的地方，跌是不可能跌的，只有可能緩漲或緩跌\n1. 不可能漲上去的地方，永遠不可能漲（或等到他漲你已經老了）\n1. 完全不考慮戰爭風險，因為戰爭來了沒有綠卡，你也根本跑不掉\n\n撿到便宜的機會還是有，或者是泡沫化的可能還是有，但就是很低。許多公司的抵押品都是房地產，如果房地產泡泡破了的話就會有許多公司倒閉，所以一個健全的政府（例如台灣），不太可能會讓這種事情發生。\n\n按照央行這種尿性，說不定連升息 3% 這種事情都做不到，所以打不贏就加入其實是一個好選擇。\n\n所以這篇文真的不是要告訴大家別買房，而是如果要買得要把以上事情都考慮清楚再買，如果決定要買，沒有夢想牽掛，就是要純自住（或像我一樣有特殊目的），那就直接買根本不用考慮。\n\n### 後記：使用寬限期投資而不繳本金\n前陣子在網路上看到大家說要使用寬限期投資。\n\n我覺得付不起時，房子要賣的話也不見得能夠 100% 賺的賣出去，因為付了很多利息且那一區也不一定在短期內有卓越的漲幅，更不用說扣掉機會成本和通膨最終就是爆虧。\n\n在現在這個非超低利率的時局，使用寬限期是一個頗危險的行為，因為即便使用定期定額大盤這種最穩健的投資方式，你都不一定打得贏利息，更不用說除了房子以外的理財行為，賠的機率還是很高的。當然買便宜的房子可以這麼做，但難保未來突然再升息，一個月加了幾千塊的利息你的月薪扛得住。\n\n大家知道 2000 萬的房子最低利率不用寬限期，你總共要繳600萬的利息嗎，你要確定使用五年甚至以上的寬限期，這五年你可以投資滾出淨利潤 200萬嗎。對我來說很難，但或許對某些人來說很容易。\n\n建議家裡沒有礦而且沒有天生神力，或對投資沒有獨門秘訣的人，還是腳踏實地的乖乖付本金，如果現在不是牛市的話，不要隨便學人家玩什麼寬限期拿錢來投資，1.13 利率的時候可以，現在 2.06 非常勉強的可以（兩千萬的房子前幾年一個月本金 4 萬，利息 3 萬），再升息恭喜你準備賣房或借錢了。\n\n台灣的環境升息確實是非常慢，我聽過另外一派理論是平常有在做投資功課的人一定要用寬限期來投資，因為台灣就是在懲罰不投資的人，實質上根本就是負利率。如果真的付不起就賣掉，實際上用差價來看還是賺。\n\n但對我這種風險極度趨避，又對投資一竅不通的人來說，這個行為我還是頗為害怕。",
    "date": "2024-03-29",
    "tags": [
      "社會課",
      "2024 二十大精選文章",
      "錢錢管理時間"
    ],
    "isPinned": false,
    "textCount": 3224
  },
  {
    "id": "choice-theory",
    "title": "社會課｜選擇論",
    "content": "為何選擇較多的人沒辦法做出正確的決定",
    "markdown": "\n### TL;DR\n- 因為選擇比較多，基數大的情況下，其中的爛選擇本來就比較多\n- 因為對自己有更多（過多）自信，即便選擇較多的原因是上天給予的\n- 較不容易參考他人的意見\n- 覺得不管怎麼樣都有退路，因為試錯成本非常低，承擔失敗的能力也比較高\n- 選擇比較多的人一定知道自己為什麼有選擇權，但大部分不知道這個依據可能會稍縱即逝\n    - 最簡單的例子就是隨著年紀增長，體力會下降，會年老色衰\n    - 深入一點的例子是前幾份工作學歷很重要，但後來基本就都看經歷了\n\n### 天生優勢的束縛\n長得好看、家裡有錢、天資聰穎，有的人降生到世界上本來就是帶著一身神裝，但很多時候這些東西都是一個束縛。\n\n他束縛著你的選擇、束縛著你的發展，你開始覺得技能點亂點也沒差，得到的寶物不珍惜也沒關係，但當你離開新手村，或者抵達最終副本的時候，一開始的神裝或許只是普裝。\n\n這也是為什麼「選擇比較多不一定可以做出正確選擇」這件事情那麼重要，因為以不變應萬變的前提是你本身就是在對的方向，而理論上我們應該「無恃其不來，恃吾有以待之」。所以那些你現在擁有的，都應改穩健地認為他總有一天會因為各種可能原因消逝，此時此刻就該做好準備。\n\n### 天生沒有比較多選擇的人呢\n反過來說選擇較少的人常常因為真的機會太少了，而會主動爭取。主動爭取的過程不僅容易吸收大量失敗的經驗還有他人的建議，還能夠越來越往上爬。就像是不擅長讀書的人，也是有不少成功人士或者在其他領域成功的案例。讀書固然很重要這邊就不提他的好處有哪些，但如果只會讀書的話未來也不一定能夠成功，更多的是當社畜而已。\n\n原因是很多書讀得好的人真的是因為家裡有錢栽培、爸媽有在注重讀書、他們具有讀書的天份。而不是他們真的理解為什麼要讀書，以及讀書有哪些好處，正常來說小朋友也不太可能無師自通，悟得讀書到底有什麼用。\n\n所以小時候有讀書的人都是具有一定選擇權的，而沒讀書的人選擇權就很少。\n\n也就是說選擇很多的人是在一直往下找，因為每次失敗之後都是在想反正我還可以有這個保底。而選擇很少的人每次失敗都是在往上爬，因為如果自己不積極一點根本連一個選擇都沒有。\n\n潛移默化之中選擇很少的人選擇其實一直在變多，而且在天時地利人和（也就是跨過某個檻之後），他也就成為有很多選擇的人了。\n\n最好的例子就是三十歲後的某些男人突然變得很值錢，因為在兩性市場裡面三十歲開始長相的佔比會開始大幅下降，外表的普男也可以變成正常的選擇。當然很醜或者很邋遢可能還是頗扣分的，但這只是我舉天時地利人和會讓你選擇權瞬間翻轉的其中一個例子而已。\n\n### 試錯成本，不代表你可以把它全部用盡\n選擇比較多的人，通常有更低的試錯成本。\n\n然而試錯是很有可能把自己越試越爛的，因為隨著失敗的經驗增加而又不思進取，真的是一直在備案裡面挑堪用的備案，那就是一直在往下挑選。別人的眼光也會覺得就一直是一個失敗的人。但為什麼看那些力爭上游、階級翻轉的人就不會覺得是失敗的人呢？\n\n因為他們通常在越走越高，即便短期之內沒有獲得機會，但他們本身是在變好的，所以只要環境或周遭的人一改變，他們瞬間就會成為市場裡面的 king。\n\n有時候別人怎麼看是頗為重要的，特別是這種吸引力法則強烈有用的情況，例如好的潛在對象一定會思考為什麼對方都跟爛人在一起，進而得出實際上這個人肯定有問題的結論。例如好的公司會思考為什麼這個人總是在爛公司打雜，進而得出這個人肯定不怎麼樣的結論。\n\n或許有時候會錯失機會，但如果這個人本質上是一個選擇很多的人，卻總在爛泥打滾，那就很奇怪了對吧。\n\n舉例來說一個讀私立科大的學生從打雜做起，慢慢成為一個堪用的工程師，進而成為某個模板網站外包公司的技術總監。但角色若是換成康乃爾資工的學生，任誰都會覺得其中一定有問題。\n\n有的女生長得天生麗質（也就這個優點），在年輕的時候真的非常吃香。但如果給人的印象就是，阿她就是一直找垃圾在一起呀，那終究曾經她錯過的那些好男生，也不可能再回頭。哪一個好男生會想被稱作接盤俠，會希望自己辛辛苦苦從社會底層爬上來，賺的錢，都要交給一個花瓶管呢？\n\n### 解法\n所以選擇較多的人如何做出正確選擇？\n\n實際上看到這篇文章已經成功一半了，因為認知到自己能有恃無恐的依據可能會在某天隨風飄散，就能夠非常有效的克制自己莫名的自信和選擇時的備胎心態。最好的方法並不是讓自己變好或者是開始瘋狂聽信他人建議，而是維持現狀，但在做決定時持有以下的態度：\n\n- 確保自己能做選擇的權力依然存在\n- 若是權力可能不再，那要如何讓自己在新環境擁有一樣的選擇權\n- 開放但不隨便\n- 參考他人意見但不盡信\n- 寧缺勿濫、寧缺勿濫、寧缺勿濫\n\n如此一來你隨時想著下一個環境的變異，就不會在優勢不見時手足無措，這樣也不可能在新環境裡面成為那個沒有選擇的人。\n\n### 結語\n以上這些內容實際上很難兌現，因為誰會真的知道什麼是好選擇、什麼是爛選擇呢？雖然我已經發過那麼多文章說怎麼選科系、怎麼選好男人跟好女人、怎麼規劃職涯。但充其量只是我的一家之言，很難套用在每個人身上。\n\n所以從上帝視角來看，某些人真的一直在把滿手老二打輸，有的人正在用三支三、三支四翻盤。誰能夠真正知道自己處在哪個定位呢？\n\n這時候有一個好對象、好朋友真的很重要了。",
    "date": "2024-03-29",
    "tags": [
      "社會課",
      "2024 二十大精選文章"
    ],
    "isPinned": false,
    "textCount": 2173
  },
  {
    "id": "before-work",
    "title": "社會課｜出社會工作前的三堂課",
    "content": "欺騙與拖欠是常見事件，請記得口說無憑",
    "markdown": "\n### TL;DR\n1. 沒有白紙黑字寫下來 100% 給你的 = 不會給你\n2. 勞健保、稅制、自提是怎麼運作的必須很清楚\n3. 不要把你的薪水跟別人說，那是你的底牌\n\n### 契約\n出了社會之後「口說無憑」這四個字可以說是我最大的底線。\n\n不管跟你多麼好的人都一樣，從小到大說話不算話的人太多了，食言而肥的爸媽、把獎勵收回的老師，到說會愛你一輩子的對象，你是他最好朋友的同學。實際上人就是一個習慣性說謊與反悔的動物，但以上這些例子都還只是感情的傷害，習慣了就有足夠的承受能力。如果牽扯到錢的話，不管經歷多少次還是會覺得很不爽。\n\n所以，沒有白紙黑字寫下來 100% 給你的，就等於不會給你。買房的時候、貸款的時候、談 offer 的時候，甚至是跟同事、上司開完會之後，都要請對方寫寄一份會議紀錄給你，或者最最最基本，你都得要寫 memo 下來寄給對方確認是否有問題，理解是否有出入。\n\n例如：\n1. 保底獎金有多少、保底年終有幾個月、保底休假怎麼算\n1. 預收屋如果房子水管有泥石沈積、有空鼓音該怎麼處理\n1. 租房子的時候恢復原狀該怎麼算，東西壞了誰修繕\n1. 專案做到哪個程度要幾 % 費用，訂金多少，斡旋金多少，尾款怎麼給\n1. 這個任務怎麼分工，誰要負責催，如果做不完怎麼辦，DL 什麼時候，誰要墊錢\n\n在開完會或者協商完之後理解有出入是難免的，不一定是對方存心要說話不算話或者是坑你（雖然有時候真的是，而且是大部分時候），所以為了不要讓場面變得尷尬或者撕破臉，一定要有人做出文本紀錄的動作。如果最後撕破臉你權益損害比較大，那就得你來做，因為這是保護自己最基本的方式。\n\n不然你想：\n\n1. 當初開完會後說好對方要做的事情，結果對方惡人先告狀說你都沒有把份內工作做完怎麼辦？\n1. 當初說好只要房子驗屋有任何問題，建商都會無條件負責，結果出事了說這個不在負責範圍怎麼辦？\n1. 當初說好要給你保底的福利，結果老闆說公司今年營收不好怎麼辦？\n\n死無對證、口說無憑，最後就是你身為小蝦迷吞下一切痛苦而已。\n\n### 社會運作模式\n這個社會不管是政治制度、金融制度還是公司制度都很重要，不管是從法律層面還是理財層面，你都必須要非常了解遊戲規則是什麼，才可以免去很多學費，才可以用最快的速度累積財富。\n\n這已經不是要怎麼倒垃圾或怎麼繳水電費、手機費的範疇，是你必須要知道你每年會被國家跟金融機構拿走多少錢，而你有沒有什麼方法可以得到最大的利益。\n\n1. 工作相關的：勞健保、所得稅、自提\n1. 理財相關的：基本的金融商品、股利、資本利得稅、手續費\n1. 生活相關的：信用分數與信用卡、租屋補助、保險\n1. 房子相關的：訂金、斡旋金、佣金、驗屋、貸款計算方式\n\n我不會說一定要買什麼金融商品才是對的或錯的，我也建議大家不要盡信房仲和賣保險的人的話，畢竟他們想賺你的錢，所以一定要做好功課。最好的方法就是多聽不同的人說的話，不只是不同個體，還得是不同領域的人。\n\n另外你會漸漸地需要付出很大筆的金額，例如買車、買房、把大量現金換成各種穩定的金融商品等。\n\n做好功課是非常重要的，你得知道在台北養一台車一個月要花多少錢，也得知道你認為和藹可親的人不管有沒有惡意都可能會害你損失慘重。例如你很有可能會被男友的媽媽騙去買 78 歲才能領出來的保單，或者一頭熱地去貸款開五倍以上的槓桿做你負擔不起風險的投資。\n\n### 留一點給人探聽\n（不只是薪水）不要告訴別人你賺多少錢 / 有多少錢，不僅僅是趨吉避凶而已，還可以讓你有更多的資本做選擇，例如：\n\n1. HR 或公司沒有根據跟你殺價。他不知道你的底牌是什麼自然就沒有主動權\n1. 蒼蠅沒辦法跟你借錢。如果大家（包含家人、摯友）知道你一個月賺十萬，那跟你借一萬也不為過，你自然也很難拒絕\n1. 沒辦法吃你豆腐。如果大家知道你年終領好幾個月，那就會想要叫你請這攤\n\n談薪水不要把之前的薪水說出來，要把他當底牌這應該是常識。我想說的是，很多時候你不可以把每個人都當作宇宙無敵知心好友，尤其是親人和同事，他們表面上會跟你很友好，邏輯上也應該與你保持親密或不錯的關係，可私底下捅你一刀或者吃你豆腐的通常都是這種有點關係的人。\n\n好一點的是在背後說你名不符實，冗員還拿那麼多錢，壞一點的就是在公開場合直接把你賺多少說出來，強迫你請客或者接受大家的目光。\n\n不只是錢，連你出去玩或者有拿到任何好處都應該低調，因為嘴賤的人無處不在，他們會說：哇你怎麼那麼閒，還可以出去玩呦，是不是工作太少了。\n\n### 結語\n我並不是要把每一個進入社會的人的身邊的人都打入地獄，也不是說不能跟同事變成知心好友，但你必須不是那個首先付出真心、掀出底牌的那個人，更不用說對方那些假意先敞開心房的心裡話很有可能都是子虛烏有。\n\n也希望大家想想「如果」：\n\n- 你爸媽知道你存了三百萬之後，跟你要五十萬孝親費怎麼辦\n- 房東知道你月入十萬之後，要漲房租怎麼辦\n- 老闆知道你特休去歐洲玩，給你加重工作怎麼辦\n\n不要落人口舌實際上就是韜光養晦的其中一個目的，你固然需要顯擺你的功勞和績效，但那是你努力的結果。如果是「錢」，再怎麼樣人都是會起妒心。\n\n避免受傷的最好方法並不是不沾，也不是毫不洩漏一丁點資訊。適當的相處、交換意見和隱私是促進感情、拓展人脈的最好方法。但必須時時刻刻提醒自己現在不是在學校玩辦家家酒，是在社會上打滾，每個人都是來演戲只為了賺錢養家活口。",
    "date": "2024-03-27",
    "tags": [
      "社會課",
      "2024 二十大精選文章",
      "你的最佳職涯導師"
    ],
    "isPinned": false,
    "textCount": 2234
  },
  {
    "id": "engineer-love-story",
    "title": "廣寒宮｜工程師於兩性市場的現況",
    "content": "這或許不是污名化，而是社會結構性的問題",
    "markdown": "### 前言\n完全能想像社會上大部分人對工程師這個職業在愛情上的表現印象是多麼差，畢竟連我這幾年（從高中開始）聽到一些言論還是會默默皺眉頭。而且我認識最少有一半的理工男，真的不只父權，還有一股不可言喻的迷之自信。\n\n工程師的自信和父權言行來自於習慣在男性圈子和社會上給的期待。前者是在男校或理工科裡面，就是一直在比誰更厲害（無論是讀書、打球、電動、薪水、夯不夯），後者則是「平均來講」，他們賺的比大部分人多。\n\n先不說男生世界裡這樣的規則以及用賺多少評斷一個人厲不厲害，合理與否，現在的狀況就是如此。在這個同溫層中怎麼運作固然不會影響到外人，然而從男性競爭市場跳脫，轉到兩性市場或者就業市場時，那就很不一樣了。\n\n### 初入兩性市場\n初入兩性市場的理工直男，如果沒有交過女朋友，或者因為什麼經驗覺醒的話，那只能用慘來形容。畢竟對方是跟自己完完全全不一樣的個體，背景、思想、在意的點、過往生活經驗，都幾乎不一樣。\n\n更不用說過往建立起來的自信還有所謂能力，在這裏都沒用，還必須要打掉重練，能接受這個事情的男生真的少之又少。大部分不是拒絕接受，就是根本沒意識到這件事。\n\n而理工直男從被塑造到進入兩性市場前，基本上都是誰力氣大誰說話，誰能吵贏就聽誰的，而不是我站在你的角度思考怎麼樣可以取得兩人（甚至群體）的平衡點，也不可能知道有時候退讓才是正確的選擇。\n\n一開始已經先入為主錯誤觀念了，進入新世界之後要面對前人種下的惡意，有父權女在旁邊散播 pick me 言論，還要被說沒車憑什麼交女朋友。自然只會越來越糟糕。\n\n### 異性友人\n理論上擁有越多異性友人，會讓這個情形好很多。會這樣說是因為我自己也從男校走到大學，完全理解當一個男生習慣那種肆意妄為的社交模式，遇到異性時真的很難改變。只不過我運氣比較好，有許多人的提點和各種誤打誤撞的經驗才沒有被兩性市場淘汰。\n\n在不斷碰壁還有不知道怎麼做才能認識女生的過程之中，再加上對這個群體的完全不了解，男生會把自信建立在「我自己夠好」上，畢竟在過往的規則就是這樣。\n\n在被拒絕的時候會提出非常多「我自己很好」的論點。最後如果見笑轉生氣，就是因為是淺意識中的假設被否定：\n\n我自己夠好\n→ 所以你該怎麼樣\n→ 你不這麼做\n→ 我不夠好\n\n而這個不只出現在兩性市場，就業市場更是這樣。 \n\n### 自救\n\n說自己身邊還是有不少正常甚至很棒的男工程師，好像沒什麼意義。畢竟這樣說不只完全無法洗刷罪名，還會被厭女男罵又在找藉口 not all。\n\n但我認為可以試著探討看看為什麼這些人明明有一樣的背景跟經歷，卻有著不同結果，這可能對想改變但不知道怎麼下手的理工男有許多幫助。\n\n第一肯定是不要把碰壁歸因於自己不夠好，或對方不識貨，應該把原因歸類在兩人不適合。這個就跟面試失敗或被裁員的道理很像，有時候天時地利人和你才能把握屬於你的機會，如果失敗或不盡人意，也別崩潰和否定自己。\n\n然而如果你真的引頸期盼能獲得對方的認可（無論是老闆、對象，或任何人事物），你勢必要先了解對方需要什麼，然後再在可承受範圍內的改變自己。\n\n但這個延伸下去可能會打上萬個字，所以先提到這。\n\n第二則是，我觀察身邊的超讚理工男都有一個共通點：愛看書。當然單單興趣自然不可能把一個人塑造的與眾不同，在我眼裡他們不只是涉獵很多元的書籍，對人文的素養也比一般男生高\n\n不只是管理的書、理財的書，也包含社會學、哲學、文學的相關書籍，有很多人關心政治、歷史，甚至小兒麻痹、無條件基本收入之類的社會議題。\n\n雖然我知道建議理工直男去看書真的是要他們的命，因為實驗都做不完，加班結束都要累死了，還要看書？有時間打電動、看動漫就不錯了。\n\n但這只是一個從惡性循環中跳脫的方法，不一定有用，如果找得到其他方法，或根本不想改變？",
    "date": "2024-03-15",
    "tags": [
      "廣寒宮",
      "2024 二十大精選文章"
    ],
    "isPinned": false,
    "textCount": 1559
  },
  {
    "id": "good-man",
    "title": "廣寒宮｜怎麼樣的人是好男人",
    "content": "我如果是一個女人，會覺得怎麼樣的男人是好男友、好男人、好老公、好爸爸",
    "markdown": "### 為什麼這個問題很重要\n如何選擇另一半我覺得是一個女人人生至關重要的一環，並不是說女生一定要依賴男生，或者是女生一定要嫁給男生，或者說女生只要找到一個好老公人生就會一帆風順。\n\n主要是女生在兩性市場裡面是「選擇的人」，就像就業市場裡面「老闆」也是選擇的人，彼此對對方有諸多不滿，以及選擇的權力不對等（幾乎都是一方在選擇另一方），加上難以設身處地（許多男生無法想像女性遭受的惡意，許多勞方無法理解老闆要的到底是什麼，反之亦然），導致市場始終有許多爭議\n\n不能說誰一定怎樣，畢竟優秀的人能夠打破市場的常態，中間人（好的獵頭、朋友介紹）也可以，更不用說大環境也會影響（例如業界狀態真的不好）。剩下的人就只能在社群媒體上抱怨而已，不怎麼會檢討自己\n\n實際上我覺得有太多選擇不一定是一件好事，因為有很多選擇不代表可以選出最正確的選擇，也不代表一定可以選出不錯的選擇。更有可能的是因為百分之八十都是不好甚至很差的選擇，而沒有足夠的判斷能力時（甚至還過度自信），一直選出錯誤的選擇。那就會讓自己在這條路上一直很不幸福。\n\n> 或許男生一直很不幸福比例比較低的原因有：父權社會、根本沒有交往過幾次之類的可能，但我並不在乎男生幸不幸福，因為這不是這篇文的重點。\n\n### F 級水準\n不及格的優點就是那種低成本的付出，也就是 +9 型的付出，細節是什麼我猜大家知道，就是那種賺沒多少錢或者用旁門左道賺到的錢來買各種東西討女生開心，浪漫確實是一個重點沒錯，但像是 IPhon、Apple Watch 甚至包包這種禮物，女生應該要有能力可以買給自己，而不是拿到這些低成本的付出就感動得死去活來。\n\n> 這篇文不會提到這些有毒的男人會帶給女生什麼影響，不然可能會長的跟論文一樣。\n\n同樣不及格的優點還有以下：「會被誤認為優點的缺點」\n\n1. 不談論政治或者對政治冷感。相信我，這樣的人一定會在某一天被有意人士洗腦，然後跟你意見相左的時候完全不能理性討論。不相信也沒關係我不打算說服任何人。\n1. 不會跟別人吵架（不能或完全不想都是）。我自己會把他歸類在缺點，但我猜一個男生不會四處跟人起爭議或者能夠忍能所不能忍，對女生來說應該會覺得是不錯的優點，所以我放在這裡。但我得說的是如果女生自己不是會挺身而出捍衛自己和家人權益的人，然後老公又是非常不爭、不沾的人，那未來會有很多問題。這個部分等以後專門講「不沾」的文章再細說。\n1. 節儉。如果連 10 塊錢都要計較，超級暴風雨計程車錢都要省，那我也不相信能多幸福。一個人可以不要奢侈，或者不要亂買東西，但如果會影響生活品質的行為也要「辛苦自己和辛苦對方」的話，那真的會很痛苦。更延伸一點的話就是貧賤夫妻百事哀了。\n\n以下及格的水準我會分成 ABC 三等級，「在哪一級」只是我這樣覺得，大家自行斟酌服用然後依照個人意見調整。好懂的部分或者不需要解釋的部分我就只提到就好，不會附加敘述了。\n\n### C 級水準\nC 級水準我稱為「生而為人」應該要達到的水準，或者是「我覺得」沒啥意義的優點，甚至「具有一定風險」的優點，也就是如果一個女生跟別人說他男朋友多好多好時，說的是這些內容，我可能會稍微（或超級）白眼。\n\n1. 家裡有礦，有車、有房且不是自己賺的。沒什麼好說的，就是家裡有礦，因為家裡有礦的男人和他的家庭有太多風險。我並不會仇富到說這樣的男人和他爸媽一定有問題，但我覺得有很多人事物需要再三確認。而這跟普通人家和窮人家要注意的點不同，一般人都不會知道跟有錢人交往甚至結婚需要注意什麼，所以這才會是一個需要注意的風險。\n1. 高學歷。很普通的一個優點，就是會讀書而已。\n1. 半夜送宵夜或熱飲給你。也是一個很普通的優點，甚至是 uber eat 外送員就能取代的優點。\n1. 願意主動做家事，願意主動接送，願意在你需要幫忙時犧牲自己的娛樂時間提供幫助。\n\n### B級水準\n以下開始就是好男人了。\n\n1. 長得帥。\n1. 會與異性保持距離，會主動報備，會在乎你的感受，而不是在強辯和拘泥在自己到底有沒有踰矩。\n1. 家裡的經濟水準、教育背景與女方相似或略高/低，且穩定。\n1. 有穩定的工作。\n1. 是個優秀的聆聽者。\n1. 能夠放得下身段，不會把自己的面子放在最高的 priority。會把這個點放在 B 而不是 C 是因為我知道對一個男生來說，要把面子放下真的是非常困難的一件事情，所以能真正做到的人我給予正評。\n1. 對許多人生該了解的事情有足夠的了解，或有興趣/動力了解。例如貸款、稅制、如何籌辦婚禮、生小孩需要注意什麼、教育制度、工作態度。\n1. 對女方有足夠的信任。一個男生不會有分離焦慮、被害妄想、不安全感是非常重要的，因為這不只代表他有足夠的情商、理性，還代表者他有他需要忙的事情，不會把 100% 的時間和專注力投放在你身上，你們這才會有自己舒適的私人空間。\n1. 好朋友們都是優質的男性，或至少正常男性。\n1. 是個能理性討論嚴肅事情的人。我認為一個好對象不一定要是一個好的建議者，但最少要能夠「陪伴」另一半解決問題。\n1. 有自己的興趣跟沒事做時可以投入的事情。因為現在要找的是人，不是狗。\n1. 非常注重安全。總是能眼觀四面、耳聽八放，在包含交通、娛樂各種層面都能確保你們都在安全的狀況下。\n\n## A 級水準\n高品質的浪漫。\n\n1. 尊重但不畏懼原生家庭的任何建議。這種男生會讓你在過年的時候除夕跟初一待在娘家不用去夫家當奴隸，且在有任何爭執的時候站在你的那一方，願意替你說好話。\n1. 被女方好朋友們喜歡和稱讚（前提是這個好朋友不是假面閨蜜）。\n1. 談吐、格局。\n1. 控制局面、執行、規劃、解決問題的能力。\n\n### 結語\n以上的內容基本上都是客觀優點，但還是有參雜一些主客觀模糊的優點例如男方家庭與女方家庭最好是相仿，或者是要讓女生的好朋友喜歡。至於主觀的優點例如最好要有什麼興趣，能有什麼共通話題，薪資水準要多少以上，喜歡什麼樣的生活之類的，那個每個女生肯定都不一樣，我就不提到了。\n\n許多低成本的優點和容易被誤認為優點的缺點，實際上就是有心的男生都可以做到，或者是有錢有閒的男生就能做到，我並不認為那是真正在挑選一個對象時該參考的點。\n\n我的愛情觀更像是最佳的伴侶是人生的友軍，就像分組報告大家不會選擇爛人一樣，一定會選擇那些你覺得靠得住的人來共事。兩個人攜手走到一起之後那些快樂出遊或者兩個人的小情小愛固然是非常重要的一部分沒錯，但在甜蜜期過後，你們決定走得更遠，或者是想要一起做到什麼事情（小至旅行，大至結婚生子），都逃不開互相包容、討論、規劃、實踐。\n\n所以不要說到人人稱羨，光是要在一起長久且普通等級的幸福，就逃不開一個正確且具有基本常識的好對象。\n\n### 後記：所謂豪門與接盤\n看到過這麼多年紀比我大的人，絕大部分娶的確實都不是那種無腦小模，要賣臉跟奶最差也得是個空姐或新聞主播，更多的甚至是一個同樣在事業有企圖的女生或醫生。嫁入豪門或找到一個真正的好對象確實沒有我以前想的那麼容易。\n\n但當然有不少富二代是叼著菸、翹著二郎腿整天遊手好閒，跟一群豬朋狗友在一起，但反正女生時間到了就會吃到苦頭。這個道理就跟好對象不一定得是竹科工程師一樣，一個沒辦法共感跟對另一半固執無法溝通的男人，一樣是個宇宙爛人，跟他的學歷、背景、知識量無關。\n\n我曾經看到一個訪談影片影片有提到，雷拉她爸爸問酷炫：「你看這個照片，你會想娶這個女生嗎」我覺得一個人要拍什麼照片或影片屬於個人自由，但到最後自己身邊會剩下什麼人是顯而易見的，當一個人落得爛蘋果裡面選一顆好看的下場，永遠是自己的問題，沒什麼好怪別人的。\n\n這也是為什麼單親媽媽要找工程師接盤，因為很概括不負責任的來說，工程師的優點說不定就只有賺得多而已，剩下全部都是缺點。\n\n這個社會就是這樣運轉的，很多網路梗會說憂鬱症、護理女、長髮男、會去夜店跟外拍的人不要碰。但對我來說那不只是開玩笑而已，更像是「某一個特定族群」的過濾方式，如果一個人需要在各種名流高端場合介紹自己的「另一半」，那真正說得上嘴的不是長得多好看，而是多有成就，更不可能是個隨便的人。\n\n這個聽起來很像屁話，但我觀察的結果目前是如此，那些人根本不打算花時間去了解一個人是不是純淨的，一個人只要有一些污點他們根本就看不見你。",
    "date": "2024-03-15",
    "tags": [
      "廣寒宮"
    ],
    "isPinned": false,
    "textCount": 3399
  },
  {
    "id": "point-of-view",
    "title": "社會課｜站在你有所求的人的角度看問題",
    "content": "看似合理但無法解決問題，看似合理但卻是最差的選擇",
    "markdown": "\n不管哪裡都一定有人禍，跟天災一樣，即便你做的再好他都會到你門口撒尿，例如面試失敗就上網抱怨的求職者。反過來也是，你身為一個男人根本什麼都沒做就已經背負人類歷史共業。或者是你只不過是跟男生普通地聊天，他就和你告白，失敗之後又要到處說你壞話。\n\n如何面對他們，無他，就是人生功課。\n\n兩性市場裡：Pick me 跟白騎士這些稱謂都一樣，Not all men 這種說法也是。而勞動市場裡面則是：資方都是慣老闆、吸血鬼、富二代，勞方都貪得無厭、好吃懶做。這些都是看似合理但無法解決問題的說法。而市場裡面成功的人都是「把問題留給會遇到問題的人解決」的一群人。\n\n### 分享一個故事\n算是紀錄我成為以前討厭的大人，也讓對我不開心的同學可以用不同角度看這個世界，能互相理解就理解，不能就算了。\n\n我也曾經是一個覺得「我們做得那麼好，對生態那麼有貢獻的專案，你們為什麼不給我錢！」的人，暗自認為這些公司老闆都是🐎的富二代，根本對世界一點貢獻都沒有只想著賺錢。\n\n那時候扛著收入壓力去跟公司和 VC 募資，甚至跟一堆教授請求合作都告吹，結果有某一個公司的執行長跟我說，公司不太可能會贊助這種「專對生態甚至社會有貢獻」的專案，給的資金也不會想用在「獎勵你們做得很好」。但他人真的很好，願意說不然我們幫他們廣告還有協辦各種活動，換取他們的贊助這樣，不然大家根本連🐦都不🐦我。\n\n我這時候才發現當想要爭取什麼東西來過上好生活甚至完成理想時，你需要站在對方的角度去思考他（e.g., 資本家）需要什麼，而不是打著「這東西對大家都好、又做得超頂」的旗子來勒索他們。\n\n因為對你我好的不一定對他好，他的義務僅止於給大家承諾好的報酬還有繳稅而已。如果真的想劫富濟貧或者是讓社會更公平、健康，夭飽吵肯定是沒用的，不是努力上位之後保持初衷，就是革命靠流血而已。\n\n### 兩性市場裡的男人，與資本市場裡被傷害的我\n資本市場裡面，在我眼裡能得到報酬的（無論是錢還是 credit）大部分人好像也都只是出一張嘴沒有真的做出個什麼東西，拿了錢或者出名了就高歌離席。真正能解決問題的人、想要讓各種高門檻降低的人、希望推進產業技術的人，卻會被視為：既然你已經做了那你就繼續做吧；既然你已經無償做了一些或全部代表我們不需要幫助你也可以。\n\nVC、公司投資者、非營利組織，都是資本市場裡面的給予者，就像就業市場裡面的老闆，一定會有很多時候你想要幹爆他們，問他們是不是眼睛瞎了，明明自己這麼努力，為什麼那些冗員、小人的收穫是自己的兩倍呢？\n\n實際上你必須去看市場裡面給予的人要的是什麼，例如：\n\n- 資本市場：VC、公司投資者、非營利組織\n- 就業市場：老闆\n- 兩性市場：女生，或非常優秀的男生\n\n舉老闆為例好了，他希望找的是一個能夠附和他的人，還是一個業績很高，高到他有點不想發這麼多錢的人？\n\n我不會說每個老闆要的都是搖尾巴的狗，但你必須知道有的老闆並不是那麼想要優秀的人、能夠取代他的人、比他更有魅力的人、會花他的錢的人。所以提升自己固然很重要，但韜光養晦、審拾奪度、隱忍不發有時候能夠讓你在這個市場裡面不會變成殺雞儆猴的那隻雞。所以你要做的是： **理解老闆** 。\n\n就像我前面已經提過的資本市場的例子一樣，兩性市場裡面的男人大部分根本就不知道女生要什麼。我的建議是有空的話，不僅是提升自己，你也應該多了解、多看看你認為的那些女權、拜金女在說什麼，有的固然是非常物質和令人不齒，但跨出舒適圈或許能夠讓你有一些新的體悟。",
    "date": "2024-03-12",
    "tags": [
      "社會課",
      "2024 二十大精選文章"
    ],
    "isPinned": false,
    "textCount": 1445
  },
  {
    "id": "escape-competition",
    "title": "社會課｜弱者逃避競爭，然後被淘汰",
    "content": "運氣會讓弱者前往不屬於他的地方",
    "markdown": "\n> 這篇文與「[社會課 #3｜真的是憂鬱導致，還是你就是沒有你想像中厲害](https://chihaolu.github.io/publication/article/pain-pretender)」有異曲同工之妙，但我仍然是想再把他敘述一次我看見的詭異亂象。\n\n這幾年，從哀嘆台大電機內卷到抱怨管院菁英文化都是很奇怪的事情，會抱怨說這樣很累、到處都是崇尚菁英、LinkedIn 很有病的人，在我眼裡就是既想享受菁英的待遇，又不想付出相對應的努力的人。交換、實習、做專題、做 Side Project、社團、研討會，要拓展自己的機會、提升自己的實力本來就要花上很多時間。想獲得比別人好的機會就是得比別人努力，不然就是看家裡有沒有礦而已。\n\n內卷跟菁英文化到底有什麼好奇怪的，你大可安穩的選擇一份沒那麼頂的工作，在郊區住上一個不是很好但還可以的房子。你不用那麼努力也能夠憑藉著還可以的學歷，得到一份活得下去甚至某種程度上還挺愜意的工作吧。\n\n或許內卷這個詞說的是努力者無法得到正常的收穫，但我覺得用這個定義反駁我的人很奇怪，那就是這個社會現況就是有礦的人努力能夠加倍，那也只是因為你想要在首都過上最美妙的生活。如果是在非首都的地方我不認為努力無法得到收穫。\n\n> 想要在台北市買一間房子家裡又沒有礦，不當菁英只能做夢不是嗎？\n\n你看到大家都那麼努力會感到壓力，是因為你自己給自己壓力，你想要像他們一樣獲得同樣的關注、利益、名聲各種收穫，或僅僅是自己對自己的要求。你沒辦法要求所有往前大力邁進的人停下來等你，無論他是用錢堆起來還是用手砌起來的都一樣，你要是想要跟別人一樣或者想要獲得更多，本來就該更努力，或運氣更好投胎到好家庭，這就是事實。\n\n我完全不理解一群人抱在一起說這世界很不公平，或者這樣很內卷、很病態的意義是什麼，不賺錢就沒辦法買房子、結婚、生小孩呀，不賺錢就不能買愛馬仕跟保時捷呀，不賺錢就不能炫耀自己很厲害呀。\n\n> 人就是這樣，為什麼會期望別人停下來等你呢？\n\n不想那麼努力、不想當菁英、不想在 LinkedIn 上假掰、不想順著時代潮流選擇醫牙電資或當管院 elite 真的沒關係，每個人都有自己舒服的生活方式。\n\n但如果你沒有犧牲跟付出，沒有委曲求全，也沒有過人的運氣投胎到好家庭，那憑什麼可以買在市中心的房子，憑什麼可以賺高於平均所得的錢得到更好的物質生活，憑什麼可以讓自己的小孩受最好的教育？\n\n> 這個世界此時此刻就是這樣轉的，請從幻想中的烏托邦醒來\n\n### 成為菁英，但不是走捷徑\n我覺得走捷徑真的是無論玩音樂還是就學期間最不應該碰的一條路，當 elite 受人吹捧真的很爽沒錯，拋棄學理直接開始實作很快沒錯，略過資料結構與演算法直接開始寫 web/app 很有成就感沒錯，專注在狂敲猛打或各種炫技而沒有讀好樂理很博人眼球沒錯。\n\n但那些東西就像冤親債主一樣，永遠都擺脫不掉，現在看不到，在未來某時某刻你還是要面對，而且拖越久未來要償還時的代價就越大。\n\n但這種話我現在已經不跟身邊的任何人講了，誰不喜歡立竿見影的成果，誰不喜歡眾人喝采的簇擁。誰又會喜歡枯燥乏味的學科，誰又會喜歡疲憊不堪的練習呢？",
    "date": "2024-03-11",
    "tags": [
      "社會課"
    ],
    "isPinned": false,
    "textCount": 1314
  },
  {
    "id": "it-is-early",
    "title": "兔子窩｜時間還早",
    "content": "試試看也許會發現自己的極限遠比想像中高",
    "markdown": "### 前言：頂尖樂手\n其實很多事情真的很不嫌晚，一切也根本就還沒開始。最近才知道很多老師都超晚才找到自己要幹嘛，例如曹瑋研究所才開始彈貝斯，Elin 20 幾歲才開始練琴。跟我們預想的都不一樣，我們以為這些台灣的頂尖樂手都是從小經過音樂訓練到大，或者本身都是天才，但其實不是。他們決定要開始走音樂這條路的時候已經老大不小了，但每天練十幾個小時也可以在五到十年內就進步成這樣。\n\n### 恐懼來自於未知\n我大概能理解為什麼身邊很多比我年長的人跟我說，我現在能知道自己要幹嘛而且已經做了很多，是一件超級難能可貴的事情，所以不用特別對未來的不確定感到焦慮，也不用太緊張地想要把自己榨乾，更不用擔心如果現在不怎麽樣或做出錯誤選擇會有什麼後果。\n\n恐懼實際上來自於未知，真正投身其中之後才發現很多大師並不是神，看起來甚至有一點駑鈍的。其實他們都是對一個專業有著透徹的技術與知識量，而這基本上都是用時間換來的，而且也不用太長，大概每天研究同一個領域或專業持續三到五年就能到一般人觸及不了的領域了。\n\n大家好像都是二十好幾才「開始有一點」知道自己要幹嘛，然後才「開始」努力，幾乎都不是二十幾歲就已經功成名就或確定人生走向（不然也太無聊了吧）。所以現在才剛知道自己要幹嘛還算早，但如果還沒開始確實是該開始想了，除非家裡有礦。\n\n且那件事情的必要條件很少（不代表比較簡單或困難），例如當律師醫生會計師你得考到某些東西，或要有二類頂大碩才能去某些科技業，那就很難老大不小才開始。\n\n所以真的有幾件事情是三十歲不能做的？要回去讀書什麼的也不是不行吧（只是可能要半工半讀，如果家裡沒問題的話），但法律也沒有規定三十歲不能重讀大學，更不用說三十歲才出國深造的人大有人在。\n\n### 最大的對手真的是自己\n看到身邊的人超級厲害，早早就達到別人三四十歲甚至五六十歲（不兼職的公務員年資要 25-30年才會月薪十萬）就達到的目標會讓人很躁，但人生真的是跟自己的比賽，除非你生活快樂源泉是贏過別人那另當別論。\n\n意識到自己最大且唯一的對手是自己之後，會快樂很多，努力起來也會輕鬆很多，因為你知道自己所有的缺點跟不足，你可以做很多彌補自己短板、加強自己的動作。而不是看不見別人的任何缺點跟起跑點就覺得別人太強了，實際上他在你看不見的地方也有很多不快樂跟無法彌補的事情。\n\n這和拿灣區的薪水繳台北的稅，拿台灣的薪水買泰國的房子同理，完全是沒意義的比較。\n\n這也是為什麼沒讀過多少書的社會底層比各位都快樂（說不定還賺的更多），因為他們沒看過一個人可以努力到什麼程度，也不知道世界多大，可以逆天改命到哪個階級。如果他們只看自己還有身邊的人的話，那有什麼好不快樂的。\n\n當然他們會承受資訊不對等的風險，例如被政客或金融機構騙，但說實在的+9是極端案例，看看你我的爸媽其實也是普通人吧，沒有過人的眼界和成就通常些沒有過得淒慘無比。\n\n### 開始\n所以如果可以的話，有餘裕的時間和金錢能夠負擔嘗試的成本，那就去做做看你夢寐以求想要嘗試的事情，去爬到你想要抵達的高度，不管是滿足你自己還是想跟誰一樣厲害都可以。當然如果嘗試了發現撐不下去，自己真的完完全全沒辦法，那就放棄也沒關係，只要你未來回過頭看這次嘗試是值得的，你是滿足的，而不是後悔的就好。\n\n你不要騙自己說不知道未來回頭看會不會後悔，其實你心裡完全知道自己可不可以、會不會後悔。",
    "date": "2024-03-03",
    "tags": [
      "兔子窩"
    ],
    "isPinned": false,
    "textCount": 1395
  },
  {
    "id": "why-never-fortune-tell",
    "title": "兔子窩｜為什麼我不再碰易經",
    "content": "知道這些事情對你我有什麼好處呢？",
    "markdown": "> 最近剛好看了翦商這本書，想說稍微講一個有關聯的事情。\n\n\n### 關於我\n我已經很久很久沒有幫人算易經了，但其實一直有在加減讀或者某種程度上的精進自己。這裡我要先講，如果你過去拿的是五十塊或以下算命，那都是趣味趣味的飯後消遣，純屬休閒娛樂，真正算一次要搞一兩個小時以上。當然我也不在乎別人說我準不準，反正我也不靠這個吃飯，也沒辦法靠這個吃飯。\n\n最後一次算應該是大二上，或者是那前後，我就是在那段時間突然發現一個不太妙的事情。那就是這個東西我不該拿來預測未來，因為他會讓我遇到非常多危險的事情。\n\n在許多有收錢的經驗裡面有很準也有很不準的，但唯一 100% 確定的就是如果越準，或者我提出的方法越有用，那我之後就會遇到越大的血光。即便後來把全部錢都拿去迴向也一樣，完全沒用。\n\n這聽起來很像唬爛，我也這麼希望，因為如果這是唬爛，不會受傷的話，那我又多一個賺錢而且還不用繳稅的途徑了，幹嘛不要。\n\n### 適合算的情況\n易經這個東西對我（這個門派）來說更像是在數個選擇之中選擇一個較好的，或者是列出優缺點給你參考。舉例來說你有 A、B、C 三間公司已經確定錄取，但你遲遲無法決定哪一間比較好，這時候就很適合卜卦來知道這三間公司的優缺點。\n\n例如我會告訴你 A 的未來發展是最好的，最適合當跳板，但你在公司的這段期間可能會過得不是很快樂。B 的工作期間體驗與感受是最棒的，但可能很難再有突破。C 可能在未來有不錯的發展，工作體驗也還行，但就是需要特別小心主管問題。\n\n不太可能真正算出一個完美無缺的結果然後要你直直往那裡走。\n\n所以問我研究所會不會上，跟這個女生告白會不會成功是沒有意義的。因為算出來了會上又怎麼樣，告白會成功又怎麼樣，而失敗又怎麼樣？實際上會不會如意並不是去算命就會往你想的方向走，除非你算出了不好的結果，而那位替你算命的人能夠替你化解或者提供解法。這是非常高端的技巧，我目前完全沒辦法，頂多可以告訴你解鈴之人在哪，或者大概何時會有轉機而已。\n\n「窮人算命，富人燒香」，這句話我有一個更深的體悟，那就是命可能會越算越差，因為原本可能會如意的事情有機率因為你提前預知天機而改變。而你提前知道的那些人生關卡，可能會加倍且提早得向你襲來，這時候如果你沒有辦法可以化解就會非常危險。\n\n### 更重要的是智慧，而不是預知未來\n我其實是一個無神論者，但又不得不相信用血光換預知這種交易，也不得不佩服這書裡面有許多博大精深的智慧，例如中庸之道還有應變之道。\n\n先知道了未來不僅要付出一些代價，很多時候也不是那麼簡單可以改變的，反而會讓慘劇提前發生。那不如從中學習各種道理跟解法，讓自己有辦法在面對困難的時候妥善解決，從根本上把自己改變。\n\n因為改變一次單一事件的結果並沒有意義，會發生的終究是會發生，因為導致一個好壞事件發生的常常不是巧合（當然有時候是）。\n\n所以從那之後我開始改變各種習慣跟個人的想法到現在，不管大家相不相信，反正我的人生可以說是順遂到不能再更順遂，身邊的人或者團體的結果不一定很完美，但還是很不錯。\n\n至於為什麼會造成血光我也不知道，可能要問天了吧，總而言之我不太可能再幫任何人算命，因為一點好處都沒有。",
    "date": "2024-03-03",
    "tags": [
      "兔子窩"
    ],
    "isPinned": false,
    "textCount": 1315
  },
  {
    "id": "metal-life",
    "title": "社會課｜銅鐵湯匙的苦命人生",
    "content": "銅鐵湯匙想逆天變成貴金屬",
    "markdown": "\n我們這種介在金銀湯匙跟塑膠湯匙之間的銅鐵湯匙，如果還期盼自己能逆天變成貴金屬，那真的很痛苦。\n\n如果是木湯匙或者塑膠湯匙還可以誤打誤撞過上快樂的日子，金銀湯匙就不用說了大家應該看得很多，安逸或者早早就認清事實的銅鐵湯匙也不錯。但如果自己明明是普通的金屬湯匙還想在首都白手起家，讓自己或自己的小孩變成金銀湯匙，那真的是痛苦至極。\n\n### 視角 & 選擇\n我覺得這之中最大的問題是沒辦法用不同的視角去看待一個問題。無論是不同角度、不同生命跨度、不同方面的效益、不同追求等等的。就像一次期中考考不好，從生命的維度去看就覺得微不足道，但當下就很難抽離，畢竟可能會被當也不太能隨便看待。\n\n但當然不是說每次期考就乾脆都放飛，而是要在同一時間以非常多的角度去審視一個選擇，再去決定怎麼做，例如小到到底要放棄這個作業去做其他更優先的事情還是不要，大到到底要出國、國內讀碩還是直接就業。\n\n撇除所有不可控的外在因素，可控的因素裡「選擇」絕對是最重要的，但他依賴在太多前提之下，人需要具備一定的判斷力、觀察力、知識點才有辦法做出正確的選擇。\n\n我知道講起來很簡單（雖然我覺得大部分人也不知道以上內容），但做起來真的很難。因為成本有限，多數時候選了就不能改了，所以我想講的其實是：\n\n關於找到未來的所有選擇，想要知道現在到底該幹嘛才是對的，我認為最最最簡單的方法，就是把你短、中、長期「所有」必須做跟想做的事情列出來分析，然後就去做別再想了。\n\n### 路得自己走出來，意義得自己賦予\n大家看到這裡可能會覺得怎麼可能列出來就知道自己要找什麼類型的工作，或知道真命天子在哪等等的。\n\n不過我得要說這世界上根本不存在一出生就知道對的人事物在哪這種事情，而是你在有一個想追求的「抽象人事物」的過程，你慢慢勾勒出他的畫面跟摸索出一條路，最後「讓某個人事物成為你想要他成為的樣子」。\n\n除非有「外人介入」，例如社會制度告訴你讀書就對了，或有個富爸爸告訴你孩子不用擔心，家裡有礦、儘管去闖。\n\n舉個例子：\n\n長期來講你想要過上什麼樣的生活，有什麼樣的生活水平、型態、作息。以上就是抽象的人事物，想要坐擁豪宅名車精品，還是每天快樂出遊，還是簡單的家庭就好，還是可以舒服的追劇。這樣你可以大概知道自己想要什麼，只是不知道怎麼達到跟確切真正的樣子長怎樣。\n\n中期來講你需要達成什麼目標才可以過上你想過的生活。這就是勾勒畫面跟摸索路徑，例如你想要規律作息、work life balance  等等的，那就會大概知道有哪些工作很容易達到，哪種伴侶適合你。\n\n短期來講你有什麼事情是可以從基本開始的，或者是你有什麼不得不優先處理的。這時候你就有一條模糊的路出現，你知道想要賺大錢可能要考慮創業或炒股，你知道想要有穩定的生活可能可以選擇哪些職業，你知道一個最單純的家庭你伴侶大概該怎麼樣，你知道你如果這科被當就完蛋了。\n\n### 怎麼樣的生活是你滿意的？\n找到確切的目標很難，但想出自己覺得怎麼樣的生活是你滿意的應該很簡單吧。從零開始學習一個新技能很難，但把當下必須該做的事情完成應該很簡單，或者是一些微小的嘗試應該相對容易吧。\n\n列出短中長期的輕重緩急然後好好想想什麼能先做就去做，剩下都先不想。做完了你就做完了，想想下一個該做的是什麼然後就去做。累了就累了，該休息就休息，不累就繼續。\n\n時間久了你就會習慣這樣的選擇思考模式，就能在有意無意中做出當下最好的選擇。\n\n所有最好的選擇都是從過程摸索出來的，你真的真的不可能一開始就知道你這輩子最巔峰跟成功的樣子是什麼，但如果你不開始去找也不可能找到。最簡單的例子就是如果想要中樂透，你不可能不去買吧。\n\n反過來說如果要發大財你也不可能去買樂透，因為你應該要在分析的時候知道，買樂透的路上被車撞死的機率比中頭獎高。\n\n### 舉我自己的例子\n我一開始只想搞 Data 但發現自己數學不好，寫程式倒是蠻有趣的。後來去當助教打算累積各種履歷跟 project，結果發現寫程式真的有機會成為我最擅長跟想做的事情。\n\n後來只想去 Camp 賺賺講師費，結果認識很多厲害的工程師，他們也願意帶我，才慢慢嘗試進入這個業界。最後也是有機會轉正，才決定不考研究所直接工作的。\n\n所以簡單來說，在當上助教以前我都不知道自己要不要當工程師，在進入 Camp 當講師以前我都不知道自己要不要投入區塊鏈，在確定轉正之前我都不知道自己要不要讀研究所。\n\n實際上我也一直不知道自己真正要幹嘛，在校成績也很不好，也會擔心推不上研究所；寫程式也沒有像神一樣厲害，也會擔心非本科找不到好工作、被看不起；也會擔心區塊鏈會不會有一天爆炸，我就沒有專業了。\n\n> 但就是誤打誤撞的走到這裡來，努力的過程會慢慢消除疑慮，看清楚路，而且目前看來一切都是最好的選擇。\n\n### 結論\n如果覺得自己什麼都不會，一是無成，不知道自己以後要幹嘛。那就好好寫下大學四年的所有經驗跟審視自己的所有選擇，還有嘗試看看寫出短中長期，最少五年以上的輕重緩急人事物列表。\n\n你可能會發現你真的做到很多事情，學會很多東西。那這之中有沒有跟你的興趣、目標有所交集的，是你可以延伸發展的，有的話就不要猶豫了嘗試看看。\n\n當然過程中也有很多走錯路或錯誤的選擇，未來這些都是改進的方向。\n\n身為銅鐵但又想變成貴金屬的人，是最辛苦的人，因為看遍所有好的樣子，也看遍壞的樣子，無法屈就也無法釋懷，想要向上爬不僅受限於各種外在不可控因素，連要往哪走都不知道。",
    "date": "2024-03-03",
    "tags": [
      "社會課",
      "2023 十大精選文章"
    ],
    "isPinned": false,
    "textCount": 2243
  },
  {
    "id": "worst-choice",
    "title": "社會課｜看似合理但卻是最差的選擇",
    "content": "人類的下意識選擇通常不會太好",
    "markdown": "\n### 教育的例子\n前幾天跟 Molly 去信義誠品一起看書的時候，我正在書櫃迷宮中找一些清單上的待看書，這時候有一個小朋友開始嚎啕大哭，狂叫著不要不要。我們都知道小朋友就是這樣，你不順他的意就是會歇斯底里的咆哮，他媽媽也趕緊把他抱起來無奈地安撫他。\n\n他媽媽不像是會被公審的那種，放任小孩在高鐵、圖書館、咖啡廳、飛機追趕跑跳碰或放聲嘶吼、哭泣的家長，他臉上帶有一絲羞愧的臉色卻也無能為力。這時候我心想，如果是我的話會怎麼做呢？\n\n如果我直接賞小朋友一巴掌或打他屁股，如果我直接罵小朋友，或者我順從小朋友的意思（或許他想要拿到什麼東西？），哪個選擇是最好的呢，或許平行時空（未來）的我會選擇直接把他抱離，然後在不會影響別人的情況下教育（好好講）他不可以這樣？如果他已經懂事到聽得懂人話的話啦，畢竟如果是個嬰兒也沒辦法。\n\n> 我們都知道必須堅守原則，不能事事都順小朋友的意，以避免養出一個公主、王子\n\n華人社會的家長可能還會選擇在大庭廣眾下打罵小朋友，以證明自己有在教育他（教訓給別人看），但其實那一點用都沒有，我覺得這些家長在外面給小朋友難堪以及肆無忌憚地打罵其實都是造成雙重的反效果，一是小朋友可能會繼續大哭大鬧（這輩子沒看過有小孩被打之後是閉嘴的，不都是哭得更大聲嗎？），二是打罵的聲音不也會造成別人的困擾嗎？\n\n所以這種既達不到效果、單純做給別人或自己看，或甚至真心認爲這樣可以把事情改善，卻會讓事情更糟的行為，我稱作「看似合理但卻是最差的選擇」。\n\n### 婚姻的例子\n後來我在咖啡廳剛好跟 Molly 聊到這件事情，話題的起始點是他說他知道有一對夫妻的丈夫會一直出去應酬徹夜不歸，讓妻子覺得自己很像是單親媽媽。而問題就在這個丈夫是一個營造承包商，不可能不去應酬否則這間房子的貸款怎麼繳、兒子的學費怎麼繳呢？此時妻子的選擇是對著徹夜不歸應酬的老公破口大罵，這同樣也是一個 **「看似合理但卻是最差的選擇」。**\n\n理想的情況是夫妻倆好好坐下來談談怎麼解決這個事情，例如要不要轉換職業跑道、有人退讓接受之類的，但中年男子是世界上最難被說服的一群人，所以這個 solution 也只存在在理想上。這也攸關於你怎麼挑選一個好對象，因為一個好對象會在這時候跟你一起坐下來好好解決問題或者是選擇退讓。\n\n> 或說難聽一點，這個應酬是否是必要的，可否減少或者避免不必要的應酬，能夠在怎麼樣的情況下最大程度地顧及到老婆的感受，而不是讓一個女人感覺自己像是單親媽媽呢？\n>\n> 一個好對象該思考的是這些，而不只是不應酬的話就沒錢賺，因為賺錢的方式有千百種，在開始決定踏入這個行業之前兩人就必須先有共識未來的生活模式可能會是怎麼樣，這也算是廣義的「貧賤夫妻百事哀」吧。\n\n總而言之指著應酬的老公破口大罵是一個最差的選擇，因為不只是不可能會讓應酬這個選項不見，更會讓兩個人的談判從零直接變成破滅，還會讓未來每次談論這個話題的機會變得更加渺茫。\n\n就像在公共場合對還不懂事的小孩打罵一樣，不會因為老婆臭罵老公一頓就會讓他不去應酬，說不定罵著罵著老公甚至覺得那些溫柔鄉是一個避風港，甚至覺得開著車回到家之後在車上打上兩場傳說、抽跟菸再上樓是自己最後的舒壓途徑。\n\n### 選舉的例子\n另外一個我覺得很好的例子是：「罵自己的選民不投給自己是笨蛋」。\n\n這其實是大部分人（不只是政治人物）很大的問題，也是為什麼有的人官途（或在公司裡面的升遷）可以扶搖直上，而有的人即便滿腹才華卻一籌莫展。因為你選擇去得罪那個決定你未來的人，而不是解決問題。\n\n你去責怪你的主管沒有看見你的好、你的業績、你的能力而選擇提拔別人或加薪別人，其實就跟罵自己的選民不投給自己是笨蛋一樣不僅僅是於事無補，還會讓事情更糟。試想你是高雄市民聽見韓國瑜說高雄又老又窮會有什麼想法、聽見柯文哲說高雄是一個落後的地方有什麼想法。\n\n實際上從政治的角度（你的目的是當選、升遷）來想，去責怪有權力掌握自己當選、升遷途徑的，具有生殺大權的選民或主管，怎麼看都是最差勁的選擇。但大部分人卻會選擇這麼做，無論是一吐怨氣，或天真的以為這樣講可以「教育」他人讓他們覺醒進而覺得你是英才？\n\n回到第一個例子，這輩子沒看過任何一個小孩被打之後會從放聲哭泣變成默不吭聲然後點頭稱許你的教罵的。\n\n### 結語\n坐下來好好談談，找到問題的癥結點然後解決，這些理想的情況聽起來都很困難又過於天真，但要解決一個棘手的問題本來就不是下意識的把情緒發洩出來這麼簡單。因為人與人之間的相處有著各種天不時地不利的因素存在，最好的選擇其實是在事件發生之前預期到可能會有的問題然後避免。\n\n例如你預期到小孩在某些可能需要保持安靜的地方干擾別人，那你就不要帶小孩去那些地方；例如你們預期到如果有豐富業務性質的職業會需要大量的應酬跟酒局，那就在一開始不要擠身到這個渾水裡面。\n\n但這是比問題發生（小孩已經開始哭鬧）之後找到可行解決方法（抱離開現場）更困難的事情我想，畢竟如果有這番遠見那解決大部分的困難應該是易如反掌吧。\n\n所以這篇文最營養的部分其實是讓大家意識到這件事情（光是知道很多選擇看似合理但其實是最差的就很不錯了），在做選擇之前或者行動之前能夠多思考一下這個行為下去是否真的可以達到目的，你的目的是什麼。如果可以達到目標那過程是蹲的越低跳得越高還是立馬見效？根據過往的經驗或觀察達成率如何？是否足夠理性或合理？",
    "date": "2023-09-05",
    "tags": [
      "社會課",
      "2023 十大精選文章"
    ],
    "isPinned": false,
    "textCount": 2213
  },
  {
    "id": "impostor-syndrome",
    "title": "社會課｜冒牌者症候群",
    "content": "畢業焦慮和職涯規劃交織而產生的畢業生困擾",
    "markdown": "\n### 前言\n畢業焦慮來源可能來自比較，看著自己身邊的人非常優秀例如考上研究所、申請上國外學校、一出社會馬上就有不錯的工作，甚至看見他們含著金湯匙其實都會給自己很大的壓力。\n\n冒牌者症候群同樣也來自於比較，但更多的是專注在自己已經獲得一些成就但不相信自己或覺得自己不配，通常會有冒牌者症候群的人都已經擁有一定的收穫了，所以比起畢業焦慮算是相對好很多的困擾。\n\n最後職涯規劃算是一個挺好解決但看起來很難解決的困擾，畢竟一個人可以努力的事情非常多的時候就不會那麼焦慮，除非是以一張白紙（甚至廢紙）的姿態直接出社會當炮灰，但就算什麼都不會其實只要下定決心想要就業，能做的事情還是蠻多的，應該可以忙到忘記焦慮。\n\n### 畢業焦慮\n畢業焦慮好發在大四（如果是大三就有畢業焦慮那真的要恭喜你你是一個優秀且上進的好青年），通常在看見身邊的大家（同學）都已經：\n\n- 汲汲營營在準備托福或雅思（甚至已經考到），或\n- 補了好一陣子大碩準備考研究所，或\n- 修了好多好多跨領域的專業科目而且維持不錯的成績，很有可能（甚至已經）會推甄上，或\n- 準備延畢但是是因為有雙輔、交換、出國的完善規劃，或\n- 在實習或者有累積很多工作、競賽、Project 經驗之類的\n\n這時候你會發現自己什麼都不會，如果想做的又不是本科系的話就沒有學歷當護身符，考研究所可能也考不上或者距離考上遙遙無期因而無法下定決心。\n\n這邊直接附上解法懶人包：\n\n1. 尋找你崇拜或羨慕的學長姐聊聊\n2. 多跟你認同且不會潑你冷水的師長聊聊\n3. 在經濟狀況許可下盡力多嘗試\n\n實際上我覺得能解決畢業焦慮的方法很少，只能多跟任何能夠給你幫助又不會潑你冷水的人聊聊，其實很多時候焦慮來自於不知道要怎麼辦，你也不確定自己要什麼或者是你知道自己想要什麼但不知道怎麼努力達到理想的目標。\n\n所以最好的方法就是你去觀察身邊的那些你有點「羨慕或崇拜」的同學或學長姐，鼓起勇氣問他們、找他們聊天、約他們吃飯然後問一堆問題，其實大部分正常人應該都很願意回答你的問題或者跟你討論一些事情。\n\n其實多跟他們聊聊（尤其是不同領域、不同年紀，平常你跨足不到的那個圈子的那群人）可以幫助你很好的拓展視野還有找到方向。\n\n最後就是在時間跟經濟狀況允許下多嘗試，這時候如果沒有壓力就不要再出去玩或者做家教了，把時間拿去磨練自己跟多累積經驗吧。\n\n### 冒牌者症候群\n\n我身邊很多優秀的同學都會有冒牌者症候群，也就是明明自己已經很優秀了，例如：考上台大電資但覺得自己不配、找到實習了但覺得自己沒辦法 handle 工作內容、申請上了好的國外學校卻擔心自己無法適應。\n\n總而言之就是過往被打擊太多次，或者看見身邊的人很優秀獲得很多成就，導致自己的自信受損，進而沒辦法相信自己獲得現在的一切，覺得自己獲得的一切都是運氣好之類的。\n\n但我覺得與其強迫自己去相信自己夠格，以下的方法可以幫助你度過這段困境：\n\n1. 忙起來：你越忙你就沒時間去思考自己是不是不夠格，這也是為什麼冒牌者症候群好發在你開學前或者剛入職沒事做的時候，因為就是不夠忙才會胡思亂想。就算你真的距離這個位子的實力還差一段距離，你也會在忙碌的過程中慢慢補齊而獲得成就感，忘記冒牌者的事情。\n1. 你要抱持著，反正說不定過一陣子大家就會對你失望了，你不如好好把握現在的機會，做多久算多久，濫用這個紅利一天是一天。簡單來說就是你如果真的覺得自己會被淘汰，那你更應該趁你還在這個位子上好好利用資源！\n1. 去看看那些比你差的人：這聽起來或許不是一個好方法，但其實是一個非常有效的方法，當你一直往上看或者去追求巔峰，那你就越容易覺得身邊的大家都很厲害只有你很廢。但如果往下看，其實你很棒、你很努力、你達到目標了。\n1. 去記錄你的努力並且分享：我發現習慣覺得自己不夠好、不夠格、只是運氣好的人通常都沒有記錄自己努力過程、規劃、分享的習慣，例如寫文章、發文等等的（像我這樣）。所以你都會忘記自己一路是多努力的，別人也沒辦法透過你的「努力」來給你鼓勵跟真正的稱讚到你覺得自己被肯定了。\n\n推薦有冒牌者症候群的人可以去看我以前寫過的文章：[社會課 #11｜真正的謙虛](https://chihaolu.github.io/publication/article/how-to-be-humble)\n\n### 職涯規劃\n最後依照我個人的經驗，我算是非常不喜歡職涯諮詢師、人生設計或者生涯輔導這種服務或職業的，因為每一個職業，或者把視角拉遠說到每一個未來方向，都應該是一種非常不同的路。\n\n就我自己極度短暂但還蠻精彩的這兩年工作經驗，找到那個領域的老師或基本待很久的人然後跟他大聊特聊是最有用的選擇（是大聊特聊然後反芻，不是他說什麼你就信什麼）。\n\n簡單來說，年薪 2, 300 賣身跟年薪 100 追夢到底要選哪個，我覺得如果沒有嘗試過：「幹我也很不想，但錢真的太多了。」這種本斥但大滋味的人，根本沒有辦法理解那種選擇上的痛苦，更不用說給人意見了。\n\n當然我覺得一定有 10% 厲害的人真正有能力且願意給大家有效益的意見，這種人通常都是在一個領域靠自己的努力跟選擇達到一定高度的人，他願意分享做決策的過程還有一些通用但不是廣為人知的道理（畢竟大部分人都不是超高年薪、超讚工作氣氛場域或超優待遇吧），那我就覺得很棒而且很值得學習。\n\n所以簡而言之，我自己是不相信 90% 的職涯諮詢是有用的，更像的是這些人也不知道自己在幹嘛，就把一些聽君一席話、如聽一席話的內容講給大家聽。因為反駁的門檻太高了，所以大部分人只能「好吧就這樣吧」。\n\n多刷刷看 Linkedin、各種文章、分享影片、座談、訪問的內容，去看看別人這一路是怎麼走過來的，經過哪些努力、檢定，學歷、背景是什麼、受到哪些貴人幫助（在哪裡、如何遇到貴人的），其實是最有用的。\n\n所以 SOP 是：\n\n1. 找到厲害、值得學習的那個領域的人\n1. 找到他的 Roadmap，無論是看他的資料（個人網站、LinkedIn）、訪問或分享影片、甚至直接去跟他聊\n1. 分析並且學習，找到自己可以模仿或者參考的點\n1. 動手開始規劃你的路然後勇往直前，或者修正路徑，或重複以上流程",
    "date": "2023-08-29",
    "tags": [
      "社會課",
      "2023 十大精選文章"
    ],
    "isPinned": false,
    "textCount": 2545
  },
  {
    "id": "filter-by-ai",
    "title": "社會課｜什麼樣的職業會被 AI 淘汰",
    "content": "避免重複性，得尋找真實的意義",
    "markdown": "\n之前在學校聽一些相關的 AI 演講或者一些同學，都會舉手發問問是否某某某工作會被 AI 淘汰，很多工作會被取代是真的，但到底哪些職業會被這個劃時代的產物（ChatGPT）取代是有一個核心概念的。\n\n### 前言\n\n我覺得會被 AI 取代的工作有幾個特色：\n\n- 重複性高\n- 創意性低\n- 思考度低\n- 應變能力、反應能力的要求低\n\n所以最有可能被取代的工作就是文字工作者例如記者，還有不斷做著重複事情的人例如碼農。但其實並不是說「某個職業」一定會完全消失不見，畢竟工業革命到現在幾百年過去了，手工做的紡織品仍然是非常昂貴且有人買單，而沒有全部都變成工業化的遺跡（雖然 99.9% 的紡織工人跟家庭代工都消失了）。\n\n所以如果你是一個工程師，那你如果每天都是使用相同的 template 來接案或者交差；如果你是一個記者，每天只是在網路上搜尋一堆資料，發一些沒深度的問券或投票然後整理，變成一篇報導；如果你是一個商業分析師但其實你沒有真知灼見，只是靠著模板還有一貫的說詞來去把人唬得團團轉；如果你是一個作詞者但只是翻著押韻神器無病呻吟。那就會被淘汰。\n\n但記者有沒有很獨立思考的、工程師有沒有需要你自己設計且解決各種問題的、分析師有沒有很有真知灼見的、藝術家有沒有很有自己風格跟特色的？當然都有，所以重點不是「職業名稱」或「專業科目」，重點是「你的能力跟態度」。\n\n總而言之如果你想要靠著一招打天下，沒有獨立思考、沒有臨機應變、沒有處理危機跟困難的能力，不管是什麼工作最後都會被 AI 取代。\n\n> 其實科技進步就是這樣，人類推進科技的目的就是「把重複性、沒效率」的事情降低讓「時間」獲得最好的應用。\n\n### 文件、語言的處理、辨識、校正：搬運工最危險\n\n我自己認為最沒用、最該被淘汰的例子就是行政手續、文件處理、翻譯、寫 cover letter、follow-up 或一些繁瑣要注重禮儀的 e-mail。\n\n這種事情本來就不該花時間去琢磨一字一句，人與人之間的溝通就是在這些地方造成很多困擾，進而浪費太多時間。還有寫演講心得這種無聊的作業，以前要花五個小時來瞎掰跟琢磨的，現在用 GPT 5 分鐘就可以解決。\n\n### 互助，而非取代\n\n很多老闆說，他寧願花錢買 Bing AI 也不會去請一個台大管院畢業的學生，為什麼？我覺得大家可以想想把西裝脫掉、英文忘掉、畫大餅的能力拔掉、漂亮的簡報拿掉，你還剩下什麼？你的數據處理能力、分析能力、論述能力、甚至做美麗 PPT 的能力是否足夠撐起你的專業跟薪水，或許你跟 AI 的差距只差在他沒辦法穿西裝而你可以，剩下的你遠遠不如他。\n\n人工智慧的進步並不是為了取代人類，更多時候我們使用科技都是為了提昇生活品質、工作效率，被淘汰的一直以來都是甩手掌櫃、重複性高、沒有使用到你寶貴大腦的工作，所以我們如果學會應用科技、應用 AI，就像你第一次把蒸汽機放在紡織業上，就像你第一次下載英文辭典 APP 而把厚重的牛津詞典蓋上，就像你第一次使用 python 去對三千萬筆資料做回歸一樣。\n\n科技帶來的始終都是更多就業工作，以及更多的幫助，以前沒有蒸汽機的時候沒有那麼多人搞精密機械、沒有辭典 APP 的時候沒有人寫軟體、沒有 python 做統計跟商業處理的時候沒有文組會去碰程式語言。同時具有商管知識又會寫程式的人可以賺到很多錢，懂的精密機械同時兼備軟體知識的人可以賺到很多錢。\n\n而現在你要成為最善用 AI 的人才能夠花最少的時間做到最多的事情，不管是寫程式、做商案、處理資料、寫信、查資料、寫文案、尋求機會、製圖等等的，AI 即便不夠成熟到可以給你一個完整又完美的成品，但絕對可以給你一個很明確的方向或框架。\n\n而過程中你只要加入你的偵錯、專業判斷、修正調整、創意以及獨立的思考，還有「與同伴討論」，你就可以省掉超多時間，獲得一個很好的結果。\n\n> 科技進步會創造更多工作機會，而不會減少工作機會\n\n所以被取代的是不進步、沒有獨立思考應變能力的人，如果你總是在學習新東西、與時俱進同時擴展專業，找尋機會，那你永遠都是最前端的人，永遠不可能被淘汰。\n\n### 機敏資料\n\n最後給大家一個概念，AI 建立在模型上，模型建立在資料上，所以越難取得資料的行業在短期之內確實是越安全的，例如金融資料、醫療資料等這些我們都稱作機敏資料。通常沒有三把鑰匙跟印章以上，普通人甚至研究人員都沒辦法得到這些資料，更不用說最後拿到之前還要做一堆去識別化的行為。\n\n但我不認為醫療跟金融會完全與 AI 區隔開，反之如果銀行透過 AI 抓洗錢高度嫌疑帳戶，或者去分析信用是更可能發生的；醫療透過 AI 來做影像辨識「幫助」醫生找到肉眼沒注意到或看不到的息肉或潛在風險是更可能發生的。就是因為資料難以取得、模型難以建立，所以能夠建立與 AI 「互助橋樑」的這些行業就更值錢，因為普通人進入的門檻很低，只有醫療跟銀行最業內、最核心人士才有辦法動用權力去拿到資料做這些研究。\n\n所以我自己的預測是未來有機會能做到醫療人工智慧、金融人工智慧互相結合的公司，會是最賺錢的企業之一。\n",
    "date": "2023-08-15",
    "tags": [
      "社會課",
      "你的最佳職涯導師"
    ],
    "isPinned": false,
    "textCount": 2098
  },
  {
    "id": "get-your-intern",
    "title": "社會課｜實習面試大補帖",
    "content": "本文某些層面甚至能涵蓋到正職面試，包含但不限於科技業或工程師，我認為是很通用的一篇文章",
    "markdown": "\n公司裡的人資與主管並沒有你想像中的會面試人，如果不是技術考試的話基本上問題都大同小異，更多的都是問一些毫無意義的面試問題。\n\n所以準備好以下文章提到的內容且你的技術與經驗有一定基礎（不要太差或為零），那一定會通過初面或電面。除非你面試的公司都是靠走後門進去的。\n\n不過本文並不包含技術面試、白板題、演算法的內容，主要是一些很基本很基本的內容，如果大家有興趣我之後再專門做一期視頻講解。\n\n### 開始之前\n1. 次數次數次數：面試是經過準備的，你最好把本文提到的問題全部都寫下你的答案，然後背起來練習一百萬次。最好面過一百家公司然後反省改進，如果你在家試過一百萬次但沒有上過戰場，那都是紙上談兵。\n1. 了解你自己：你的所有學歷、經歷、優缺點、個性、想要什麼工作、哪些時候可以上班等等\n1. 熟悉面試進行方式：有幾關且主軸是什麼（背景對談、HR 面試、技術考試、談 offer），分別為團體或個人、線上或線下、面你的是誰（甚至可以去他的 LinkedIn 背景調查他）、你面的職缺的所有細節（開始準備前先把 JD 看完一百次）\n1. 面試禮儀：注意時間不要遲到、外觀修整、如何著裝（要正式還是輕便）、禮貌謙虛且自信地應答\n1. 外語：如果你要面的是外商公司或以外語進行面試，那當然不是準備中文就好\n1. 面試前一天睡飽、不要亂吃\n1. 去 Youtube、Ptt、Dcard、FB 社團任何地方查一堆資料然後整理起來，包含履歷怎麼寫，面試過程或注意事項、公司/職缺/業界評價或相關資訊\n\n> 公司在面試你的時候你也在面試公司，如果你是有能力的人那不是公司選你而是你在選公司（但請謙虛），他們會對你背景調查跟肉搜你，你也可以反過來肉搜他們（就像你肉搜你現任的前任一樣）。\n\n### 一、關於你自己\n\n不僅是對方該了解你是誰，你自己也得了解你自己是誰！\n\n- 你的履歷及輔助文件：包含但不限於中英文自傳（注意長度）、推薦信、個人網站、社群網站、作品集、證照或證書\n- 你的自我介紹：必須準備不同時長的自我介紹，且包含有意義的內容\n- 你過往作品及經歷的心路歷程：學到什麼、可以改進的地方、印象深刻的事情\n- 你過往的工作（相關實習）經驗：為何結束，如何進行，以及心路歷程\n- 你經歷過最大的挫折或者失敗經驗\n- 其它無用問題：你的各三個優、缺點，你的興趣、專長或國家文化\n\n#### 履歷及輔助文件\n該準備的都可以準備好可以隨時在對方提到或你覺得合適的時機遞上，至於怎麼樣做好一個作品集跟履歷網路上的資源已經很多了，這邊就不花篇幅贅述。\n\n需要注意的是：\n\n- 本土公司、外商公司、外國公司的履歷需求很不同，像是本土公司一定要有照片而某些外國公司如果有要求附照片是犯法的；本土公司會希望你有自傳，但外國公司根本不在乎你有沒有自傳，甚至覺得你在浪費他們時間提供太多無用資訊\n- 每一種職缺都特別設計符合這個職缺的履歷或相關文件，你要面試工程師就不要附上你的家教經驗\n\n#### 自我介紹\n當 HR 請你自我介紹的時候，你要著重的不是你一生的經歷或者某個與這個職缺無關的資訊。\n\n由於你不會知道 HR 給你多少時間自我介紹，所以你最好準備 1、3、5 分鐘的三種長度自我介紹，當你發現你講了一分鐘而 HR 沒有打斷你，那你就繼續講講到三分鐘，依此類推。像我自己是可以侃侃而談自己大概十五分鐘。\n\n- 一分鐘：\n    - 你是誰、\n    - 哪裡人（面試外國公司的時候可能要提到你的國籍、母語、時區），\n    - 學歷及專業、\n    - 簡單條列過去工作經歷或 Project\n- 三分鐘：\n    - 你從哪裡看見這個公司或職缺\n    - 你為何想要應徵這間公司或職缺，這是動機，很重要\n    - 你自身與這個公司或職缺有什麼關聯，例如你的專題、碩士論文、Side/Course Project 等等\n- 五分鐘以上：\n    - 你認為為何可以符合這個職缺或這間公司\n    - 過往的經驗或專業可以給這個公司帶來哪些價值\n- 七分鐘以上（以下內容偏危險所以要謹言慎行，如果沒把握就不要講了）：\n    - 你在尋找怎麼樣的公司，為何這間公司或職缺是你要的\n    - 你對業界的看法與想法\n    - 你對公司的看法與想法\n\n### Project 經歷\n這個部份屬於一定會被問的問題，例如你從過往的 Course/Side Project、商業競賽或者一些作品的過程中學到什麼、可以改進的地方、印象深刻的事情。這部分很考驗你到底是在團隊中混水摸魚或者擔任很重要的職位。我相信如果你真的有認真參與這個作品那就會有很多很多東西可以講。\n\n所以這個部分重要的其實是你平常就要多累積自己，你才有辦法根據不同的職缺列上不同的相關 Project，而不是要面試了才在苦惱沒東西能放。\n\n那如果你有超多 Project 或比賽經驗可以放，那就放你覺得最符合職缺的、最屌的、最多能講的那些。\n\n> 不要全部都放反而會模糊焦點，你提到的跟放上履歷的內容，都是一個又一個的 **陷阱** ，你要引誘 HR 跟主管去問你想要他問的問題。\n\n#### 工作經歷\n> 此部分也包含你在 xx 系學到什麼，所以如果你非本科系或者系名有點特別，可以多準備一下這個部分的問題。\n\n工作或實習經歷與 Project 經歷非常類似，盡量放上跟職缺相關、你能夠言之有物的內容。但我能理解這部分經歷很難累積，而且大部分人一輩子可能也才一兩個實習經驗，所以這部分我覺得是寧缺勿濫，不要為了讓履歷中的這一區看起來很好看而放上家教經驗或超商打工之類的無用版面。\n\n> 不知道要放什麼，不如放個人簡介、你修過哪些課甚至成績（與此職缺相關的）、履歷的 Summary。\n\n關於活動的頭銜我覺得見仁見智，例如營隊總召、社團幹部、志工等等的我覺得可寫可不寫，實際上一個立體的人更容易跟主管還有同事產生連結，同時也可以引誘面試官去問你相關的問題，讓你更有記憶點。不過不要過度膨風或者列出真的很瞎的就對了。\n\n> 你的經歷是死的，但這個經歷可以給公司帶來什麼樣的幫助，或者你學到什麼才是活的，所以你講完一個客觀事實（我在哪裡待過兩年），要補充主觀事實（我主要設計了三個 Breaking Changes，這期間用戶數提升了 400%）。\n\n這一部分更進階一點的問題是為什麼離開上一家公司，不過實習我猜應該不太會問這個問題，如果真的被問的話，你可以回答一個週期性的 Internship Program 結束了，你接下來想要挑戰更多、更新的機會。\n\n#### 挫折經驗\n許多 HR 也會喜歡問你有沒有失敗的經驗或者挫折經驗，可能覺得這樣問就能夠知道一個人的個性。不過簡單來說回答模板就是你有一個高低谷的過程，很好的例子是：\n\n1. 跨科系（轉換跑道或者跨足）一開始因為東西很難或者沒有同伴會很痛苦，最後成功跨足並且達到目標\n1. 商業競賽或者做哪些 Project 失敗，因為 blablabla，之後你因為改進、努力而成功\n1. 之前曾經獲得主管或師長給予的機會但卻失敗（可能因為能力不足或過度緊張），之後改進，有把握機會不讓給自己機會的人失望\n\n> 簡單來說就是一開始失敗，後來努力、改進、練習、反省，最後成功就對了。\n\n#### 無用問題\n我發現真的有 HR 會問一些沒意義的問題，所以如果有閒情逸致可以準備一下，順便練一下英文口說就是了。\n\n優缺點：\n- 優點必須跟職缺相關\n- 缺點必須要不痛不癢，例如你可能會害怕破壞開會流程而不敢在主管面前舉手發表意見或問題\n\n> 講完缺點最好講你正在做什麼改變，這樣就是變相在講你的優點\n\n興趣、專長或國家文化：\n\n- 如果不在乎錢的你會想做什麼：這時候你有沒有興趣或專長就很重要，就大方回答你喜歡的事情吧，不要矯情的說你還是會超想做這個職缺，聽起來有點噁\n- 我曾經被一間英國公司問對中國想要侵略台灣有什麼想法，還有介紹一下台灣文化等等的\n\n> 如果是那種單身嗎、結婚了沒、生過小孩嗎之類很白癡的問題，這間公司程度就這樣，就沒辦法囉。\n\n### 關於公司\n1. 如何知道這間公司或職缺：e.g. 推薦人\n1. 了解該公司的團隊配置還有業務內容（主力產品、客戶有誰、參與計畫、企業文化）\n1. 了解你應徵職缺所需的能力、需求（包含硬實力與軟實力、個人特質、上班時地、器材或工具）\n1. 你對這個產業了解的程度：你知道哪些公司、對產業前景的預期\n1. 你是否有同時應徵其他公司或有其他 offer\n1. 你還有什麼其他問題嗎\n\n#### 如何知道\n如果你有推薦人（後門）就在這裡講，不然就老實回答即可。\n\n#### 公司了解\n自己做功課。不要背稿去說幾年創立或肉搜老闆或面試官。\n\n#### 職缺所需的能力\n自己做功課。\n\n#### 產業了解\n自己做功課。\n\n#### 應徵其他公司\n可以說有，但不要提到其他公司的名子，一定要說同產業甚至同樣職缺，證明你是一個很知道自己要什麼的人。但記得要說你最想進的是這間公司，原因是 blablabla。這個部分一樣不要說謊，如果沒有就沒有，因為面試官通常面試過很多人所以會知道怎麼問可以知道你到底講真的還假的。\n\n> 某些時候甚至你顯示你有很強力的 offer 是一個重要的籌碼，如果你是一個人才那公司也不希望你會被別人搶走，他們反而會加快面試審核進度，或者是願意和你談更優渥的 offer。但不要太囂張或者驕傲，原則依然是謙虛且自信，不要膨風。\n\n#### 有沒有其他問題\n一定要有問題，不能說沒有。\n\n1. 你真的想問的內容（有意義、與公司或職缺有關的）就問吧\n1. 請對方建議自己哪裡還可以精進或者給自己這次面試的總結（謹慎使用）\n1. 詢問公司工作模式、勞健保、相關福利等\n1. 大概多久會得到結果\n\n### 關於能力與需求\n1. 你哪裡比別人厲害，你在這項職缺的優勢（包含軟硬實力）\n1. 面對當前的職缺需求，你還有什麼部分已經滿足，你是如何補齊的\n1. 面對當前的職缺需求，你還有什麼部分未滿足，你正在如何補齊\n1. 當前的就學狀況及課表，能夠如何配合公司（上班日、進辦公司日、遠距與否）\n1. 薪資期望（如果能談的話）\n\n### 其他可準備部分\n\n1. 模擬面試\n1. 履歷健檢\n1. 諮詢前輩或有相關經驗的學長姊\n1. 結束之後可以寄出 follow-up\n1. 反省改進\n\n> 前幾項可以寄信給我或者去找你覺得可以幫助你的任何人。\n\n#### Follow-up e-mail\n範本 Cited from [阿滴英文 - 應徵實習5大必勝秘訣 // 5 Tips to Get You That Internship，內容該怎麼寫或要不要寫見仁見智。](https://www.youtube.com/watch?v=eJysMvHrJW8)\n```\nDear CONTACT NAME HERE,\n\nThank you for taking the time to arrange my interview for the COMPANY NAME HERE internship program this afternoon. It was a pleasure meeting all of you and I truly enjoyed the talk we had.\n\nDuring the interview, I learned a lot more about the company's core value and what you are looking for in an intern, making me all the more certain that this internship program is a perfect fit for me.\n\nI'm very enthusiastic about the prospect of working as an intern at COMPANY NAME HERE, and I look forward to any follow-up on your program! If you need any further information from me, please don't hesitate to contact me by phone or e-mail. Thanks again!\n\nYours sincerely,\n\nYOUR NAME HERE\n```\n\n#### 反省\n最後，每次面試結束最好馬上就記下你被問的問題還有你的回答，你哪裡回答得不好或者是你覺得怎麼樣可以更好。\n\n想像你之後會給你的學弟妹或任何你身邊的人建議，他們會問你怎麼準備面試，面試的時候怎麼樣怎麼樣，你必須要能夠言之有物並且給出好的意見。這同時也可以幫助你成為一個更會面試、更能把握機會的人。\n\n### 結語\n很多人都是有能力有經驗但就是不會面試，其實是非常可惜的，很多時候面試錄取的人並不是有真材實料的人，而是很會推銷自己的人。\n\n最後歡迎大家分享這篇文！",
    "date": "2023-08-08",
    "tags": [
      "社會課",
      "2023 十大精選文章",
      "你的最佳職涯導師"
    ],
    "isPinned": false,
    "textCount": 5403
  },
  {
    "id": "teach-by-yourself",
    "title": "兔子窩｜學業教育很重要，但不是唯一重要的",
    "content": "受到社會光環加持的小弟我，常常是長輩們的諮詢對象。但要如何給予一個適當的「建議」是非常困難的。",
    "markdown": "\n### 前言\n大人常常以「限制小孩」為樂，在我眼裡都是在逃避自己不願意面對教育問題的事實。像是不能有智慧型手機、不能交男女朋友、不能玩電動玩具、不能跟朋友出門、不能出去住。\n\n我永遠記得國小的時候有一群同學玩得很開心的網頁遊戲，而我普通時候是不能玩電腦的，導致我跟他們完全沒話題。也記得上了小六要補禮拜六的補習班，所以再也沒辦法跟國小的好朋友去學校亂跑亂玩。很多有趣的事情我都不知道，甚至他們最後也都不找我了。\n\n### 學生的本分確實就是好好讀書\n我是非常理解「課業為重」這句話的，畢竟 **學生的本分確實就是好好讀書** ，這是無庸置疑。但不代表人活著只要好好讀書，而是要知道自己想做什麼。我覺得更重要的是，你的人生有很長，學的不是怎麼逃避誘惑，而是面對誘惑。重要的不是偷偷摸摸，而是學會自律。\n\n上了大學/高中，一解開封印就跟打開籠子的鳥一樣。更不用說工作的時候偷玩手機，偷逛網拍，偷偷聊天。該做的事情沒做完，就想著要下班或出去玩。在我眼裡都是 **沒有學會面對誘惑** 的例子。\n\n我想給這些沒好好思考過的婆婆媽媽一點當頭棒喝，告訴他們在準備重考的那一年想遍了各式各樣自己適合的職業還有興趣。想過要不要豁出去當個職業樂手，或者是朝電資前進，還是乾脆隨波逐流拼個幾年衝醫生。\n\n但他們不會在意你做過什麼權衡還有評估。他們只會告訴你「考醫生」就對了，可悲的是不是每個人都想當醫生， **更不是每個人都可以考上醫生** 。\n\n對我來說真正珍貴的是「做決定的過程還有想法」，考到什麼好學校充其量就是風光放榜後的那幾天，但人生會面對無數個跟考試完全不同的選擇。甚至沒人保障考上台大可以年收多少，或有好工作呵呵。\n\n我記得在第一次指考放榜那天早上，我跟我的好朋友都很後悔加入熱音社，沒好好讀書把時間都花在「世俗的玩樂」上面。所以才導致考不到一個滿意的成績。過了一年，我的好朋友走的那天我意識到： **「老天，謝謝你讓我誤打誤撞進到熱音社，讓我可以跟我的兄弟每天在一起做任何有趣的事情。」**\n\n這時候我就在想，或許重考了一年根本沒什麼，或許把時間都丟給熱音根本沒什麼，反正當初也只是閉著眼就射中機械系。重考或高三這段時間，重新正視自己真的想要投資四年，把人生最精華的時光放在什麼上面真的很值得。\n\n但對那些婆婆媽媽來說，經濟系甚至不是一個很好的選擇，最基本前面還有一個財金系卡著。但我不在意，如果我跟他們的思考邏輯一樣那我的人生可真的糟了。\n\n### 有更重要的事\n我可以說是「十分不喜歡」以限制小孩什麼東西以換取「成績」的做法。我當然可以理解每個小孩都跟猴子一樣，只要沒有很注意可能就完全無心課業，但成績真的是最重要的事情嗎。無心課業真的是你「自以為的那些學生毒品」造成的嗎。重要到為了成績可以犧牲一切嗎。可以限制到幾歲，等他四十歲還要幫他擦屁股嗎。\n\n或者說，當你在抱怨你高中的女兒只會追劇不知道怎麼交朋友，當你在抱怨你大學的兒子半年不回家，當你在抱怨你大四的女兒沒交過男朋友，當你在抱怨你讀資工系的兒子不教你用手機的時候。有想過或許你從來沒有好好陪他說過話，問他他喜歡什麼，他的好朋友都在做什麼嗎。\n\n或許很多事情他的同儕在小小年紀就略知一二，而有一個更不同的眼光，更不同的交際方法來看向這個世界。\n\n> 因為這個世界上有很多事情現在不做，以後就沒有機會做的。\n\n你十八歲可以割雙眼皮，給你最喜歡的男生看，誰會等到四十歲割給一個老頭看。你大學可以跟同學去夜衝、夜唱、環島，誰要四十歲的時候每天被孩子卡著不能出門。你高中可以玩一堆社團，跟你的同學在相簿裡留下一堆好笑的影片跟故事。為什麼要等到四十歲才在臉書社團徵一些毫無熱情的人一起？\n\n> 我們有很多回憶現在可以一起創造，為什麼要等到人死了才要哭哭啼啼得說很後悔當初沒怎麼樣。\n\n我不懂為什麼要那麼短視近利，如果只想從我的嘴巴裡聽見，要我建議小孩去補全科補習班，去考私立高中的資優班，去先修一堆微積分什麼的課程，那可以省下來了。我能理解這些課程有他存在的意義，但我從來沒看到一個家長 **真正拿出一張白紙，鉅細彌遺的在上面寫下「做」或「不做」的好處與壞處，成本還有收穫。**\n\n真奇怪，你當初就沒有成功了，真的以為自己現在回來應付教育制度還會成功是什麼邏輯。孩子的起跑線才不是什麼先修班，是家長本身好嗎。\n\n看到一些小朋友因為考九十幾分被打，沒有 5A++ 就得擔心以後是不是沒救了，要怎麼樣處罰、督促才可以讓他「有所長進」。其實我想的是， **他有這樣的爸媽就已經是最大的處罰了。**\n\n還有希望我說服你小孩不要交男女朋友，不要碰電動玩具，拜託真的閃一邊去。因為我不想成為你小孩長大埋怨的對象。你小孩沒考上醫生是不是補習補得不夠我不知道，是不是手機玩得太多我不確定。但他不跟你分享人生絕對是你自己的問題。\n\n看到這篇文的話，少看一個小時韓劇不會死，少工作一個小時不會死。把你的小孩從書桌抓起來，問他有沒有喜歡的人，那個人有不有趣，他們有什麼發展。或許他的人生還有你們之間的關係就不會那麼悲哀了。\n\n",
    "date": "2023-08-04",
    "tags": [
      "兔子窩"
    ],
    "isPinned": false,
    "textCount": 2077
  },
  {
    "id": "inspect-your-lover",
    "title": "廣寒宮｜短時間看清一個對象的三種方法",
    "content": "從一段短短的旅程，或許可以看出未來 60 年的人生會長怎麼樣",
    "markdown": "\n> 這篇文做為這個系列的第一篇可以幫助大家在極短的時間內看清一個人，而不需要十幾年的相處才發現原來對方是這個樣子。當然這些判斷都有一定的誤差，不過從我個人利用起來的經驗來看，十之八九都不會判斷錯誤。當然這些方式除了 judge 別人或者是看清他人，其實也可以很好的用來了解自己，畢竟每個人都不是完美的，面對不如意也都會有負面情緒跟做出不好舉動的可能。所以觀察別人的同時，順便檢討一下自己，讓自己成為更好的人我覺得也很不錯。以下的方式不只是可以看清楚對方面對不同人事物的反應，更可以看出對方的價值觀以及真正的個性。\n\n### 一、旅遊\n#### 旅遊為什麼可以讓你看清與一個人相處未來的樣子？\n因為旅遊很像人生，或者說人生其實就是一場很長的旅程。從各種計畫，你有各種金錢以及時間（尤其是時間！）的預算需要兩個人一起抉擇。每個人都有他們想要去的地方、想要吃的東西，同時也有非常多對方喜歡你不喜歡（或反之）的人事物，那你和你的另一半願意怎麼配合、討論、退讓，絕對會在未來體現在你們生活中的每一個角落。\n\n此外旅遊的時候你們兩個是 24 小時都在一起，不僅僅是出去玩，吃喝拉撒睡你們也都逃不過對方的眼睛，許許多多生活的習慣也會因為時間拉長而無所遁形，因此這個旅遊是很好審視對方的機會，當然也是你被審視的機會。\n\n#### 發現不合之後的第一件事\n然而旅遊的結果一定會發現有一些地方不合，不管是大吵架、小不爽、不耐煩還是覺得無奈，總而言之你們兩個本來就是不同的個體，有不同的經歷背景、經濟水準、生活習慣、價值觀還有興趣喜好。如果發現不合的重點是討論，是改進，不是吵架，不是分手，不是批評。\n\n#### 我的缺點\n我覺得我是一個不錯的旅伴，雖然有很多東西不吃而且有很多東西沒興趣，但說實在的如果太誇張沒有到很大我就不會要求很多，同時該花錢部分也是毫不手軟、不會斤斤計較，某種程度上甚至是非常非常慷慨。然後又非常耐走，體力非常好，出去玩的腦子也很清楚，方向感跟旅遊常識都在水準之上。\n\n但我覺得我的缺點就是很多事情心裡有想法但沒有表達出來，一開始妥協，但事後會小小抱怨，不會是那種大爆炸或者是賭氣，但就是會碎念或者突然拿出來講。這個部分可能是我以後需要在安排行程的時候就要提出來的，盡力的提出自己的想法，不要裝乖或者覺得自己一定可以忍耐住之類的。\n\n同時有一部分也是自己沒有做好很多功課，例如想吃什麼或者想去哪裡，導致關於自己的旅程比較少，就會覺得好像沒玩到，但其實我自己也沒有提出很多想法。\n\n### 二、打牌\n再來我覺得打牌也是一個很好看清一個人的方式，最好是那種技術與運氣兼備，同時還要有賭前的遊戲，例如麻將就是最好的例子。\n\n牌局這個東西充斥著運氣與實力（根據遊戲的不同），一個人在經歷人生時其實也是運氣與實力，不管是考運、貴人運、偏財運，還是天賦或你出生的家庭都是運氣，那你多努力、多會經營人脈、多會讀書或培養專業能力、多會管理時間跟安排企劃之類的都是你的實力。\n\n一個人如何面對人生的所有不順遂其實都會體現在這場牌局上，不只是你最後是贏還是輸，快樂或者不快樂，都是你在排局上的總總體現的結果。但其實重點不是結果，因為一場一場的牌局只是一個短期結果，就像你創業失敗五次不代表你第六次一定會失敗；你高中考不好不代表你大學一定會考不好一樣，每一個小結果都只是用放大鏡去看人生，不需要因為結果而論定人生一定怎麼樣。\n\n但是，面對失敗或者不順利的結果，無論是什麼原因，不管是運氣還是不夠努力，還是你沒有有錢的爸媽，重點是你怎麼去面對這個結果還有處理這個結果，讓你在下一次面對同樣的處境時不會再次失敗。\n\n更重要的是你看見其他人贏錢，尤其是用絕對的運氣或實力贏錢，那你的反應是什麼？其實人生就是充斥著運氣，可以說你有有錢的爸媽成功的機率就是別人的一百倍以上（絕對沒唬爛，以後我可以寫一篇文講為什麼有錢人更容易成功）。但我們都知道努力其實也占據很大的成分且我們大部分人都不是有錢人對吧，所以面對那些運氣好的人我們該怎麼做呢？\n\n這時候打牌就會體現一個人會怎麼做，有人會生氣、牌品不好、怪東怪西（例如怪後面的人把手靠在他的椅背上之類的）。此時此刻就是你觀察一個人的好時機，有的人面對失意或者運氣不好時會一笑置之，知道這是非戰之罪下次再努力。但有的人久久無法自拔不斷沉浸在前幾次的失敗裡面，甚至把氣出在別人身上。\n\n這些一切的反應跟行為，都會體現在未來人生他面對相同類型事件的反應上，例如他被裁員或者是找不到工作，就會責怪身邊的人沒有幫助他或者給他帶來厄運；例如他獲得很大的成功就會自滿、花錢如流水等等的。\n\n### 三、喝酒\n最後一個我覺得很好觀察別人的方式就是喝酒，例如一個人會不會在喝酒時克制自己。\n\n其實我們都知道越能延遲享受的人或者越能控制欲望的人越容易成功，這是不變的定律，那一個人是否了解自己在喝酒之後的狀態同時能對未來的自己進行克制，其實就很好體現這個人的人格是如何。例如會不會造成別人的困擾，在喝醉之後會不會要人擦屁股，以及會不會分辨危險的情況，還是為了放縱自己就絲毫不顧任何事情，放手去喝？\n\n在我遇過那麼那麼多人的情況下，成功的企業家或者優秀的同學酒品都很好而且不會喝醉，不會喝醉的意思是會克制，而不是酒量很好的意思（當然你知道自己酒量比較好就可以喝比較多）。他們都不會造成別人的困擾，永遠都是送別人回家或者是照顧別人、瞻前顧後、注意安全的那批人。\n\n而會喝個爛醉當甩手掌櫃倒在路邊狂吐的人，通常處理自身問題還有交際問題都有很大的問題，不管是一直跟豬朋狗友或者很糟糕的另外一半在一起，或者是規劃自己的人生、資產的時候都有很多錯誤的選擇。",
    "date": "2023-08-01",
    "tags": [
      "廣寒宮",
      "2023 十大精選文章"
    ],
    "isPinned": false,
    "textCount": 2320
  },
  {
    "id": "bear-or-not",
    "title": "社會課｜生小孩的決策樹",
    "content": "你的小孩能夠再給你一次機會「長大」，同時找回你遺失的東西",
    "markdown": "\n> 生不生小孩需要謹慎思考，很多好處、很多壞處，但不是一無事處，端看你想要的生活是怎麼樣。本文會總結生小孩的好處跟壞處，是否要有小孩是自己的事情，不應該插手其他人的抉擇。\n\n### 隨著成長，遺失的那些東西\n#### 缺失的快樂\n每個人隨著年紀變大，經驗漸漸豐富，無論是看過的人或者經歷過的事情越來越多，一個人要獲得快樂也越來越難。大家可能會慢慢發現長大之後，吃大餐並沒有像以前那樣開心，至少沒有小時後突然來了一餐麥當勞開心，而上了高中、大學，麥當勞卻成為完全不知道要吃什麼的最後選擇。\n\n但當你看著自己的小孩吃著麥當勞時，他由心底散發出來的快樂，卻能夠連帶著讓你也感到快樂，你能夠在社會的冷漠、成長的平淡中獲得一絲溫暖，就來自於小朋友單純的笑。\n\n放大格局的看，小時候的那些夢想，無論是買大大的房子、很酷的車子，還是做著天馬行空的白日夢，編織的過程總是很快樂，但隨著現實打擊、看清自我、社會鐵拳、年老色衰，那些期望卻成為一個人不快樂的源頭。\n\n很多生小孩的人都說過看著小孩開心，自己就能被感染喜悅，或許生了小孩就能讓自己更快樂，不過被小孩感染情緒代表同時也會被感染悲傷，幸福加倍，痛苦也會加倍。\n\n#### 存在的價值\n許多人下了班以後沒有事做、沒有興趣、沒有朋友，總是躺在沙發上看沒營養的東西，但有了小孩之後會讓你的存在出現價值，而不是不知道自己活在這個世界上是為了什麼。\n\n不過我猜這個原因對大部分來說並沒有意義，或許大家已經找到自己的價值或想做的事情，有了小孩只會讓你離夢想越來越遠，無論是世俗的買大房子或者環遊世界，或簡簡單單的在假日能夠放鬆出去 chill，這些權力都會被小孩剝奪。\n\n所以為了小孩找到自己存在的價值我認為不是一個好選擇，你應該是先認為生小孩並且把他養育好是你的價值，再去生可能比較合乎邏輯。\n\n我認為生小孩可以使一個人從好變更好，或從普通變好，但不會讓人從不好變好。所以許多女生或男生覺得生了小孩之後，會讓另一半變得愛家或者成熟，這純屬無稽之談，一個人是否會負責跟努力從前三分之一的人生就塑造好了，生不生小孩已經無法起到影響。\n\n### 你的目標有沒有包含小孩\n\n> 人都是自私的，包含生小孩也是，更遑論生育反而是為了整個族群的未來著想，要直接了當地定義生小孩是自私的有點偏頗。\n\n#### 證明自己\n有的人在決定是否生小孩時會思考，自己可以給他爸媽沒給的，可以把他教成更好的人，而不是像自己小時候討厭的師長那樣對小孩。不過卻有一半以上的人最後會變成自己討厭的樣子。\n\n這個理由同樣屬於你應該在生小孩之後就做到，而不是為了自己的私慾（為了證明什麼而拿孩子當試驗品）。更直接一點地說，如果一個想要生小孩的父母沒有把這些事情（不要重蹈覆轍你小時候那些師長的錯誤）當做理所當然，那根本不應該生小孩。\n\n#### 傳承\n其實客觀來看，撇除掉經濟因素，不想生小孩的人的個性特質比較沒有野心、比較沒有事業心。我發現很想生小孩，甚至想要生很多小孩的人除了很愛小孩之外，也都更有野心，因為希望可以傳承下去，甚至期望他青出於藍。\n\n所以傳承可以是一個很好的原因讓你擁有小孩，但不是每個人都很愛小孩或者很希望培育出接班人，更多的人在 21 世紀只想要把自己搞好，或甚至連自己都顧不好。所以關於傳承這個因素也只屬於少數人。\n\n#### 看到別人有，你（或你爸媽）也想要\n這個理由我覺得是很合理的理由，雖然他乍看之下很荒謬。實際上有房有車、五子登科的這些理想，不都是因為你（或你爸媽）想要嗎？所以或許我們目前為止做過的所有努力除了讓自己溫飽不要當啃老族之外，最大的理由就是你對自己有抱負，或甚至你有你想追求的東西，更準確一點是：想要的東西。\n\n而孩子當然也可以單純的成為你想要的一個東西，你想要有一個可愛的小孩可以玩是一個看起來很白癡的理由，但我認為這是一個很棒的理由，因為如果你看見其他人的小孩，你也會想要玩，那你要怎麼說你不喜歡小孩呢？\n\n甚至你想要他陪伴你，你希望在你老了的時候，老伴走了之後有一個人可以幫你簽手術同意書，可以做為你的緊急聯絡人。\n\n世俗一點來看，如果你爸媽想要含飴弄孫，你是否要完成他們的期望呢？這個部分見仁見智，有的人希望可以盡量滿足爸媽的願望，有的人覺得自己負擔不起或者這個東西實在太過於不實際（無論是心力不足還是成本因素）。\n\n總而言之大家需要謹慎考慮（或甚至早就知道了），一個可愛的小孩固然很棒、那些童言童語或者行為很有趣，但同時也會是一個惡魔跟負擔，很重的負擔。\n\n#### 你的小孩能夠再給你一次機會「長大」\n總而言之，你曾經在童年對你爸媽或老師給你的教育，或他們任何的作為感到厭惡，你那時候腦子裡有千萬種更好的處理方法，千萬種更好的路能走上。直到你長成了大人的樣子，你卻已經忘記那時候的感覺，曾經你在求學時期對於制度的憤世忌俗，曾經你在青少年時期對於在上位者的厭惡與他們的傲慢，你都忘記了。\n\n然而現在你卻已經不在乎了，考試制度、教育制度、與同學相處的過程對你來說已經完全沒意義，但實際上許多心態與觀念是你仍然要具備的，你必須要對這個世界充滿質疑還有挑戰，或許不再是橫衝直撞，但你必須要保持著那份年輕時的衝勁。還有與身邊人感同身受的能力，而不是長大了，學會只向錢看之後，用分數跟薪水去評價任何人，包含你的小孩。\n\n你該長大了，你的小孩的童年是獨一無二的，你童年時候爸媽跟老師們沒有做好的，你能夠做得比他們好，並且你也能獲得收穫。\n\n### 自己夠格成為父母嗎\n最後，比起生不生小孩，先問自己有多想把自己的人生過好，你是不是一個有責任感的人，有經濟能力的人，有抗壓性的人？你的另外一半是不是這樣夠格成為一個父母的人？",
    "date": "2023-07-25",
    "tags": [
      "社會課"
    ],
    "isPinned": false,
    "textCount": 2330
  },
  {
    "id": "how-to-be-humble",
    "title": "社會課｜真正的謙虛",
    "content": "給你機會的人不會希望他們期待的人是個廢物，所以你不該自卑，而是該感謝",
    "markdown": "\n「哇你真的很厲害欸！」\n「沒有啦，我很爛！」\n「沒有啦我說的是真的！」\n「哪有，運氣好啦！」\n\n### 自卑同時自傲\n大家會不會常說自己很爛、很廢，別人稱讚自己的時候會下意識說自己其實很弱之類的呢。一方面是因為華人社會會講求這是謙虛，一方面是 EMO 的時候是認真覺得自己跟前面的人比很爛，而這篇文就是希望大家不要再「過度謙虛、自怨自艾」。\n\n這在我身邊是一個非常常見的現象，通常我認識或知道自卑的人都是因為比上不足，又想積極的往上爬，然後又表現的不是到最好（但其實綜觀全體還是很不錯的層次）才會覺得自卑。也就是這一切來自於對自己的不滿意。\n\n> 但這篇文不是叫大家要知足或滿意，因為不知足才是一個人向上爬的最大動力。\n\n這種 PR 介在 70 到 90 的人們自卑的同時還會自傲，因為會覺得後面的人就是不努力，或者是因為家裡有錢就不需要努力，而覺得「部分」前面（90 甚至到 100）的人是因為背景好或者運氣好之類的。這些人自傲的來源不是在他們本身就是個性驕傲、自視甚高、羨慕嫉妒，而是來自於懷才不遇。\n\n越上進的人，越有這種情況。\n\n### 最典型的場域在工作\n給你機會的老師、前輩、主管不會希望他們給予機會的人是一個廢物，當你獲得了一個連自己都不敢相信的機會或稱讚時，你要著重在於「如何讓自己配得上這個機會和稱讚」，而不是一直貶低自己、心虛、過度謙虛，甚至在公開場合直接了當的貶低自己。\n\n這個道理很簡單，反過來想如果你是主管或者前輩，你會希望你給予機會、期望的人是這樣子的人嗎？也就是你跟大家介紹這個年輕人很優秀時，他居然說沒有啦自己很爛，那你是不會有一點沒面子呢？\n\n當獲得機會跟稱讚時，你代表的是一間公司、一個組織，如果你過度貶低自己其實是在給這個群體、給這個給你機會的人蒙羞。\n\n> 對方給你機會是真心覺得你值得這個機會，而不是「不嫌棄、將就選一個、從垃圾堆裡面挑一個」\n\n大家都知道你是在謙虛，也知道你沒自信，所以會給你鼓勵或者安慰你。但其實過度地謙虛、沒自信這些事情真的會讓你獲得的信任跟機會變少。\n\n### 不只是工作，在感情上也是\n其實大部分人都會覺得自己不夠好，例如容貌焦慮、背景不好、學歷不夠、薪水不高之類的。這些不夠完美是真的，但如果覺得自己不夠好，那就要努力讓自己配得上更好的人，或能夠配得上你的對象。不管怎麼樣都不可以「自怨自艾」，因為這樣會讓給你機會的對象覺得自己選錯人了。\n\n很多時候對象並不在乎你在乎的點，例如長相不是典型的天菜，或者薪水、家庭沒有像某些同儕一樣高端。或許周遭會有些人說閒話，而且確實會影響你們之間的感情或者你們兩個的心情，也很重要（所以我並不是要你完全無視）。但你要做的並不是真的覺得自己很爛然後毫無作為而是要「努力改進跟變好」，你這些自卑很容易讓你們之前產生爭吵、吃醋，還會導致你的對象很沒面子。\n\n> 結論就是與其有時間覺得自己不夠好，不如花時間讓自己更好。\n\n### 你的謙虛對其他人是一個傷害\n設想一個例子，如果別人稱讚你考上台大很厲害，月收二十以上很厲害，那你回答他沒有啦，自己還不夠厲害，自己其實很爛之類的話，那對方的心裡會怎麼想呢？\n\n或許大部分的人（長輩或同儕）並不會把這些話放在心上，也許他讀的是高職沒有讀大學，更有可能是他工作了三十年月薪只有幾萬而已，但你說的這些話其實從某種程度上來說不只是貶低自己，甚至是貶低別人。\n\n這樣想起來可能會覺得說話好難，到處都要汲汲營營的說出對的話（不過出社會本來就是這樣，有的人就是很在意這些說話跟處世的眉角）。所以最簡單的方式就是懷著感恩的心。\n\n> 面對別人的稱讚或給予機會，你過度謙虛是在否定對方，這樣會讓別人覺得你不領情\n\n### 謙虛但不自卑，自信不自矜\n所以別人稱讚你、給你機會的時候，你到底要怎麼回應呢？其實不只是好好的回應對方的稱讚，不讓對方感到不舒服，同時也要避免一來一往尷尬的場面。\n\n其實我以前也是一個過度自卑同時又過度自傲的人，別人說我很好、很厲害、很優秀的時候我都會回覆的有點自卑之類的。但現在我改變了這個壞習慣，現在跟各位分享別人稱讚自己時該怎麼回應。\n\n#### 零分回答：\n\n- 「我很爛啦！」\n- 「沒有啦！」\n\n#### 三分回答：\n\n- 「運氣好啦！」將成功歸納於運氣是一個不錯的謙虛習慣，但比較適用於自己講自己的功勞時（主動與別人分享）來搭配使用。如果是別人主動稱讚時，你被動回覆的話，那不是一個太好的回答\n- 「OOO（通常是主管或對方）不嫌棄啦！」還是覺得自己不好的回答，但是有間接感謝別人，所以算是非零分回答\n- 想辦法轉移話題或延伸其他話題是一個不錯的選項，如果你真的很擔心怎麼回，或者在對方面前講錯話很危險的情況可以嘗試\n\n#### 五分回答：\n\n- 「謝謝 OOO（對方的稱謂，例如老師）」直接了當的稱讚是最安全且保險的牌，不過需要注意有的人並不是真心稱讚你，所以你欣然接受的話對方會覺得哇你怎麼敢的（世界上就是有這麼多心機重的人）\n- 「你也很不錯呀！」將這個稱讚，反過來稱讚對方。大家會覺得這是一個很棒的回答，但其實在某些人眼裡這樣做很矯情，也沒有善用這個應答\n- 「那是當然！」、「哇，嘴巴太甜了吧！受寵若驚」、「過度稱讚了吧…」、「我要把這段話 Po 到限動上」這種自嘲式的應答某些時候還不錯，也可以產生奇效，但要看人，如果是交情不錯可以這樣回，如果陌生對象就盡量避免\n\n#### 七分回答：\n\n- 「被你這麼厲害的人稱讚未免也太榮幸了吧！」這個情況我覺得很適合用在你想熟但還沒熟的對象。這個回應的目的在於，因為對方是個很優秀、更棒的人，而對方稱讚我那我「真的」感到很榮幸、很開心。這時候對方可能會開始說「沒有啦！」之類的話，那尷尬的情況就丟給對方了（偷笑）\n\n### 我自己主要使用兩個滿分方法妥善回應：\n\n- 感謝給你機會的人：例如教授、主管、Mentor、或其他「真的」給你幫助的人，不要說什麼感謝你爸媽、另一半的支持之類矯情的話，那只會讓人覺得你很不真誠。你能達到這個成就除了你努力的部分，最重要的就是給你機會的人，沒有他們你爸媽給你一打金湯匙都沒用。\n- 稱讚一起努力的人：「多虧 OOO（通常是同事或對方）啦，幫我很多！」稱讚你的同事或同儕也很棒。第一是顯得你很注重團體，第二是你有看見所有人的努力，第三是你是一個願意分享功勞的人。\n\n其實不管怎麼樣，接收完稱讚都盡量把話題轉移掉或延伸走，才不會導致很尷尬的情況。",
    "date": "2023-07-11",
    "tags": [
      "社會課",
      "2023 十大精選文章"
    ],
    "isPinned": false,
    "textCount": 2649
  },
  {
    "id": "202306-tokyo",
    "title": "兔美旅行團｜202306 東京",
    "content": "睽違八年出國（結果又是去東京嘻嘻），記錄一下",
    "markdown": "\n### TL;DR\n1. 坐 UBER 很爽，比台灣貴但就是爽！如果行李很重然後路途超過十分鐘的話建議直接叫。在台灣用過可以直接在日本用，完全不用重新綁卡或填資料註冊，就是直接叫然後坐上車就對了，也不用跟他問答之類的\n1. 超商/超市的東西還是跟鬼一樣好吃，尤其是炸熱狗跟炸雞串，還有醃漬物、起司、生火腿們真是完美下酒菜\n1. 沒有做過功課的餐廳（不是小店或者路邊攤，是餐廳）盡量別去，我自己覺得這次去日本沒有第一次去那種震撼感，餐廳類的東西沒想像中好吃\n1. 東京廣遊券（Tokyo Wide Pass）很讚、超級划算，如果臨時想上廁所還可以直接刷進去 JR 上。BTW，如果要用廣遊卷搭新幹線或特快車的話，進站的時候要先用廣遊券進站，然後再廣遊券+劃位車票（兩張一起）進鐵路站（總共會刷兩個閘門）。買廣遊券的時候護照刷不過（説 IC 晶片無法讀取），但其實是那台有問題，換一台就可以買了\n1. 日本的樂器行並沒有傳言的那麼好，這次去了兩間服務態度屬於天差地遠，一間會問你要不要買才給你試琴（雖然我最後還是沒買），另外一間態度極好（Bass Collection），從網路上看最後沒去的那間（IKEBE 池部渋谷樂器村）評價也不是很好。但東西真的比台灣買或者網購便宜很多\n1. Outlet 超爆幹便宜，義大 Outlet 同一個 Coach 包要台幣 17000，輕井澤 Outlet 折合台幣 7000 多，有需要記得要買\n1. 這次是用 ESIM，蠻舒適的，不管是在哪裡網路也都蠻穩的（一天大概用 0.5~1G）\n1. 回程坐飛機的時候記得洗面乳不要放在手提行李裡面，我就是那個白癡==\n\n### 6/15\n一路衝：\n- 台北車站 → 桃園機場：機捷\n- 成田機場 → 京成上野：Skyliner（成田特快排隊很長）\n- 上野 → 六本木：東京 Metro\n\n六本木（都在飯店旁邊）：\n- 晚餐：六本木交差點 Afuri 拉麵（真的好吃）\n- 松本清（六本木這間不能退稅，但還是買了很好用的維他命 C 洗面乳）\n- 711 + 全家：買了一堆超讚的醃漬物、泡麵、啤酒\n\n飯店：remm hotel 六本木\n\n### 6/16\n六本木：\n\n- 早餐：711（簡單的東西也很好吃）\n- 六本木之丘、朝日電視台、毛利庭園（都蠻無聊的）\n- 午餐：六本木敘敘苑（在飯店樓下，當然是點最頂的再單點，好吃，我覺得便宜）\n\n \n六本木 → 江東區：東京 Metro + 私鐵- \n \n- teamLabPlanets 光影展（還蠻不錯的）\n\n江東區 → 澀谷：東京 Metro + 私鐵\n\n澀谷：\n\n- Onitsuka Tiger 澀谷店（有烏鴉入侵）\n- ABC Mart、逛鞋店\n- Bass Center Shibuya（G-CLUB SHIBUYA B1，試了一把 Fender Custom Shop Jazz Bass 約 70 萬日幣，聲音跟我夢想中的 Fender 一樣，但可惜顏色我不喜歡）\n- 無印良品\n- 晚餐：Muji Cafe（差評）\n- Disney Store（超貴）\n- Tower Record（買超多唱片，還有很棒的山下達郎展，超爽，一定要來逛逛）\n- 唐吉訶德（超好買又便宜，排隊要等有點久）\n\n飯店：remm hotel 六本木\n\n### 6/17\n惠比壽：\n- 午餐：Shake Shack（我覺得很好吃）\n\n中目黑、代官山：\n\n- 東京音樂大學代官山校區\n- 目黑川（對的時間來有櫻花，但夏天 0）\n- Streamer Coffee Company（藍瓶太遠了、Starbucks Reserve Roastery 要排 100 多組太多人了，但這間咖啡廳我自己很喜歡）\n- 走路經過住宅區（遇到有人家裡有山羊，嚇死人）\n- 蔦屋書店\n- NUMBER SUGAR 牛軋糖\n- Second Street（女朋友說台灣的進去五分鐘手會開始癢，但日本的不會）\n\n代官山 → 澀谷：東京 Metro\n\n澀谷：\n\n- 涉谷 bass collection：買了一顆 Julianna…\n- 晚餐：路上隨便看到的一間餐酒館，偏雷，忘記名字了（但什麼卡帕丘的生魚片很好吃）\n- Uniqlo\n- Shibuya 109（賣很多很像東區會賣的女生衣服）\n\n澀谷 → 六本木：東京 Metro\n\n飯店：remm hotel 六本木\n\n### 6/18\n- 早餐：松屋（飯店對面）\n- 六本木 → 上野：買了東京廣遊券，還有一些麵包跟飲料（媽的買到紅豆多納茲）\n- 上野 → 輕井澤：東京 Metro + 新幹線\n\n輕井澤\n\n- 午餐：川上庵（下午兩點去的，沒排隊）\n- 舊輕井澤銀座通商店街（順便買果醬，超爆多狗狗）\n- 教堂街（上廁所要錢，吃了老子 100 塊，幹）\n- 蘋果派：世界一のアップルパイmille meleミレメーレ軽井沢店\n- 輕井澤美術館 Key's CAFE 買了一杯熱美式（17:30 關但我 17:2x 進去說要買，所以重開機器等很久）\n- 晚餐：峠の釜めし便當 + 咚兵衛豆皮烏龍麵（超級甜、不好吃）\n- 飯店 Happy Hour：超多好酒 + 超多零食，超喜歡\n- 飯店租疊疊樂跟吹風機，還蠻好玩的（送東西來的還是台灣人）\n\n飯店：雙線飯店（TWIN LINE）\n\n### 6/19\n輕井澤：\n\n- 飯店早餐（看起來像舒芙蕾的東西有明太子很腥，炸雞很乾，除了主餐以外的東西都很好吃）\n- 輕井澤王子購物廣場 Outlet：買衣服、帽子、包包\n\n輕井澤 → 東京 → 原宿：新幹線 + 山手線 JR\n\n澀谷：\n- HARBS（下午 4 點多去是第一組候位，水果蛋糕已經沒了，但是水果千層還有，番茄義大利麵蠻好吃的）\n\n澀谷 → 原宿：JR 山手線\n\n原宿：\n- Uniqlo\n- @cosme 原宿（東西種類很多，但熱賣商品會 sold out，不過沒有特別便宜）\n- 松本清（整間店都是中國店員）\n\n宵夜：買 Lawson + 全家\n\n飯店：The OneFive Hotel（Hotel Emit Shibuya）\n\n### 6/20\n從飯店叫 Uber 去原宿站\n\n- 早餐：原宿 Bills（禮拜二早上 9:30 到剛好不用排隊）\n- 原宿 → 成田機場：JR + 成田特快\n\n成田機場：\n\n- Press Butter Sand（咖啡口味很讚）\n- FaSoLa：買薯條三兄弟跟梅酒\n\n桃園機場 → 台北車站：機捷\n\n### Closing\n下次去日本的願望：\n- 吃到居酒屋、壽喜燒、壽司、更多海鮮\n- 去酒吧、看 Jam Session、甚至看表演\n- 去更多樂器行\n- 滑雪、泡溫泉",
    "date": "2023-07-07",
    "tags": [
      "兔美旅行團"
    ],
    "isPinned": false,
    "textCount": 2779
  },
  {
    "id": "wanna-sleep",
    "title": "社會課｜節流沒意義，開源才重要，嗎？",
    "content": "年輕人為什麼躺平屬於萬年議題，但年輕人該做的是了解現況然後找到方法絕境重生",
    "markdown": "\n### 前言：台北是夢想的達成，還是墳墓\n因為不是每份工作都能夠 100% Remote，所以在選擇居住地點時，工作地點就非常的重要。年輕人都想住在台北的原因很顯而易見，台北相對於其他城市是一個相對比較繁華、機能較好的地方，同時「好工作」的數量也是多了非常多。\n\n我覺得探討年輕人買不起房而開始躺平這件事情（或關聯性）時，需要先思考的是為什麼年輕人會選擇擠在台北，當然這樣講不代表年輕人在其他五都就買得起房，說實在的整個台灣的房價就是在非常非常高的 level。為什麼需要先思考大家想在台北工作或甚至置產，是因為在台北以外的地方房價比較便宜，甚至物價比較便宜是顯而易見的，但薪水、機能低了多少呢？\n\n這個部分我覺得列出數據並沒有意義，因為即便告訴大家那個縣市的薪資中位數或者平均值，你領的也不會是那個數字。所以大家應該去看看自己在不同縣市能領到的 offer 的價格是多少，還有自己想要什麼生活，再來判斷自己在哪個地方置產或思考自己的處境是最佳的。\n\n## 躺平\n躺平通常泛指一個年輕人，或甚至一個社會的年輕人對努力之後得到的收穫感到不對等，所以就不願意努力。仍然願意工作的年輕人會選擇「安靜離職」，這個以後我們再做一期視頻講解，而不太願意工作的年輕人可能會開始放棄過往社會期望的選擇，例如生小孩、結婚、買房，甚至啃老。\n\n躺平的情況在台灣就我自己的觀察沒有到太嚴重，畢竟台灣雖然也面臨著青年普遍失業、不知道自己要幹嘛、買不起台北房子這些社會問題，但最糟糕的情況也可以簽下去或者做一些薪水頗高的勞力活，最後再創業跟投資之類的，沒有到「真的要出人命」的程度。不過看看我們鄰近的國家例如日韓或中國，在更病態的社會裡面這樣的情況是很嚴重的，我們還是需要提前思考年輕人躺平的原因是什麼，才可以避免在未來走到那樣的情況。\n\n躺平的原因不外乎就是薪水太低，所謂的薪水太低不是指我們沒辦法買跑車或香奈兒那種低，而是年輕人沒辦法買得起房子，甚至在扣掉租金之後追不上物價的漲幅。這也是為什麼我會特別在前言部分提到不同區域的差別，因為很多老人會說台北住不起可以住高雄或台中，說實在的出了台北房價跟物價降了，但薪水說不定會降更多，未來的職涯發展跟機會也會大幅減少。\n\n同時這也可以延伸一個觀點就是你再怎麼努力，獲得的收穫都比不上「繼承」。許多人不買房子選擇租房子就是覺得反正爸媽死了就有房子了，幹嘛要現在去扛那個房貸讓自己的生活品質大幅下降，壓力那麼大。\n\n\n### 躺平的主因：家\n華人和亞洲社會通常都會希望有間自己的房子才是真正的「家」，這是刻在 DNA 裡面，幾乎無法擺脫的。從另外一個角度看，綜觀這幾十年，房地產也確實是最穩定甚至蠻好的投資（不要買到海砂屋的話啦）。說難聽點就算你把這些買房子的錢拿去投資股票，落得一敗塗地的機率應該也比買房子賠掉更高。不過如果真的有把握買房子的這筆機會成本能夠發揮更大的效益，那趁年輕的時候不買房搞一個大的也沒什麼毛病。\n\n如果想買一間 1200~1500 萬的房子，頭期款 + 各種必要開銷可能就要 400 萬，如果是中古屋或者是沒有信用的年輕人貸款，那自然就沒辦法貸到多好的款。一個年輕人如果出社會時月收 5.5 萬（取中位數），扣掉每個月的基本開銷（房租水電交通吃飯等等的）抓 2 萬 5 好了，一個月存 3 萬的話需要存 10 年以上。如果要這個期限裡面買到這間房子需要假設：\n\n1. 你一出社會就有 5.5 萬\n1. 不用孝親費，爸媽也不會生病跟突然要用錢\n1. 不會生病，也不會有緊急開銷\n1. 不需要談戀愛，當然也不生小孩\n1. 不需要娛樂支出\n1. 房價不會漲\n1. 升息不會太誇張（不然也付不起房貸）\n\n當然薪水會漲，人也可以有副業跟投資，這就各憑本事了。不過說實在的 1200~1500 萬的房子如果買在台北外環例如新莊、新店、南港汐止、林口桃園、中永和、三重蘆洲、八里淡水等等地方，可能也買不到太好的房子，可能還行的屋況有個一房一廳的就蠻不錯了。\n\n要不要買房跟為什麼要買房不在這篇文章探討的範圍裡面，這個未來再做一期視頻講解。總而言之年輕人選擇躺平的原因，甚至與長輩發生衝突的原因，貌似都可以圍繞跟歸納在那一杯星巴克之上，從老年人的角度覺得少喝一杯就可以存錢，年輕人覺得少喝一杯也買不起房。我們可以繼續延伸下去。\n\n### 節流：星巴克\n簡單算一下 150 元/杯 * 5 天 * 53 個禮拜 * 20 年，也不過將近 80 萬。說實在的 80 萬到底可以幹嘛呢，我認為這個數字可大可小，因為 80 萬能夠創個小業，但要買房或買車養車也不夠。這一杯咖啡對一個人的意義到底在哪裡其實是我覺得更重要的議題：\n\n1. 星巴克對你來說是儀式感、生活品質，還是奢侈品？\n1. 其他類似的產品對你來說是提升你生活跟工作動力的助力，還是純粹滿足虛榮心的消耗品？\n\n這也是為什麼我會把開源節流、年輕人躺平、星巴克、房價這四件事情串聯在一起，因為很多時候一個人活著是需要身心靈一起調節的。一個人當然可以每天省吃儉用存下一筆錢，但賠了健康甚至患上一些心理疾病的話，這樣真的賺嗎，這樣存能存多少錢？\n\n實際上節流要節的不是生活品質，而是奢侈花費。也就是說你不該為了省錢吃泡麵，但你應該要為了省錢少買一個精品或避免買二手雙 B。你不該為了省錢拒絕把自己打扮得得體，但你應該為了省錢而拒絕不必要的社交。\n\n> 有許多社會底層會去借錢買水貨雙 B，然後加油只加三百，如果你工作用不到那買車一點意義都沒有，就算去格上租好車也比不上你養一台車。節流的時候要注重效益而不是注重面子，除非你靠著面子賺錢。\n\n不可否認一杯星巴克是許多人一整天的工作動力，甚至你有那杯咖啡就可以不吃早餐（吃早餐超貴的），又讓你覺得自己活著，感受到自己的生活有品質，間接更有生活跟工作的動力。如果真的有這個作用，那你二十年省下那八十萬一點意義都沒有，你如果為了社會期望過得很痛苦（而且要持續二十年），那活著的意義在哪呢？\n\n### 開源：重新看見起身的希望\n一個人一天只有 24 小時，不可能期望一個人白天上班，晚上還可以打工持續十年二十年，總而言之這是真的會出人命的選擇我們就不考慮。我自己覺得可行的開源途徑有以下短中長期的選擇。\n\n短期：\n\n- 兼職：如果能趁有閒情逸致時有事沒事多做一點，能多存一點錢在身邊是好的\n- 注重消費回饋和優惠，但能得到的效益並不多\n- 談加薪：這個技巧需要時間磨練，也需要一些底氣，沒有那麼容易但也蠻重要的\n\n中期：\n\n- 投資：選擇符合你風險承擔能力的投資，做好功課最重要\n- 轉職、升遷：考證照或檢定、上 Program 或進修、多做 Side Project 或者鑽研個人能力、參加研討會或讀書會盡力充實自己\n- 經營副業：許多人都會嘗試當 KOL、小電商搞網拍等等，大家可以自己去發掘，但這是一個很好的選擇，因為你同時也可以培養很多普通工作學不到的能力，也可以擴展人脈，算是銜接長期開源的一個好選擇（說不定還可以完成夢想）。\n\n長期：\n\n- 跳槽：有更專業的能力之後，跳槽絕對是最好的提升薪水的方式\n- 擴展人脈：認識更多人可以獲得更多的機會，因為好工作都是人介紹的，通常不是自己找的\n- 培養其他基礎能力、專業能力、語言能力\n\n開源與節流的差別在於節流有上限，開源沒有上限；節流通常會降低生活品質和降低自己的表現，但開源的話選擇正確的方式甚至可以提昇自我。而選擇開源方式的時候重點在於「了解自我」並且「妥善安排」，只有在了解自我之後你才有辦法選擇適合你的開源方式。舉例來說：\n\n1. 你是一個非常普通的上班族，平常上班就是處理老闆給你的各種雜務，而雖然都處理得不錯，你根本也不知道自己會什麼。這時候你就可以考慮培養其他截然不同的能力，或者經營副業，想辦法讓自己脫離現況\n1. 你是一個工程師，但只是一個薪水很低的碼農，那你可以考慮多去參加加深你技術的研討會、Program、專班，來幫助你提升自我的能力\n1. 你是屬於薪水不高的律師或會計師，而在坊間要能鑽研自己的途徑並不多時，那你可以考慮擴展人脈，想辦法打造自己的品牌，或甚至跳槽。這聽起來確實比較困難，但如果有一個專業能力在身上，又有品牌加身的話可以把天花板拉到很高\n\n提升能力這個東西是很痛苦的，因為會需要短則三個月長則好幾年的努力才會見效，過程中還獲得不了什麼收穫，白天還要上班累得跟狗一樣。但實際上是幫助你提升薪水最好的方法，即便你一年投資回報率 20 %，60 萬的薪水全拿去投資也才多賺 12 萬，但如果你月薪增加 1 萬，一年就可以增加 12 萬，而調薪 1 萬並沒有那麼難，但每年穩定投資獲利 20 % 是難如登天呀。\n\n在這個年代年資提升不代表你的薪水就會水漲船高，所以想要開源沒辦法躺著或只是安靜離職就能達到，需要多做一些額外的事情來幫助自己由內而外的提升。\n\n這篇文沒有教大家怎麼樣賺錢，也就是沒有說一些：「喔，你這樣這樣做就可以有錢從天上掉下來呦！」。我自己對這樣的偏財或者機會，甚至投資也不是很在行，一直以來能累積不少的財富都是靠著正職或兼職工作賺來的。我覺得最困難的是需要持之以恆的累積，才能度過那個痛苦、乏味的時期。",
    "date": "2023-07-04",
    "tags": [
      "社會課",
      "錢錢管理時間"
    ],
    "isPinned": false,
    "textCount": 3766
  },
  {
    "id": "dont-push-your-kids",
    "title": "社會課｜先修到底是爭先恐後還是因材施教",
    "content": "一邊是望子成龍、望女成鳳，一邊是棒打出頭鳥",
    "markdown": "如果你或你的小孩是天才、是奧數物生化金牌，先修屬於如魚得水，那這篇文就不屬於你。如果你本來就預計大一有其他規劃，所以暑假先把一些學分修掉，那也是一個很不錯的選擇。但如果不是天才也沒有特別的需求，就需要慎選你的閒暇時間到底要拿來先修然後浪費掉，還是要好好運用在別的事情上面。\n\n### 先修並沒有那麼糟，但需要謹慎決策\n其實先修並沒有想像中的那麼糟糕，尤其是在華人這種病態的社會裡面，一方向想要把你送進私立學校或者資優班小六學國一，國三學高一，高三學大一這樣子的爭先恐後；一方面看到你特別聰明又叫你緩著點，等等大家一起，不要想當出頭鳥、出風頭，看到你比較優秀就想挫挫你的銳氣。\n\n在國小國中的時候如果特別聰慧，但仍然在公立學校的普通班，那你通常沒辦法搶先其他人多少，這其實是遏止了許多優秀人才的發掘。當一個小孩悠然自得的可以超越其他同齡人，那我覺得在不影響社交還有人格發展的情況下先學一些普通人未來才會學到的東西，其實是更好的。強制一個人平庸化，是對一個社會很可惜的決策，但許多的師長並不在乎小孩健全的人格發展，反而強迫小孩要先修跟不斷更換生活圈，更是一個可悲的結果。\n\n跳級、讀資優班、讀先修班甚至選擇私立學校是需要家長多加思考的，如果讓一個小孩充斥著讀書讀書再讀書， 在小孩心中種下一個概念是「考好也沒意義，就只是讀更多書」，那基本上就是將這個小孩打入更深的深淵。有很多家長會習慣讓學生轉學，或者突然地就跳級，讓小孩沒有在一個健全的社交環境中成長，那就會導致小孩的世界只有讀書這件事情。\n\n### 先修從什麼時候開始變得毫無意義\n\n小時候要不要先修是一件很重要的事情，因為小時候的資質無法估計的，同時也有許多人在小時候沒有開竅，所以怎麼讀都讀不好，結果長大成績突飛猛進（甚至我有很多很多同學在高二高三突然開竅直接考上台大或醫科）。\n\n可是也有不少小孩年紀很小就呈現過人的資質，呈現可造之材的樣子。所以小的時候在不影響社交、不影響人格的情況下讓小孩發揮天分做一些超越其他同齡人的栽培，我認為是對這個小孩更好的。\n\n不過高中的時候先修是一個完全沒意義的事情，因為國中畢業之後每個人都會多少的開始有一些自由，這些時候才你真正跟朋友相處的時候，也是你真正有能力鑽研一個興趣的時期。這時候先修只是在浪費你自由的時間，你可以拿他去玩或者充實自己，拿來讀書然後忘掉是一個非常愚蠢的舉動。\n\n我身邊所有考上醫牙電資的同學，幾乎都沒有先修，沒有在高三暑假先修大一微積分，沒有在國三先修高一的數生物化。我得用我自己的經驗告訴大家這一點意義都沒有，只是給補習班騙錢而已。因為你根本不像那些第一志願前 5% 的天才一樣可以在兩個月的時間內讀懂一學年的內容，屆時你在課堂上遇到先修過的內容時也早就忘光了。\n\n### 結論與決策過程\n因為上面的內容並沒有呈現太清晰的決策過程與思路，所以這邊我列出幾點讓大家思考要不要先修，還有先修可能會造成的影響：\n\n1. 小孩在年紀越小越容易會有一種想法就是：「補習班上課講過了，上課的時候就不需要認真聽，之後也不用太認真複習」\n1. 不能讓小孩感覺到「考好也沒意義，就只是讀更多書」\n1. 不能讓小孩沒有在一個健全的社交環境中成長，所以不能頻繁轉學、跳級、轉移社交圈\n1. 讀好書的重點是「消化」，不是補習班聽課然後忘掉、去補習班抄筆記，寫一堆題目或考試之後不檢討，這些一點意義都沒有\n1. 與其先修，不如把你過往沒有學好的東西學好，與其走馬看花不如穩紮穩打\n1. 讀書不是一切，真正重要的是有家教，還有時間管理、決策過程、思路歷程、願意付出\n\n為什麼你不該選擇大學先修課程來幫助你了解這個科系你喜不喜歡（e.g. [超夯先修課 高中就當大學生](https://www.englishok.com.tw/depth-coverage/cover-story/university-prerequisite)），因為大學教的東西跟這個科系未來的發展還有職涯通常沒有太大的關係，有超過半數的教授跟學校老師只是活在象牙塔裡，對業界沒有理解的老人。所以你該做的應該是多去書店看書，多多嘗試自己做 Project 跟上網查各種資料，詳見我另外一篇貼文：[社會課｜上大學前應該要做什麼](https://chihaolu.github.io/publication/article/prepare-for-university)。\n\n同樣的，家長也要謹慎思考為什麼需要先修或讀私立學校，這些選擇真的對完成目標（考上好學校）有用嗎？如果自己不是很會讀書，建議多去參考會讀書的人或在那個領域專家們的意見，這個世界上沒有那種「你自己做不好，但能給出好的建議」這種事情。\n\n",
    "date": "2023-06-30",
    "tags": [
      "社會課"
    ],
    "isPinned": false,
    "textCount": 1934
  },
  {
    "id": "sth-just-sth",
    "title": "社會課｜遠看時審視，近看時呼吸",
    "content": "你厭倦懊悔的每一個當下，都是因為你正在用放大鏡看你的人生",
    "markdown": "### 前言\n我小時候是在一個很重的課業壓力下長大，國小的時候會在安親班寫全版本全科評量跟考卷到九點才回家，把版本光碟寫完一次又一次。國中的時候也是，如果沒有考好那彷彿世界就要塌下來一樣，也常常因為段考考不好現在看來如此沒意義的事情跟家人關係不好，也間接或有點直接地塑造我現在的樣子。總而言之對我這樣一個沒有讀書天份的人來說，用時間跟努力就是堆疊出我勉強（重考才）考得上台大的關鍵。\n\n但這也就造就我的性格認為，每一步我都不能踏錯，我已經沒有像其他天才一樣聰明了，如果我還做出錯誤的選擇或失敗了，那不就落後了嗎？然而這樣舉步維艱的性格如果一直保持下去直到我現在，那我猜自己一定是一個平庸的人（平庸沒什麼不好，但我自己不想）。\n\n在國中小的時候無論是在學校或者是在補習班，我都可以很深切的感受到自己是因為成績好而特別獲得老師的關注，甚至是做錯事的時候也可以被原諒。然而我曾經遇到一個班導他的一個微小的舉動改變了我未來的方向。\n\n忘記是在什麼時候，反正是國小的時候每個禮拜都需要在聯絡簿上面寫當週的週記還是心得之類的。但畢竟是國小生，所以我當時的煩惱貌似也就只有考試考不好而已，所以我就隨手寫上去交差了事，但當時老師的回覆是：「一次段考成績是用人生的放大鏡去看，如果放眼整個人生去看的話，它就像隻螞蟻一樣微不足道。」\n\n原文怎麼寫我不是很確定但應該不會差距太多（至少放大鏡跟螞蟻這兩個名詞跑不掉）。重點是他在那個當下給我這樣一個以為讀書就是全世界的小孩的心裡，種下一個很不一樣的種子，直到高中碰見熱音社之後它才發芽讓我慢慢與一般人走上完全不同的路。\n\n### 鈍感\n成功的人會有一個特質，那就是「鈍感」。但我需要講三次這邊說的鈍感不是渡邊淳一的「鈍感力」這本書，這本書是垃圾書大家不用看。因為很重要所以要再講一次（這本書爛到我不想講三次）：\n\n> 這邊說的鈍感不是渡邊淳一的「鈍感力」這本書，這本書是垃圾書大家不用看。渡邊淳一的「鈍感力」是自欺欺人、掩耳盜鈴，你有個正常的智商，都會知道這本書充斥著仇女與該被這個社會淘汰的老男人主義\n\n其實鈍感這個詞並不是最近才出現的，而是早早就有的一個概念。所謂的鈍感是一個人在面對不如意的事情時，不會以焦慮、衝動等任何負面的情緒沖昏自己，而是淡定、冷靜的面對跟好好把它處理好。面對不可控、無法處理的事情我們不要拘泥或者執著在其之上，而是把能控制、能處理的部分做好。\n\n同時這些不如意的事物不只是發生了一些糟糕不幸的事情，而甚至是面對到流言蜚語或其他人與人的交流時，也不該有過度敏感的反應。在這個社群媒體已經徹底佔據我們生活的年代，我們 100% 不可能與社群媒體完全脫離，該學會的是與其好好相處並且有著正確的觀念來面對一切。此時因為人與人的距離由於網路的原因顯得無比貼近卻又無比遙遠，反而讓人們更加的敏感，擔心一舉一動都被人看透，卻又看不透任何人在螢幕後面的本質。\n\n其實「鈍感」跟我這篇文章要講的內容很契合，也就是面對失敗、不如意時你要做的事情不應該是過度焦躁、手足無措、厭倦懊悔，而是按照以下的流程解決事情，讓你的人生、公司、關係、身心靈重新回到軌道：\n\n1. 深呼吸、冷靜，調整身心靈狀態，確認自己不處在衝動、焦躁的情況下做決定\n1. 好好檢視自己還有什麼，不管是資本、特質、能力、人脈\n1. 思考如何用你仍擁有的來「回到正常水準」，這邊說的是「回到正常水準」而不是「轉虧為盈」，這是一個關鍵，你不該想著怎麼從不及格變成滿分，而是要想著怎麼從不及格變成及格\n1. 回到正常水準以後，再想著如何突破與往前邁進\n\n鈍感這個能力是一個人從絕境之中，或者不如意的過程之中回歸正常的一個極佳能力，當然有很多人他能成功或者達到目標不見得是需要鈍感，他可以很衝動、雷厲風行、極度敏感，不一定是隨波逐流、以柔克剛，也能掌握到他們才能掌握到的機會，同樣也需要承擔一定的風險（高風險 ←高速率→ 高報酬）。\n\n### 鈍感是如何培養的\n其實根據我的經驗還有我觀察身邊的人的結果，鈍感並不是那種有人告訴你你就會發現並且學會然後融會貫通的能力，而是在經歷了無數的失敗還有重新爬起之後，漸漸地你會發現許多事情只能聽天由命，許多機會跟緣份早就是上天注定。有時候我們可以逆天改命，不過大部分時候我們真的只能把自己能做的做好。\n\n當然要培養鈍感也不是做不到，我自己就歸納出一些方法（至少我自己是適用）：\n\n1. 分類做得到跟做不到的事情 → 認識自己\n1. 分清楚什麼是重要的，什麼是不重要的，為什麼現在要選擇把時間、經歷、成本花在做這個事情上面 → 認識自己\n1. 尋找並確定想要的生活型態、目標、對象、適合的關係等等是什麼 → 認識自己\n1. 嘗試 → 檢討 → 改進 → 紀錄\n\n以上就是培養鈍感的 SOP，但我必須得說高敏感族群或者容易焦慮有時候是生理因素，這很重要，也就是我跟你說：「我知道你很急，但你先別急」很多時候是在說幹話。不過反過來說撇除生理因素的部分，至少自己的思維上要時時刻刻抱持著做不到就算了之類的想法，不要拘泥、執著在那些沒意義的事情之上。\n\n有一個很好的例子就是你的價值觀跟社會想像是必須很會讀書，但當上了大學之後如果你不確定為什麼要獲得好成績，那為何要那麼努力去追尋 A+ 呢。如果沒有要雙轉輔，沒有要申請國外研究所或者推甄，那為何要背誦那些 100% 無用的知識，或者拍老師的馬屁只是為了追求 4 這個數字。\n\n**前面三點都是心態跟思維，而第四點的「嘗試 → 檢討 → 改進 → 紀錄」才是你能不能培養起鈍感的關鍵。** 許多人即便不知道前面三點也可以培養出鈍感，面對不如意的事情或者再怎麼努力也不可能達到的目標可以兩手一攤，但面對有機會的事物能夠很努力去追尋，這時候他也可能一輩子不知道「鈍感」這兩個詞。\n\n所以真正重要的還是不斷失敗，不斷反省，不斷紀錄，不斷前進，這才是讓你心靈達到超脫一切的路。\n\n### 放大看是微不足道的窟窿，不代表綜觀可以是爛路\n前面說了那麼多，貌似重點都放在鈍感之上，因為我覺得告訴大家「現在的失敗或者裹足不前是因為你用放大鏡看人生」很像幹話，所以更想告訴大家怎麼培養鈍感、怎麼讓自己冷靜然後向前進，這比給大家雞湯或無腦告訴大家很棒更重要。\n\n所以以上的重點歸納給大家，就是兩個：\n\n1. 確認你把自己能做的做好就好，剩下的誰都沒辦法\n1. 起身動手，失敗檢討，反省紀錄，繼續前進\n\n老實說大家都多多少少知道不要在意當下的那個窟窿（小失敗），或甚至一直抱持著這樣的想法，所以每次遇到失敗時就覺得反正下次還有機會，那就下次再努力。這樣的人沒有符合我以上流程內容的部分就是：\n\n- 他有反省，但沒有紀錄跟檢討\n- 他有起身，但沒有把能做的做好\n- 他有繼續，但沒有前進\n\n這個例子在我在熱音社的時候有很深刻的感受，就是「每一次」表演都有人下台之後開始哭，覺得自己 Solo 爆了很丟臉，很後悔沒有練好，然後要不就是一個人在角落耍孤僻或者一群人抱在一起哭。結果表演結束之後還是一直花時間在打公關跟在玩，平常也沒在練琴，練團前也沒把歌練好，下一次表演又重新表演一次下台哭哭啼啼的戲碼。\n\n> 這個情況從我高一開始直到我大四幫學弟妹代打表演都還在發生，讓人有點傻眼\n\n結論是我想告訴大家如果沒辦法放棄聚焦在小失敗上面，可以考慮照著我的流程去設計你的步伐，讓自己有意無意地培養鈍感，讓自己未來在面對小失敗的時候可以更冷靜的去處理然後重新爬起來。\n\n長遠的來看你可以不要在乎曾經微小或看起來有點大的失敗，但如果放眼望去全部都是失敗，而沒有一些覺得自豪或哪怕一丁點覺得滿意的成果，那就要小心了。不是每個人都要有滿山滿谷的收穫跟成就，但至少「你自己想要達到的目標」，要能夠達到吧。即便想要過上平庸普通的生活，在這個年代都是一個追求了。",
    "date": "2023-06-27",
    "tags": [
      "社會課"
    ],
    "isPinned": false,
    "textCount": 3194
  },
  {
    "id": "breakup-with-past",
    "title": "兔子窩｜與過去分離",
    "content": "或許只有我有這種感覺，也或許不是",
    "markdown": "上大學之後的這幾年有非常顯著的感受到，自己跟以前的朋友還有年紀相仿的親人們距離越來越遠，並不是因為看不起他們或者是不喜歡他們，而是我們之間的生活圈、交友圈甚至價值觀可能相異、有差距，甚至到背道而馳的程度。直到此時此刻這樣的情形嚴重到如果不講我工作在做什麼，我已經不知道怎麼跟以前的那些親朋好友相處了。\n\n### 漸行漸遠是什麼感覺？\n這一兩年我問了身邊許多朋友有沒有這種感覺，大部分都說有，但沒有到非常嚴重的情況，只有我感覺特別嚴重。以前國中國小的好朋友現在也都（完全）沒有再聯絡了，火臉書還是有好友，IG 還是有追蹤，但就是完全不可能有交集的那種感覺。原因或許是物理上的距離（他們可能不在台北，都選擇待在家鄉），但我認為更多的是複雜的生活因素導致的。\n\n小時候的時候只要一起玩一些簡單的電動就很開心，例如積木人打殭屍、真三國無雙、WII 或 PS2、甚至後來的英雄聯盟。或者是一起去打羽球、打籃球、打保齡球也很快樂，但隨著年紀增長，我們早已不玩遊戲了，感興趣的內容也已經大相徑庭。彼此之間的話題也就減少非常多，剩下的也就只有打打麻將而已了。\n\n現在我與老一輩親戚朋友的話題都圍繞在工作、女朋友，誰誰誰的兒子女兒很厲害到底是真的假的上面，如果是跟我同輩的不在同一個圈子的人，或說不是同一個生長環境跟模式（一直一直在讀書），那就會有很陌生的感覺。\n\n沒錯，就是陌生的感覺，以前明明很簡單的就可以獲得快樂，不管做什麼都很好笑，例如每個禮拜六拿著少少的零用錢一起去家裡附近的 711 吃泡麵，然後假日在校園玩躲貓貓或者 BB 槍，去雜貨店買甩炮跟水鴛鴦，在保齡球館打出火雞，或者是在召喚峽谷打出五殺。\n\n現在卻已經沒辦法那麼簡單的獲得快樂，不只是快樂很難，光是要跟他們愉快的交流也顯得沒那麼容易。\n\n### 所以為什麼？\n「話題減少」我覺得是其中一個主因，畢竟我沒辦法跟他們分享資料結構與演算法這門課到底有多難，不要說分享我現在工作在做什麼，甚至連好好把寫程式在幹嘛講清楚都屬於天方夜譚。同樣的他們的話題可能是一群人做一些放縱的事情，例如去唱 KTV 或者喝酒的時候發生的趣事，或者朋友感情之間的糾紛跟八卦，但對我來說已經沒有那麼有興趣了。\n\n或者是說這幾年我經歷的生活模式，早就剝奪我放縱自己、完全不管一切的那個野性了。當然我還是有夜衝淡水基隆過，也有跟朋友去夜唱到早上六點吃早餐過，但就已經不可能喝得爛醉倒在路邊，或者是做出極度放縱的舉動了。\n\n「生活圈差異」則是另外一個主因，上了高中之後會經歷一個巨大的分水嶺，會與我相見的都是一個市裡面最會讀書的一群人，當時國中會認識的小 8+9 不會再出現了，那些只有小猴子會做出來讓朋友們捧腹大笑的事情也變得很少。更甚者大家只圍繞在考醫科上面，像我們這種還花大把時間去玩社團的人已經算很不錯（有趣）了。\n\n上了大學之後差異則更大，大部分人都拼命的在實習或充實自己，做報告、寫作業、讀期考到天亮，那種完全不知道自己在幹嘛，或者會做出與「社會期望」脫節的情況已經不太會出現。我沒辦法跟這些過去的友人與親人分享我實習到底多努力，也沒辦法分享誰誰誰到底多厲害，那些都是老一輩的親戚在做的炫耀舉動，我能分享的到底有什麼呢？\n\n### 我也有問題\n其實這種情況的發生是在所難免，生活圈、交友圈、三觀不同，本來兩個（群）人就會愈漸遙遠，但說實在的我是不是一個本來就蠻無趣的人呢，或許是吧。我本來就不太出去玩，也不太常接觸生活圈以外的事物，平常不是坐在電腦桌前面就是彈彈琴而已，還不聽團不去音樂祭呵呵。\n\n或許我能做的只有接受這一切，如果有話題或者有緣分就會再相遇、再聯絡，但如果沒有辦法的話就真的沒有辦法，過度刻意的要與人相處是非常痛苦的我也知道，所以沒必要為了那些關係強求彼此。\n\n不知道大家會不會有這種感覺呢。\n\n",
    "date": "2023-06-25",
    "tags": [
      "兔子窩"
    ],
    "isPinned": false,
    "textCount": 1572
  },
  {
    "id": "prepare-for-university",
    "title": "社會課｜上大學前應該要做什麼",
    "content": "如果再給我一次機會，好啦我已經有一次機會了",
    "markdown": "\n今天剛好看了黃大謙的影片有人問到上大學前的暑假要做什麼，突然覺得我也可以來分享一下這段時間要做什麼。不過我自己的例子有一點點點點不太精準，也就是不太符合一般大學生的模式，因為我是先在成大讀了半年書之後才重考，然後考去台大的，所以我已經有了半年的大學經驗，也因為多了這重考的半年時間讓我有機會思考我以後到底想要的是什麼。\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/MGb2DGxVVFE?si=PYMmrs_za1dTJK4z\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen />\n\n### 我自己這段時間在幹嘛\n在此之前我先講一下我都在幹嘛。在重考的那次指考結束之後到我 9 月真正在台大開學之間應該有大概兩個月的時間，這段時間我主要在忙的就是樂團發專輯、表演、賣周邊的事情，然後大練特練琴，同時也跟已經在資工系讀了一年的好朋友借了由片語 C 學程式設計，很粗糙地把前幾章練完，貌似是到 Function 那個章節而已吧（之後大一上我有把整本幹完）。出去玩的話好像有去過台南，剩下的就是泡樂器行耍廢。（還有先偷看一下系上有哪些正妹）\n\n當然我也有規劃一下以後上大學想要做什麼，其實主要還是辦表演跟寫歌，課業跟職涯部分，還有哪些課一定要修的（EECSIEIM 之類的），有哪些領域是我可以嘗試的然後如果要嘗試的話可以怎麼做，在我畢業的此時此刻來看我確實都有做到。\n\n如果再給我一次機會的話我應該還是會做一模一樣的事情，就是沒什麼好改進的，該玩的、該廢的，該充實自己的，該豐富自己的我都有做到，但我覺得這也是我經歷過一年很自由的時光（重考只考三科其中一科還是數乙到底有什麼難的），然後不斷反思跟尋找自己要什麼之後所做出來的決定。\n\n說實在地，當初做的很多準備與規劃我最後是沒有用到的，例如在上大學之前我最想做的其實是管顧，聽說進到麥肯錫實習月薪就有十萬（我也不知道真的假的），穿著西裝操著一口流利的英文然後一付 elite 的姿態成為老闆眼中的紅人，這種樣子對於當時的我來說算是有一咪咪嚮往。上了大學才發現我的英文爛得可憐，然後我也不喜歡穿西裝打領帶，我真正想的只是穿著短袖短褲涼鞋在電腦螢幕前敲鍵盤。\n\n同時我也有準備往量化交易或者一些高頻交易、財務工程的方向做準備（就是查資料，看有哪些公司，這些職業在大學的時候都讀哪些系，薪水怎麼樣，評價怎麼樣，有哪些科目一定要修）。我本來就預計要把經濟所學跟程式結合，結果發現自己對金融一點興趣都沒有，對統計還有線性代數一竅不通，不過寫程式倒是蠻有天分的，所以就直接往純軟走了。\n\n### 我跟普通大學生的差別在於多了一年 Gap Year\n其實台灣並不流行 Gap Year 的說法，我看見大部分有機會實踐 Gap Year 的同學也都是因為家裡有點錢所以送出國玩了一年，回來還是不知道自己可以幹嘛跟想幹嘛，這樣講好像是一無是處，但說實在的就算是出國純玩一年、認識各國的朋友，最基本的好處還是有：\n\n- 實打實的外語能力（至少有進步吧）\n- 有很多故事可以講\n- 增廣見聞，對外國人還有外來文化的接受度可以提高\n- 培養獨立性（即便有轟爸媽，至少你還是離開爸媽愛的呵護，嗎）\n\n光是以上的好處說實在的出國純玩一年也沒什麼不行，我想要表達的其實是如果這一年你真的可以藉由各種不同方式來知道你以後的方向，或甚至「可能可以嘗試的方向」，然後花時間去了解他們到底在幹嘛，怎麼運作的，業界、學界情況是怎麼樣，光是略知一二就夠你判斷你願不願意去嘗試看看了。\n\n當然窮人有窮人的玩法，雖然我不窮但是我覺得我的方法窮人也適用，在高三畢業之後到進台大中間這一年其實我很常去誠品或甚至高中旁邊的書局（賣一堆參考書的那種）翻書，我覺得翻書的過程對我來說已經不是攝取知識了，而是一種尋寶的過程。\n\n### 第一件上大學前你可以做的事情：逛書店\n對我這樣一個完完全全的理工直男來說，基本上靠著 Google 加上時間練習就沒幾樣東西或知識是我們學不來的。而翻書的過程更像是整個書局有各種我平常不可能觸碰到的角落，例如輕小說、歌劇劇本、量子力學教科書等等的，逛書店可以強迫你脫離舒適圈還有媒體跟社會的渲染。\n\n也就是說爸媽總是跟你說讀醫學系牙醫系最棒，不然當工程師的話也很讚年薪很高還可以遠端工作，或者是師長總是你說做什麼什麼行業一定會窮死，可是逛書店的時候沒有人會阻止你走到這間書店的任何一個角落，你可以跳脫你平常接觸到的所有同溫層，觸及到各式各樣的可能性。\n\n> 而我自己也是在逛重考班旁邊的書局時隨意翻到一本「代幣經濟崛起」，我簡單翻了翻之後覺得很有趣，這才一路走到今天這一步的。\n\n所以說我給高中生（甚至很多大學生）的建議就是，如果你不知道你要幹什麼，如果你不知道你可以嘗試哪些路，受夠了師長給你的那些看似優渥的職涯建議。那你可以考慮多多去逛書店，反正暑假真的很閒，你完全不需要想著你要先修微積分或者哪些必修，那些一點意義都沒有，多去看點書，真的會讓你的視野開闊很多。看了之後覺得有興趣，多 Google 多看相關影片，看一下這個行業或者領域怎麼樣專精，發展怎麼樣，是不是你真的可以試試看的。\n\n### 第二件上大學前你可以做的事情：找興趣\n每個人高中的時候應該都有參加社團吧，或者是你本身應該有一個以上興趣，因為上了大學之後有很高的機率你的同系同學不一定會一直跟你同一堂課，所以你的好朋友不一定會是你系上的朋友，有可能是高中的朋友、室友、社團的朋友之類的。不管怎麼樣我強烈建議你如果你想交到很多好朋友，可以一起出去玩，一起聊天，一起喝酒之類的不管，你都最好要有一個興趣，而且最好是變強一點。\n\n為什麼變強一點比較好呢，因為大學相當於半個社會，你越強自然而然可以吸引到的人就越多，會越多人聚在你身邊或者是你可以獲得更多的機會跟朋友。或許有的人會說這樣子的都是酒肉朋友或者豬朋狗友，我老實說還真不是這樣，強者當然會願意幫助弱者，可強者更願意跟強者交心，所以你想要跟優秀的人一起精進，前提是你也是強者。\n\n找興趣最簡單的例子就是如果你原本就喜歡跳舞，或者你甚至不會跳舞，那你最好暑假就去附近的舞蹈教室從頭學起或專精他，相信我你進到大學之後一定可以幹掉一半的人，到時候愉悅的感覺不言而喻。不過如果你對好勝心還有出風頭（把妹）沒興趣，只想快快樂樂地跳舞，那我覺得你有這個興趣已經很不錯了，足夠讓你遇見一群有意思的人，剩下的就看緣分跟造化了。\n\n另外我覺得有一個興趣可以讓你變得更立體，成為一個有趣甚至吸引人的人而不是只會讀書的書呆子，有一個興趣並且專精他的過程中，其實你可以涉獵到很多讀書之外的領域，例如怎麼辦活動，怎麼樣與人相處，怎麼樣吸引人目光而不是曲高和寡。而這些經驗都可以成為日後你在學界或業界與人合作上或工作上很大的養分，就我的例子來說我第一份工作是一個業界培訓班的助教，而當初我錄取的關鍵不只是我做過相關的 Side Project，我想更多的是我會做立牌、看版、識別證，所以那個老闆才會馬上錄取我。\n\n而這些經驗都是我在玩樂團的時候辦表演而學到的，我可以馬上支援各種能力，同時擴展我的收入方向（做這些雜務的同時老闆也有給我額外的錢）。\n\n退一萬步來講，就我自己的觀察能夠在大學中交到女朋友的人都有一個特色，那就是有趣，這真的跟長相沒關係，只要你有一個專長或者興趣，足以吸引人，或者能認識很多人，那你脫單的機率就高很多很多。反之一直很想交到女朋友卻魯了四年的同學其實都沒什麼自己的興趣，平常也只是隨便玩玩電動跟看動漫而已。講這些好像很膚淺，但我相信有很多男生高中魯了三年，應該不希望大學再魯四年，剩下的就看大家自己怎麼做選擇了。\n\n### 第三件上大學前你可以做的事情：學會在 21 世紀活著\n上大學前也許你需要做的就只是把書讀好，而上大學之後你必須記得讀書不是你唯一要做的事情，甚至他的 Priority 還比很多事情後面很多，總而言之第三件你可以做的事情就是學會怎麼在現在這個時代活著：\n\n1. 學會自己出去玩：訂票、訂飯店、排行程、租車等等等的，這些事情你如果自己會操作的話那我保證你肯定是一個團體裡面重要的存在。同時如果你能先考到駕照這也蠻不錯的（請記得注意行車安全，每年有超多大學生在路上失去寶貴的性命）\n1. 學會操作文書軟體：不管你是要用 Google Doc、Word、Pages、Canva 還是 HackMD 之類的，你都一定要學會做筆記、做報告、做試算表、做簡報，這是你上大學必備的技能，千萬不要讓你的組員覺得你是一個原始人\n1. 學會表達你的意見：該拒絕的時候要學會拒絕，有想法的時候要提出來不管是分組報告還是你對相處模式有顧慮都一樣。有些時候你這樣會得罪到人，但請相信我如果你理性、和緩、委婉地說出你的想法，而對方馬上失去理智或者用沒有邏輯的言語來反過來攻擊你的話，那他就是一個白癡，你只要默默地在心裡給他打上叉叉然後避免再跟他相處就好。大學裏面有超多智障，所以你不用花時間跟他們分享你的真知灼見，當你意識到對方不是個值得深交跟能夠溝通的人你就不要浪費時間了\n1. 學會生活：如果可以的話盡量記帳，如果你要住宿舍的話請學會怎麼洗碗、洗衣服還有一些生活小常識，不過其實也沒有很重要，如果不會的話 Google 就好沒什麼大不了的\n\n### 最後補充一些點\n\n1. 如果可以的話強烈建議大家把英文練好，如果我英文很好的話說不定會走上完全不一樣的路，雖然我也不覺得那條路會比現在好多少，但英文好絕對是一個硬實力，而且可以讓你有更多選擇，英文還可以免修（超爽 der）。\n1. 經濟許可的話不要塞滿打工跟家教，能趁這段時間閒閒沒事做賺一點小錢是蠻不錯的，不過這可能是你極少數可以自己完全掌控的時間，而且沒有任何課業壓力，所以把時間分配在可以充實自己的事情上面會更好\n\n以上是我自己覺得上大學前可以做的事情，雖然我的 TA 裡面沒有高中生，我還是自己寫得很開心，如果你身邊有高中生準備要上大學，歡迎你們貼給他們看。如果有任何問題的話留言我都會回應。",
    "date": "2023-06-22",
    "tags": [
      "社會課",
      "2023 十大精選文章",
      "你的最佳職涯導師"
    ],
    "isPinned": false,
    "textCount": 4017
  },
  {
    "id": "lucky-theory",
    "title": "社會課｜成功需要運氣，但不只是運氣",
    "content": "怪罪到不可抗力因素是幼稚的表現，可控的因素你都把握好了嗎？",
    "markdown": "\n很多人說，成功只跟運氣有關，運氣好的人即便實力、努力比別人少也可以成功，這確實是真的，但其實我覺得只是高相關，且所謂運氣並沒有想像的那麼簡單，不是四組天干地支或者哪顆類地行星逆行就說得算的\n\n一個人活著當然可以嘴巴說著運氣決定一切，天賦、外表、家庭之類的我們無法選擇的因素，就決定了人生的高度之類的然後就選擇躺平等投胎到好人家。但如果你是一個有真正想完成的事情的人，且又不敢馬上投胎賭你真的會首抽刷到 SSR 的話，那還是認命點開始努力吧\n\n### 什麼是運氣\n\n運氣可以視為是「距離期望值的感受」，當我們的範本數很低的時候事實結果，不一定會接近我們的期望，而這中間的差，就是運氣。簡單來說一個有實力的人應該要面試 100 次中 90 次，但如果面試 10 次他就會中 9 次嗎，應該不會\n\n相信講到這裡懂的人已經懂了，那也就是「運氣來自於在短暫的嘗試中，你能有多接近期望值」，而重點就會在「你有沒有失敗的資本來獲得相應你實力的期望」\n\n這句話是什麼意思呢，也就是如果你的收穫遠遠不到你的期望，那通常你會覺得你的運氣很差，但其實說不定只是你嘗試的機會不夠多而已，或者是你每次嘗試的時候出了什麼你不知道的問題，這感覺很像是你在做實驗的時候沒有把控好對照組跟實驗組，導致實驗結果總是跟理想出現落差\n\n> 這也就帶出了為什麼有錢人比較容易成功，因為本多終勝，「老子撒五百萬開公司跟買甜甜圈來吃是一樣的，你存了十年才能創業一次怎麼跟我鬥」的感覺\n\n反之，在有限的嘗試次數或體驗次數中，如果你的收穫遠遠大於你的期望（相應你的真實實力），那在外人眼中或甚至你自己眼中，你就是一個運氣好的人\n\n以上就是我認為運氣的由來，也就是為什麼人類會感受到運氣，還有運氣是跟嘗試次數有關的\n\n### 社交圈也是運氣塑造的重要因素\n\n其實在我眼裡量化的運氣也是機會多寡的意思，例如你多跟厲害的人交流跟交好，那被介紹好工作、優秀朋友的機率就會大幅上升。反之你如果跟一群不務正業的人混在一起，那不只是你會認識更多豬朋狗友，你還會發現你在挑對象時永遠都是那個水準的人\n\n更特別的是，你如果太常跟一群同樣性質的人在一起，你會潛移默化的變成那個樣子，也就是沈浸在你的同溫層中。如果你是跟一群優秀的人一起努力，那你就會不知不覺變強，反之就是一起沈淪而不自覺\n\n此外，跟不好的朋友在一起，最後還有可能會惹上麻煩，即便跟你一點關係都沒有，但事情就是燒到你身上，拳頭就是打到你身上，這就是倒霉，但其實這些都是有機率可以避免的\n\n### 運氣分可控與不可控\n\n我認為運氣在某些層面上是可控的，或者說我認為所謂運氣分成兩種，可控跟不可控。\n\n如果你每一次的嘗試都是不同的因素在控制著那次的情況，例如我每次求職刷的題數都不一樣，模擬準備的次數也不一樣，履歷寫法也不一樣，那就等於你這幾輪下來接近期望值的機率是不同的\n\n雖然他終究是機率，但你非常有可能藉由擴展人脈以及各種正確的嘗試，而更有更高的機率會得比別人更多的機會。反之有時候你根本沒有多努力，錢就是會砸在你的臉上，但我們不討論這種不可控運氣的情況，因為這就跟怎麼買樂透更容易中一樣完全沒意義\n\n而運氣不好有時候固然是無可奈何，但其實壞運也是有可控的，例如有的人走在路上好好的就會被車撞，這種事情就屬於無可奈何，為不可控運氣。但如果你不只是遵守交通規則，還不蛇行超車跟壓車，同時具有防衛性駕駛的概念，加上常常保養車，那你遇到意外，也就是不幸的機率就會極大幅降低\n\n這也是為什麼暗巷不要走、未成年半夜不要在有危險的地方、女生對所有人都該抱有一定的戒心，這些都不是為了檢討受害者而存在的論點，就跟防衛性駕駛的概念一模一樣\n\n而是這個世界就是這樣運作的，危險永遠都存在，在某年某月某日某時某分某秒，那個危險就是存在在那個地方，你無法預知也無法完全避免，但你可以讓自己受傷害的機率降低\n\n就像是速限是 110 但你不需要壓那個正負十的緩衝區刻意開很快，或者沒有測速照相跟警察在拍就貪快。那個路上的洞就在那裏，等的就是一個對危險不自知而沈浸在自己世界裡面的人\n\n總而言之要不要避免危險都可以，反正你沒犯法也沒有做錯任何事情，這一切都是你權衡之後決定的結果，例如要不要趕那兩分鐘騎快一點之類的，要不要考慮前面那個阿伯會突然鬼切，要不要擔心眼前的人會對自己伸出狼爪等等的\n\n最後遇到危險時承受後果的就是你自己，還有你身邊所有在乎你的人，即便犯錯的人最後受到懲罰，但那些他身上的痛永遠彌補不了你，你的傷口不會因此而痊癒，而是永遠都在，這樣到底虧的是誰大家可以好好想想\n\n### 所以成功跟運氣的關係\n\n實際上成功確實跟運氣高度相關，成功的因素不外乎是由運氣和努力構成，而運氣又分為外表、家庭、天賦、機會、純運。而努力分為選擇、付出、時間管理等，這邊就不贅述。實際上運氣真的真的真的很重要，例如我就沒什麼偏財運但很多貴人運，所以常常可以獲得很多機會。雖然身邊很多人都說那是因為我很努力才會被看上之類的，但我自己非常清楚我的運氣非常的好\n\n而運氣我也說過有可控不可控，對一個人來說不可控的因素真的沒有那麼有意義，因為你根本沒辦法怎麼樣，但可控的部分很多時候也會被人覺得是不可抗力，大家在思考的時候應該要好好想想有沒有辦法「趨吉避凶」，盡量提升自己碰到好運的機會，降低碰到壞運的機會\n\n運氣這個東西還有一句話可以體現，就是「靠運氣贏來的也會靠實力輸回去」，其實追根究柢就是一個人的實力期望值其實沒有很高，但它卻獲得成功或者獲得機會，最後隨著嘗試次數（樣本數）變高，實際值就會慢慢趨近期望值，也就成了別人口中的「靠運氣贏來的也會靠實力輸回去」\n\n",
    "date": "2023-06-13",
    "tags": [
      "社會課",
      "2023 十大精選文章"
    ],
    "isPinned": false,
    "textCount": 2313
  },
  {
    "id": "goodbye-economids",
    "title": "兔子窩｜就此別離經濟系",
    "content": "外人看來我就是一個不知足的大學生，但不知足才是一個人向前的動力",
    "markdown": "\n在台大四年其實遇到許多好老師以及爛老師，而在經濟系我遇到的超過一半都是爛老師，沒錯這是一篇黑特文，大家不喜歡看我也不在意。畢竟我當初可是特別為了台大經濟這四個字來到這裡的，但我卻對他失望至極。\n\n寫完這篇文我就跟這個系永遠說再見了，我不會再對他做任何的批評，畢竟他怎麼樣也跟我沒關係了。\n\n先說，我知道每個系都有爛老師，也知道每個系都有躲在象牙塔裡面的取暖老人，我知道台大經濟的教學品質在台大算是中間或甚至偏上。但我不在乎別的系怎麼樣也不想比爛，所以不接受什麼「經濟系已經很好了，你看 xx 系怎麼樣怎麼樣」這種說法：\n\n在台大經濟：\n\n- 有幾堂課你必須寫的跟老師自己出的課本，上面的課文內容「一模一樣」才會給分\n- 有的老師年紀大到他再多咳兩聲你就開始替他捏把冷汗\n- 有幾堂課的老師講的東西你 100% 聽不懂，而考古題每年都一樣所以永遠有人 90 幾，所以如果你沒有前人罩，恭喜，準備下去\n- 只要是演講課，請來的講者一個比一個爛，好像怕大家不知道台灣搞經濟的人多沒料一樣，不是對你一點啟發性都沒有的「董事長們」，就是滿嘴政治的「首席經濟學家」\n\n在這裡學到的東西 90% 出社會都用不到，所以不要期望好好的讀完這個科系會變成有用的人，我看過去大部分的經濟系同學只會對自己的未來感到徬徨而已。\n\n所以如果是學弟妹看這篇文，做好心理準備，正確地安排你的學分，如此可以幫助你走上正確的路，不相信也沒關係反正是你的人生我又不虧。\n\n---\n\n我對一堂課並沒有那麼嚴格，只要老師口齒清晰，不要英文不好硬要講英文，評分標準、作業繳交、考試方式清楚且定義明確就好，我就謝天謝地了。拜託了，老師好好把完整的 syllabus 在開學前清楚地訂好。\n\n要交幾次作業、考幾次試、佔比多少，有什麼規定，拜託講清楚，不要想出作業就突然出還不寄信通知默默的放上 COOL。\n\n老師自己有期望的高分「格式」或「模板」，不這麼做就絕對不可能高分，拜託講清楚，學生不是你的蛔蟲，沒辦法猜到你的腦袋瓜在想什麼。\n\n我最受不了的其中一個點就是經濟系有好幾個教授永遠不把規則說清楚，好像是邊上課邊想這堂課到底要幹嘛。然後大部分助教也不在狀況內，但我想也是，畢竟教授的那個樣子了，助教應該也很苦惱現在到底是什麼情況。\n\n---\n\n選修課我選到的基本上都屬於慘不忍睹，老師上課不是毫無重點就是口條不清，不然就是上的內容跟作業考試毫無關聯，也沒有提供足夠的助教和考古資源。總而言之學生如果不是天才，那考試憑藉的就是有沒有前人遺物跟通靈了。\n\n重點是評分也僵化的可憐，教授會沾沾自喜的覺得鐘型分佈或大部分人擠在中間偏後的成績很正常。很多這裡的教授會看學生的成績分布給成績，讓每個區間的比例都跟他想像的合理一樣。而不是設立一個明確的區間標準再來藉由學生的表現給予相對應成績。\n\n我實在不懂這樣的老師腦子在想什麼，如果一堂課每次只有個位數可以拿到 A+，或者是大部分人沒辦法達成好的區間，那應該要好好檢討自己怎麼教的那麼爛才對，怎麼還可以那麼開心。\n\n這也導致經濟系的學生找實習總是比管院的難，推研究所也很麻煩，明明一樣有一堆沒用的課但人家的課就是比較甜，在這裡你連演講心得都會被打個 70 分因為你沒有照著老師理想的樣子寫，而他「從來」沒跟你講過怎麼寫才會高分。\n\n說到底，在這裡的教授壓根不在乎學生從這裡畢業之後是什麼樣子，所以不用期待他為了你的未來著想，任何你有需要的東西請不要抱有過多的期待，否則只會受傷而已。\n\n---\n\n而不在乎你未來去哪裡的結果就是，請來的講座跟學生參加的研討會一點用都沒有，你永遠看見銀行的行員、不知道自己在幹嘛的董事長、從奇怪地方蹦出來的人資或者什麼主管教你未來的人生怎麼安排。\n\n每次經過社科院大門都滿頭問號，到底為什麼不請各個業界的經濟系學長姐回來，分享他們在哪個行業的酸甜苦辣或經驗談就好，看是提供學生一個未來的考慮方向，或者要怎麼精進自己的方向都好。\n\n請一些對學生毫無幫助的人來到底要幹嘛。\n\n---\n\n另外說到資料，放眼近五年哪個經濟系優秀的學長姐不是電資跟管院養出來的，至少我認識的都是。光是看搞資料的就好不要看搞金融跟純軟的，無論你是資料科學還是資料分析，都一定上過一狗票管院的熱門課，而那些課才是真正對你有幫助的。\n\n當然這也是為什麼他是熱門課，而經濟系知名的就只有全台大轉入最多人（最好轉）跟一堆猴子風波而已。\n\n經濟系自詡為最會處理資料的科系，還是一堆教授只會 R 跟 Stata 還有莫名其妙的 Julia。說實在的搞資料這件事情從找資料就開始了，不用 Python 我是真的想不到怎麼爬資料，怎麼做文字處理跟預處理。不會寫程式的人說要搞資料，屬實是天底下最大的笑話。\n\n所以各位看這篇文的學弟妹如果要走 data，「Python、統計、數學」才是你的目標，不要去弄那個社科院資料科學什麼的領域專長，別浪費時間去上社會學、政治學、社工導論，那個對你人生一點幫助都沒有。\n\n大家的人生自己負責，時間很寶貴，有的人在跟商管程、計量、線代拼命，而你在無病呻吟提出一些不切實際、無法真正改變社會的想法，最後你要跟他比搞資料，只能說高下立判。\n\n他在努力的時候你在對社會不滿，他在收穫的時候你還在對社會不滿，他在用賺到的名利改變社會的時候你仍在對社會不滿。\n\n---\n\n這四年我真的沒有在經濟系遇過哪個老師講課給我一種醍醐灌頂的感覺，或許是我沒選到系上真正很讚的老師，但大部分情況確實是老師們不斷刷新我預期的下限。\n\n而「我自己」在台大聽課時唯三有醍醐灌頂體驗的都在資管系，分別是 PD 的孔令傑老師、MDS 的李家岩老師、OS 的陳建錦老師。\n\n他們不只是上課所有的標準，包含作業、考試、Project 一切都說得清清楚楚明明白，上課還有條有理且常有讓人為之一亮的說法之外，對自己的投影片還極度熟悉，助教水準非常高而且都在狀況內，只要上課認真然後願意跟助教討論絕對可以拿到 A+ 而且學到超多東西。然後教授還對業界非常了解，這非常非常非常重要。\n\n經濟系的教授我沒看到幾個對業界有瞭解的，基本上我過了四年汲汲營營，我還是不知道純經濟系畢業以後可以幹嘛，經濟系的教授我猜他們自己也不知道，所以請來演講的才都是一些上了年紀沒有舞台發揮的人。\n\n我只能說如果這些來演講的老人現在才出社會，那他們 100% 活不下來，過去那種做工也能買房，有機會讀一點點書或有資源就很容易成功的年代，跟現在是完全不一樣的。\n\n所以，要自己知道自己要幹嘛，天助自助者，讀經濟系有全台大數一數二少的必修學分限制，所以有機會的話雙轉管院、電資都好，沒機會的話多去修他們的課，看是要衝 GPA 還是真的學一點有用的東西。\n\n會跟說大學不是就業訓練所的人，真的要遠離他，一個人在大學時候就必須不斷找尋未來的路，不管是準備研究所、找實習、發掘職業門檻跟未來趨勢，理解業界在乎什麼還有擴展人脈，進而在求學期間精進自己讓自己符合自己理想職業的需求。\n\n出社會一個月要賺多少錢是自己決定的，理工電資的人畢業就有學歷當神主牌，管院有一堆實習比賽經驗的人可以無痛轉正。\n\n而讀這種沒有明確就業導向的系的人，如果不主動找到目標然後好好努力，連賣肝跟找到實習的資格都沒有，更不用說找到好工作了。\n\n因為你不像理工科系必修強制把你的課表佔滿，讓你沒有辦法有一堆空閒時間去搞別的業務或者跑菁英才會去的趴踢。所以讀文組請認命，真的很閒，努力一點。",
    "date": "2023-06-12",
    "tags": [
      "兔子窩",
      "你的最佳職涯導師"
    ],
    "isPinned": false,
    "textCount": 3051
  },
  {
    "id": "no-mercy-for-leave",
    "title": "兔子窩｜背井離鄉最需要的是無情",
    "content": "我們都需要為自己的人生而活，我知道",
    "markdown": "\n「如果不用擔心家人的話，我也會出國不再回來」\n\n這句話不是開玩笑的，那天帶女朋友跟阿公阿嬤吃飯，他們說哪個表哥在美國讀杜克畢業要當管理顧問，然後說之後就不回來了。此時此刻就是彼時彼刻，我說了以上這句話\n\n為什麼我的能力肯定可以出國獨立闖蕩，為什麼不出國深造，其實大家都知道為什麼，不是我怕考試也不是怕自己不行，更不是怕孤獨\n\n什麼是孝順，我覺得大部分人對孝順的定義根本就完全不對，常常看見女生說他們很在乎男生是不是孝順。只能說真的是欠人騙，連自己都不孝順了還看得出來一個人孝順與否嗎，蝦到不能再蝦\n\n孝順不是愚孝，不是給爸媽超好的生活，甚至完全照他們的意願活著\n\n人以中庸的方式存在，就是你心裡要有他，如果真的有需要的時候，你在一個觸手可及的地方，不需要黏在一起但也不會讓他們見不到你，不讓他們擔心，甚至讓他們爲你的所作所為感到驕傲和開心，就是最大的孝順\n\n孝順是互相的，如果爸媽不值得孝順或者過度期望不合理的要求，那你就失去孝順的機會，因為你不需要賠上你的人生來完成社會的期待，你的孝順只是讓你們彼此更痛苦，因為總有一天你會無法滿足他的需求\n\n其實我對那種可以果斷說出國就不會再回來的人感到相當佩服，想必肯定是不夠成熟或者跟家人感情不好才會說出這種話。畢竟生死貌似在千里之外但也近在咫尺，感情也是，距離會讓人感到孤獨與失落，最後無法維繫\n\n誰不知道國外的薪水比較高、功成名就的機會比較多，而台灣競爭激烈就算了，牛鬼蛇神一堆然後就業環境又差。當然綜合考量之下在台灣成家立業是世界最優選擇，但年輕的時候誰不想趁身強體壯跟沒有妻小要顧，去矽谷或紐約大撈一筆然後回鄉養老\n\n但我只能說很多時候生命或感情都是倏忽即逝，等你已經有錢有閒有餘力的時候，那些你想要陪伴的人、同樂的人，早就不在身邊了，你的小孩早就長大成人也跟你無話可說了\n\n就因為我體會過失去生命中最重要之一的人，那樣的感受，我完全知道無可避免，但要做的就是減少遺憾。不斷地減少遺憾，會讓我們面臨巨變時不會後悔莫及，如果沒有事後那些後悔與檢討自己，一個人走出來的機率會高非常非常非常多\n\n如果有遺憾存在，那將會是一輩子都無法抹滅的痛",
    "date": "2023-06-12",
    "tags": [
      "兔子窩"
    ],
    "isPinned": false,
    "textCount": 893
  },
  {
    "id": "not-csee-engineer",
    "title": "社會課｜深論非本科工程師的決策過程",
    "content": "我自己就是一個非本科的工程師，所以算是分享我的歷程跟想法",
    "markdown": "這篇文作為我短暫幾年深思熟慮以後的結果，這段時間我跟許多業界厲害的老師們討論與相處，還有得到許多貴人的建議。所得到的關於如何成為合格的工程師，要不要考研究所，一切怎麼安排的思路歷程。\n\n### 補充說明\n1. 這邊我們只考慮四大電資，其他學校暫時不納入討論，但如果是好學校道理基本一樣\n2. 這邊不考慮出國讀 CS，因為那是完全不同的選擇，不是每個人都有能力出國，這也是完全不同的努力途徑\n3. 這邊的工程師包含 SWE、Full Stack、DevOps、Blockchain 等各種常見領域寫程式的人就對了\n4. 這邊不考慮學者跟研究路線，單純論就業目的（所以不要跟我說什麼讀研究所是為了學 blablabla 的）\n\n### 前言\n很多人都以爲非本科也可以當工程師，工程師應該不用看學歷吧？但其實事情沒那麼簡單，要當一個「好工程師」，計算機基本學科、該做的、該努力的你一個都跑不掉，甚至還要做的比別人更多，因為你沒有學歷當護身符，最後還得承受被質疑的風險。\n\n簡單來說就是，你要是沒有讀好最基本最基本的書，沒有把該會的學科學會，就不可能成為一個好工程師。\n\n### 你需要學歷嗎\n一個非本科的學生，要不要考電資研究所，最終目的都是要思考：「你要如何證明給公司看，自己是一個有資格承擔這個職位的人。」不是每個人都想要當一個超強或超好的工程師，我們的人生也可以剛好就好，剩下的部分應該拿來享受，這完全沒毛病。\n\n舉例來說，如果是電資學院的純血學士或碩博，不用多說你的大學已經替你背書了。人資跟老闆自然就不必針對初審太過要求，甚至即便你毫無經驗、毫無相關背景知識，也可以獲得進來再學、再魔改的資格。\n\n但如果不是本科，要說服人就得強迫自己做一堆 Side Project，甚至參加 Hackathon、Workshop、Study Group，還要有技術文章、研究文章跟其他 Output，最後是要有一定的實習、工作、助教經驗。\n\n聽起來很累對吧，但考研也一樣很累喔！其實我完全不覺得考研究所跟我以上舉的那些非本科要做的努力，哪種途徑有比較輕鬆。\n\n大碩連續三個月一星期補六天，一天七小時或更多，一個禮拜加上讀書時間少說要付出 60 小時以上，更不用說後來的刷題地獄。\n\n> 非本科又不想讀研究所的你，有比正在努力準備資工所的同學花費更多時間嗎？\n\n意思就是，想要當一個好工程師，你根本沒有輕鬆的路徑，如果你覺得自己好像過的沒有很痛苦，你就是正在被很多人遠遠拋開\n\n### 決策樹\n非本科的人要不要轉考電資研究所有幾個考慮的點：\n1. 如果沒有學歷，你能不能說服公司讓你入職\n2. 如果沒有讀過電資，你計算機基本學科是否已經掌握，包含：基本的數學、計結、資料結構與演算法、作業系統、程式設計\n\n前者當然是必須的，我們說過總而言之你得能找到工作。後者則看你想要當怎麼樣的工程師，以及爬的多高而定。\n\n擁有後者能夠讓你不會說的一口好功夫，很多我遇過的學長推上了電資碩博，找了個能夠舒適的教授，畢業出社會了，被一考一問，大家才發現你只是會出一張嘴，根本不懂寫程式的人。\n\n關於非本科的學生要當一個工程師，我只能說不考研究所根本不是捷徑，只是給你自己一個不被正確答案以及某一小部分繁瑣的無用知識束縛，且相信自己自制力、考驗寫程式熱情的機會。\n\n上述兩種，可以歸類為見招拆招跟按部就班不同方向，換個角度來剖析，見招拆招很有可能是空打木樁，按部就班很有可能是死讀書，大家要自己取捨目的跟方向，總而言之就是要一直努力就對了。\n\n我完全認同大部分純血台清交 >> 大部分非本科系工程師，我修過不少電資、資管的各種課，也當過兩門程式課的助教。純血有多優秀以及在這上面花多少時間我很了解。所以不要覺得自己做過一些 Side Project，看了網路上一些教學影片，上過什麼補習班就能跟他們相提並論。\n\n> 上過資工的課，被虐個一次就會知道那些差距不是一朝一夕、三言兩語就能補齊的。\n\n大部分三流非本科工程師最喜歡做的，就是 Fork 一堆很酷的專案，或去各種網站或 Youtube 上抄現成的 Demo。結果不懂的人看他們的 GitHub 就以為他們很厲害，但他們其實根本不懂也寫不出那樣的程式。\n\n這種人也很喜歡發一些東拼西湊的技術文章，並沒有親自想個實作來呈現自己反芻的精華，更沒有深入研究論文或英文原文。\n\n發文更一點學術倫理都沒有，參考的 Reference 完全沒在附上，想要裝做自己很厲害，或者是遮掩自己是抄來的事實。說到底跟那種加入中國社群還有中文新聞社團，然後整天搬運那邊的內容，假裝自己懂很多的區塊鏈騙子沒差多少。\n\n說完了非本科的就學決策，接下來講講要怎麼成為一個 Junior 工程師，歸根究底就是你過往的 CourseWork Project 跟 Side Project 努力多少，這時候就會表露無遺的體現。\n\n> 會不會使用 Git、會不會打 MD 文件，能不能快速上手新的程式語言，知不知道怎麼閱讀各種文件，知不知道遇到問題怎麼 Google，知不知道怎麼好好陳述你遇到的問題給人聽，知不知道怎麼去思考 Spec 的要求，知不知道怎麼團隊合作，能不能聽得懂別人在說什麼，能不能有高度的自學能力。\n\n這裡也體現了為什麼老闆寧願選一個純血但完全不懂區塊鏈、不會 Solidity的人，也不選一個發過 NFT、當過業界補習班講師的人。因為四大資工四個大字保證了他們在經過 CourseWork 後，能夠完成或快速掌握以上所有所有對 Junior 的要求。\n\n例如區塊鏈終究是電腦科學的產物，分散式系統、密碼學、網路協議、虛擬機與作業系統、資料結構與演算法，是一個一個基本學科組成的技術。不是會刻個簡單的智能合約就叫做區塊鏈工程師，那個每一個四大資工大一上完程式設計的學生都做得到。\n\n所以理想的選擇是：\n\n1. 學士期間盡量雙轉輔去電資管，或至少多修他們的必修課，以及有用的選修課\n1. 多認識厲害的同學、志同道合的同學，多討論\n1. 多做 Side Project\n1. 多發技術文章\n\n大四時或者已經畢業了決定要不要跨考電資研究所時，好好思考我這篇文提到的問題：\n1. 你的實習經驗、工作經驗是否足夠\n1. Project 經驗、技術文章、社群貢獻是否足夠\n1. 實力是否足夠\n1. 你害不害怕別人質疑你的能力，因為你非本科系\n1. 你有沒有在私下充實自己的習慣\n\n希望非本科的工程師都好好的把基本的計算機學科的課補齊，然後該做的努力一點都別少，想要用學歷證明就好好準備考研，想要更靈活的研究有興趣的內容來證明自己的，就好好去鑽研。想要找好工作、想要賺很多錢、想要遠端工作或漂亮的辦公室，這一切沒有捷徑。\n\n",
    "date": "2023-06-12",
    "tags": [
      "社會課",
      "2023 十大精選文章",
      "你的最佳職涯導師"
    ],
    "isPinned": false,
    "textCount": 2758
  },
  {
    "id": "pain-pretender",
    "title": "社會課｜真的是憂鬱導致，還是你就是沒有你想像中厲害",
    "content": "每個人都有低潮、懶惰、暴躁、焦慮的情緒，但如果不是生理因素所致的情況呢？",
    "markdown": "\n「原本以學術作為夢想的我竟然一個字都念不下去也寫不出來。」\n\n人生何嘗不是如此呢，但其實影響你的「並不完全是」憂鬱症，而是你根本就沒想像中的厲害。你以為自己可以跟夢想中的一樣，或你認識的其他優秀的人一樣，可以一直一直保持動力然後努力下去。\n\n但其實你不行。每個人達不到理想中的模樣，真的「只是」來自憂鬱症嗎。還是其實我們都沒有想像中的厲害，或許我們就是比較笨，比較沒有辦法專心跟維繫熱情和動力呢？\n\n不是每個人都在追求成功，更不是每個人都是聖人。但是如果想要達到優於平均的生活而且家裡不夠有錢，就不能整天拿著憂鬱症當神主牌。\n\n這個很傷人我知道，但也很現實。\n\n我知道憂鬱症是病，我知道大家都該接納憂鬱症，就像我們體諒任何其他疾病一樣。\n\n然而沒有任何人應該要為了病人降低成功的標準。你做不出學術研究的原因是憂鬱症，然而反過來說，憑什麼你沒有跟其他人一樣努力，一個字都看不下去，這個社會還要給予你研究的權利？\n\n所謂成功的人或多或少都會有性格上或心理上的缺陷。換個角度來說，我其實很同意「每個人」都會有或多或少的憂鬱情緒，或者是在某些時候因為激素等生理問題，或當下的環境跟遇到的狀況對心理造成影響。而最後都會讓自己的表現受到波動。\n\n我當然知道每個真正生病的人都希望自己被關心，但是憂鬱症跟憂鬱傾向，或甚至其他病絕對不是拿來延遲考試或讓別人體諒你的理由。\n\n我們可以為了你佈置你覺得舒適的應考環境，就像我們為視障學生提供放大鏡和解說員一樣。但我們不可能讓你比別人有更多的，或說「多非常多」的準備時間，卻擁有「一樣的評分標準」。\n\n人類生存在一個「社會」，這個社會本身要能夠永遠穩定的維持下去，適當的「限制」和「壓迫」是必然的。限制了每個人的考試時間都是幾月幾號幾點幾分，為什麼要為了生病的人而推遲呢。如果真的是（我相信也真的是）的話，那也得至少打八折處分，畢竟因為個人理由而獲得這樣的權利是不公平的。\n\n不戴口罩和不打疫苗就要罰錢或限制人生自由，跟我捅你一刀我就要去坐牢的意義完全相同，所有的限制都是為了讓這個社會的 outlier 回歸正常狀態。\n\n然而人類最終會為了自由和個人烏托邦幻想而毀滅，因為當生理需求成為了衣食無虞時，每個人遇到環境所逼就喊著自由人權，每個人只要遇到生活不如意就想自殺，每個人遇到生活不理想就想要世界遷就自己。每個人遇到對方不順從就拿刀砍了對方，最後要求法律或陪審員根據於情有理寬恕自己。\n\n這就是劣幣驅逐良幣的道理。當考試入學成為了妨礙受教權的標竿，進而推出來的「繁星」和「多元入學」成為了有錢出國長見識、打高爾夫球當社團、讀私立學校用學渣們墊高在校成績的有錢人小孩，獨有的專屬特權。\n\n開了私塾的台大教授占著茅坑不拉屎，佔教授缺卻不肯花時間發論文或帶實驗室的學生，整天打著招牌招搖撞騙然後賣課，最後能進到他「所謂正確教育制度」的學生，都是繳得起高學費的有錢人。一邊砲轟現行「為了平均」而屈就的教育制度，一邊實現「只有富人」負擔得起的完美理念。\n\n這就是劣幣驅逐良幣，當我們為了自以為是的公平和自由更改制度，會發現最後只是讓有錢人和權貴們更容易地達成目標。當我們一昧的降低房價，會發現有錢人可以買下更多間房子。\n\n社會跟大自然都是現實的，我能體諒溫柔的對待每個生病的人的道理。但在 Trade Off 所謂的公平和人權的時候，我覺得原住民和台語就算消失了也是正常的，應該說讀了經濟學的人都該很清楚：市場需要什麼人，什麼樣的價值才會被體現。\n\n不是每個人都要會寫程式，不是每個人都要追求成功模板，不是每個人都要賺大錢。但當你想要過上夢寐以求的生活，或許是大魚大肉，或許是小情小愛，或許是榮華富貴，或許是家庭和樂，甚至僅僅是三餐溫飽。\n\n不論追求什麼，你都要付出相對應的努力，真的沒有人會在乎你想什麼，只有愛你的人會。\n\n所以不要期盼那些不愛你的人會為了你的夢想而退讓，更不用說他的退讓，會讓其他人的夢想被隨之影響。\n\n",
    "date": "2023-06-12",
    "tags": [
      "社會課"
    ],
    "isPinned": false,
    "textCount": 1624
  },
  {
    "id": "rational-or-not",
    "title": "社會課｜存在宏觀思維下的合理性",
    "content": "會溫柔接住你的，都將使你摔得更慘",
    "markdown": "\n最近 IG 的放大鏡看見很多分享自己怎麼存錢、分享感情觀念、分享如何成功跟自律之類的內容。再加上昨天跟女朋友分享看到一個雄女學妹上了台大在拍 YouTube，八隻影片全部在講自己成績很爛怎麼賽到雄女跟台大，很典型的考上台大人生就結束的例子。\n\n闡述自己的成功並不是不好的事情，現代人都該學會怎麼分享自己的成功（無論卓越或微小）跟想法，才能夠被人看見進而得到機會。關於分享成功我們以後做一期視頻講解，然而我們一定會有身為接收資訊的人的時候，確實該好好了解一下哪些是真正可以幫助我們的內容，哪些是騙低端族群的內容。\n\n我一直以來就相信「只要存在即是合理」，當然這樣講會有很多漏洞，畢竟分享成功方法還有什麼努力方法的人，大部分他們根本就沒達到什麼成就；分享存錢方法的人也基本上不是住在台北甚至是住在家裡，方法根本不可參考。\n\n那他們的貼文影片得到那麼大的迴響，樂擎、冒牌生、Peter Su 的書賣的這麼好，難道他們真的是人上人嗎。\n\n然而從更宏觀一點的思考，可以得到幾個 background，能夠幫助我們了解這個世界跟人們多一點，也可以更坐實「存在即合理」跟「這些現象」之間若且唯若的關係。\n\n1. 如果所謂成功或者達成目標（例如存錢）這麼容易，那怎麼可能那麼多人知道？怎麼可能輕易分享給大家？怎麼可能那麼多創作者做得到？\n\n2. 從創作者跟分享者的角度，他是真的參透世間奧義，還是為了聲量賺粉絲數。得你做了一隻影片只是 for PR90 以上的人，跟做了一隻影片是 for 90 以下的人，怎麼看都是後者比較有賺頭，畢竟聰明人大多數又摳門又愛質疑\n\n3. 如果這些是對的，那真的那麼容易引起共鳴嗎，其實不然，真理跟世界運行的規則掌握在少數人手上。當然這邊的意思不是你想法特立獨行就是高人一等，而是如果跟普通人想法相同，那肯定還有更酷炫或更好的作法\n\n根據 Background 我們可以保有幾個態度：\n\n1. 就算有樂意分享正確觀念的成功人士，也是極少數，所以面對這些資訊首要就是打一個大大的問號，不是驚嘆號。你要做的是旁敲側擊確認一切合理，合理就接受，而不是一開口就用直觀反駁，這樣會顯得你很笨\n\n2. 不要感到羨慕或崇拜，你可以學習那之中微薄的優點，但達到大大小小的成就全部來自於慢慢累積，內化成你自己的價值觀跟理想的樣子，從來都沒有走在路上幾百萬突然砸在你臉上這種事情\n\n3. 有時間的話多看韓國的漂亮女生跳舞，不要看別人怎麼存錢跟成功的，也不要看太多幻想文，他根本也不用一個月繳兩萬的房租也沒有背學貸，跟你完全不是同一個起跑點\n\n推廣：你是不是常常覺得那些成功的人或者厲害的人，會講出一些你根本沒想過的話或想法，並不是單純沒想到或者沒推出來，而是他的思維、觀念、眼界根本就是不同維度的。\n\n所以環境很重要，你在什麼環境跟什麼樣的人相處，最後都是趨向那個環境的平均值，這也是為什麼要好好讀書，讀書不是萬能也不保證你功成名就，更不保證你身邊的人是牛鬼蛇神。\n\n但能讓你身邊的「平均」濃度提高，遇到不同維度的人的「機率」也會大幅提高。\n\n朋友是朋友，你不用要求每個朋友都要比你強或怎麼樣的，反正是朋友又不是同事。環境之中都是同一個思維的人會導致容錯率很低，不是大好就是大壞，所以朋友是很好降低容錯率的關係。\n\n放輕鬆一點相處，他說出來的話即便不是醍醐灌頂也可以帶給你另外一個同溫層的刺激，讓你不會在不適合或甚至錯誤的路上鑽牛角尖，身心靈也能得到適當的解放。\n\n但還是得遠離那些只會給無腦雞湯的朋友，珍惜落魄失意的時候願意給當頭棒喝的人。\n\n會告訴你：你很勇敢、你很棒、要溫柔接住你的朋友。就是你還在原地踏步的關鍵，就是你好像一次次的以為自己知道自己想要什麼，最後卻完全不知道自己在幹嘛的關鍵。\n\n冒著被你討厭的勇氣還要告訴你只有兩種可能，一就是他是個北爛人，二是他是真心的為你想。",
    "date": "2023-06-12",
    "tags": [
      "社會課",
      "2023 十大精選文章"
    ],
    "isPinned": false,
    "textCount": 1592
  },
  {
    "id": "why-university",
    "title": "社會課｜象牙塔，與你為什麼要讀大學",
    "content": "大學就是職業訓練所，出路很廣就代表沒專業",
    "markdown": "\n> 大學就是職業訓練所，出路很廣就代表沒專業\n\n我覺得，想著「大學就是要研究」就是把自己搞死的關鍵，就是因為大學端這句「大學不是就業訓練所」，所以才教出這麼多貌似懂理論但其實什麼都不會的學生，才會有那麼那麼多的人後悔自己讀的科系，也才會那麼多人不知道自己以後要幹嘛。\n\n事實是考上台大、讀研究所、拿卷不一定是了不起的，了不起的是能在一個每個階段都訂立自己的目標然後完成。\n\n而目標是什麼，這完全是教育者跟家長的責任。現在的情況是如果你是個願意努力的人，運氣很好受到某些啟發或碰到貴人，剛好碰到自己喜歡「且能當飯吃」的領域，那未來發展就會比較好。但如果運氣不好一直被教授騙，家長跟身邊的人也沒有太多想法，那你就很容易徬徨好久好久。\n\n反過來說純粹把大學當作學費證明的學生，也是蠻浪費時間的。有些理論非常重要，基本的東西也必須會才能讓自己把技術融會貫通。技術上的東西大部分都只要肯花時間就能學會，但如果要成為厲害的人最原理的東西還是要打磨跟精熟。\n\n這也是我一個蠻後悔的地方，如果可以把修本系爛課的時間拿去修更有意義的課，那應該是更理想的。不過沒辦法，我就是需要一張紙證明我有受過高等教育，而我又沒有好成績能夠逃出絕命鎮。反正我的故事不重要，這裡就不贅述了。\n\n大學端跟許多其實不知道自己在幹嘛的人，最喜歡拿「大學不是就業訓練所」這句話來把自己跟大家關在象牙塔裡。當然也有很多成績好又在職場順利的學生，但上了大學最最最最應該了解的事情是成績不是一切，搞研究也不是，自己找到想做什麼然後去努力才是重要的（不干擾別人為前提）。\n\n我猜大多數讀台大的人成績都很好，但讀台大完完全全不保證出社會有工作，更多的是被沒讀書或學校排名比你低的人嘲笑讀台大有什麼卵用，連 blablabla 都不會，或被驚訝說領那什麼打工仔薪水。\n\n常常有人跟我說他們覺得一直在搞自己事情的人好像更棒，是一個比拿卷跟維持成績更好的投資。我的解釋是如果你確定成績或學術研究是你的目標那當然完全沒毛病，但如果自己也不知道爭取是為了什麼那就真的要注意了。\n\n在台灣，不知道自己要幹嘛家裡又沒礦的人 100% 是讀書就對了，這就是這個國家的遊戲規則。但我認為那僅限於大學以前，上了大學之後要知道很會背誦、畫卡、解題技巧不是公司願意付錢給你的理由。\n\n（好啦我知道讀書有一部分是天份，而天份確實能讓公司付你薪水，但要找到自己有天份的領域就是重點了）\n\n而台灣的問題在於很多人知道遊戲規則是讀書就對了，確實可以有高機率找到穩定的工作，也有比別人高的機率得到高薪的機會，也可以在國家整體發展的層面下讓平均水平提升到最高，但也因此很多人浪費了大把時間在不對的地方。\n\n我不認為這是制度的問題（文末會講），而是教育者跟家長心態的問題。他們就是因為懶、因為沒有責任感、因為沒有走出舒適圈，所以才會到了大學還是告訴大家把書讀好就對了。\n\n我身邊有超多人拿卷是為了雙轉或推研究所，對我來說這是一個近乎完美的選擇，如果你能用推甄就上那當然是最好。但更多的是讀了四年書，成績還蠻好的但就是完全不知道自己想要什麼跟能幹嘛，迫不得已只好再簽下去兩年讀碩，剩下的以後再說。\n\n如果讀的是工作導向明顯的科系那就算了，反正台積電簽下去、證照考下去有錢總比沒錢好，但如果不是呢？\n\n這也是為什麼我之前有發一篇文說我在資訊系修課的時候聽到他們教授說了一些話眼淚快流出來，全文擷取：\n> 教授說：「三十年前我就想搞產學合作，讓每一個資訊系的學生都能來上資安程式設計的課，拿到證照之後出去跟老闆薪水多要幾萬絕對沒問題的。」\n> \n> 不知道為什麼我覺得聽到這段話很感動（先不論這個計畫的結果），雖然我不是資訊系的，但只覺得原來可以在一個教授的嘴巴裡面可以聽到他如何想著讓學生更有競爭力，然後拿到更多薪水\n>\n> 而不是這個研究院、那個什麼會，最後遇到問題就說：「這個問題真的很難，幾十年過了，我們還是不知道怎麼解決，所以真的推薦大家走學術，因為還有很多問題值得探討。」\n\n不要浪費時間在把你不知道為什麼要修的東西修到 A+，你應該把時間花在你跟教授、業界前輩、學長姊、親人、同學討論後，得到最值得投資的事情上面。\n\n我們上大學以前都是社會制度下的既得利益者，上了大學或出社會以後如果家裡沒有礦，換了一個生存規則，大家還有跟剛考上大學的時候一樣意氣風發的能力嗎。\n\n其實有，但就是要選對地方努力。\n\n---\n\n### 文末補充\n\n> 以上言論不代表我認同實驗教育，我反而認為實驗教育根本是垃圾，不是每個家長都很有錢能付出私立學校的學費，老師的數量跟素質也根本不足以完全應付每個學生的每個想法\n\n要讓國家整體的發展，平均知識水平提高，根本不可能照顧到每個小腦袋天馬行空的想法，正確的考試制度絕對是耗費最低成本但穩定報酬最高的制度。\n\n其實通篇重點在於上了好大學之後人生不是都結束了，也不是就不用努力了，而是下一個階段的開始。未來不僅僅是要把該做的事情做好，該懂的東西學會。一個人還需要：\n\n1. 學會不要鑽牛角尖\n1. 找到你以後想要做什麼",
    "date": "2023-06-02",
    "tags": [
      "社會課"
    ],
    "isPinned": false,
    "textCount": 2078
  },
  {
    "id": "temp",
    "title": "社會課｜",
    "content": "...",
    "markdown": "",
    "date": "2000-01-02",
    "tags": [
      "社會課"
    ],
    "isPinned": false,
    "textCount": 0
  }
];
